{
  "version": "https://jsonfeed.org/version/1",
  "title": "My Corner of the Internet feed for 100DaysToOffload",
  "home_page_url": "https://shanewrogers.lol/",
  "feed_url": "https://shanewrogers.lol/feed/feed.json",
  "description": "Just a place for me to share some stuff.",
  "author": {
    "name": "Shane Rogers",
    "url": ""
  },
  "items": [{
      "id": "https://shanewrogers.lol/posts/food-and-weight-again/",
      "url": "https://shanewrogers.lol/posts/food-and-weight-again/",
      "title": "Food and Weight Again",
      "content_html": "<p>I know that I have previously written on my struggle to work on maintaining my weight, as well as some of the body and confidence issues that go along with that.</p>\n<p>We shall count today's journal entry as yet another one of those.</p>\n<p>Within the next two months, August 8th I believe, will the the fifth year milestone of living a keto lifestyle.</p>\n<p>Before that, I remember sitting in my office chair and watching these amazing transformation videos of people. It always felt a little hypocritical of myself when I did this. There I sat, three hundred thirty plus pounds, knowing that I would never be able to be one of those with a success story of my own.</p>\n<p>Within weeks of starting keto, I knew that I wanted nothing more than to just be down a hundred pounds after one year.</p>\n<p>Well, I like to say that I basically turned that whole change into a game: how large of a calorie restriction could I maintain, how close to zero net carbs could I average?</p>\n<p>I blew way past that hundred pounds loss within that year and was already very close to my current weight already.</p>\n<p>My lowest weight was in the 168 pound ballpark. I'm a six foot two plus guy, and I know for a fact that that was too low. I did not look good.</p>\n<p>I have slowly worked back up to low 190s. Insofar as health goes, I know that's perfectly acceptable.</p>\n<p>But. Mentally, it is not good enough for me. I want 180s. For my mind, where I'm at is just too close to 200. I don't want to be there again.</p>\n<p>So, I know that I dropped the weight (I don't like to say I <em>lost</em> it, because I really don't want to <em>find</em> it again) really quickly. Probably not super healthily either. However, I have managed in many ways to change my relationship with food.</p>\n<p>I never really ate my feelings. It was more out of boredom than anything. Now, I really try to enjoy the feeling of looking better and use the extra time to read or work on some other self development process.</p>\n<p>If I have missed anything at all during this life change, it's that my hair is no longer thick and composed of ringlets (think Weird Al hair). That's about the only thing I miss. But, it could be age related as well.</p>\n<p>Today has been a good day, thus far, when it comes to food. Here's to keeping on.</p>\n<p>This is post 5/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-20T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/power-or-lack-thereof/",
      "url": "https://shanewrogers.lol/posts/power-or-lack-thereof/",
      "title": "Power Or Lack Thereof",
      "content_html": "<p>What to say about today?</p>\n<p>Today is Juneteenth. This would be the first year that my place of employment has (I think...) provided those of us who are able to have the Holiday off, off. There are those who are declared as essential, so I would assume that they could have their Holiday moved, or just make the extra pay. I don't honestly know how that will work for this case.</p>\n<p>Me, being a white, caucasian, cis dude who is near half a century old at this point in his life...I can not help but just feel really kind of weird having this day off as a Holiday. Now, I absolutely do believe that it should be a Holiday, no doubt about that.</p>\n<p>It just feels strange for me, personally, to have the day out.</p>\n<p>Okay, that's about as political as I ever want to get.</p>\n<p>In other moments of not so much excitement, the power was off for an hour or so here.</p>\n<p>No idea what happened, but it did provide a moment to ponder and read a part of my newest book:</p>\n<p><img src=\"https://cdn.some.pics/swrogers/6671c7a543862.jpg\" alt=\"Photo of book &quot;Jonathan Strange and Mr. Norrell&quot; by Susanna Clark. First Edition, First printing, US Edition, Black Cover.\"></p>\n<p>I remember watching the series of this when it aired a few years ago and thought that it might make a good read.</p>\n<p>I was grateful to have found a good hardback copy of the first printing/first US edition for a really good price.</p>\n<p>Here's to eventually getting it finished!</p>\n<p>This is post 4/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-19T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/not-from-the-peanut-gallery/",
      "url": "https://shanewrogers.lol/posts/not-from-the-peanut-gallery/",
      "title": "Not From the Peanut Gallery",
      "content_html": "<p>I am notoriously difficult to purchase any kind of gift for.</p>\n<p>Anything that I generally want, I have a tendency to go ahead and make the purchase at any and every time.</p>\n<p>Anything that I <em>don't</em> immediately buy, is most likely because the item just cost too much and I can not justify the purchase.</p>\n<p>I do have a few things that I enjoy though, and high on that list is anything and everything Peanuts.</p>\n<p>Of the <a href=\"https://en.m.wikipedia.org/wiki/Charles_M._Schulz\">Charles Schulz</a> variety, of course. Charlie Brown, Snoopy, Woodstock, all of them! I've been enamored of the crew since I was a child.</p>\n<p>Some of my earliest memories of reading, not just making things up and babbling and looking at pictures, is of laying on the living room floor, the Sunday Comics spread open in front of me, reading and laughing at Peanuts.</p>\n<p>I remember Dad asking me if I was actually reading, then him being surprised when I said yep!</p>\n<p>All of that to say that my wife is pretty awesome! She always knows what to get me.</p>\n<p><img src=\"https://cdn.some.pics/swrogers/6671b4a30cb0e.jpg\" alt=\"A Charlie Brown Squish Mellow. \"></p>\n<p>The best squishmellow of all time!</p>\n<p>This is post 3/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-18T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/the-banana-thing/",
      "url": "https://shanewrogers.lol/posts/the-banana-thing/",
      "title": "The banana thing",
      "content_html": "<p>Last night my head was killing me.</p>\n<p>This morning my head was still killing me. I have to say that I consider myself extremely fortunate to have a very flexible career that affords me the ability to take time when I need it. It is not something that need be done very often - not for myself anyhow - but I'm more than happy to take it.</p>\n<p>Currently, I'm sitting in the quiet of the dinning area, watching one of the kiddos make some kind of banana <em>slash</em> chocolate <em>slash</em> puff pastry dessert that he and Mom had seen online somewhere. It looks interesting, and I'm sure it'll be tasty for them.</p>\n<p>Did I mention that this kiddo is only just out of fifth grade? He's been baking and cooking for what seems like a couple of years now. The kiddo is very driven and fairly well rounded.</p>\n<p>Normally, anyhow. Sometimes these kids will surprise with some of those &quot;You asked what?!&quot; questions. They are all super intelligent, have gifted IEPs in school, but still - on occasion - they show their age and remind us that they are still children, and need guidance to make their way.</p>\n<p>And that is perfectly fine. It's what we are here for.</p>\n<p>This is post 2/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-17T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/happy-fathers-day/",
      "url": "https://shanewrogers.lol/posts/happy-fathers-day/",
      "title": "Happy Fathers Day",
      "content_html": "<p>As today prepares to come to an end, I'm sitting here at home waiting on the ibuprofen and acetaminophen cocktail to do its thing.</p>\n<p>We did make it to Worlds Of Fun, as a way to have a fun Father's Day. It was a pretty good day. There were a couple of us that managed to get in a few good coaster rides, facilitated by some decently short lines.</p>\n<p>I had never ridden the Prowler before today - definitely one of my new faves. It's an older wooden coaster, I think it's celebrating a birthday this year as well. I'm kind of surprised that I had never been on it previously, but sure glad that I did.</p>\n<p>Now I've just got to get over the heat and sun induced ache that I've put myself through.</p>\n<h3 id=\"the-sunday-linkdump\">The Sunday Linkdump <a class=\"direct-link\" href=\"#the-sunday-linkdump\">#</a></h3>\n<p>I don't really have a whole lot this week, as I've just not really had the time to go down too many rabbit holes this week.</p>\n<p><a href=\"https://www.tiltedwindmillpress.com/product/ryoms-preorder/\">Michael W Lucas' Run Your Own Mail server preorder</a> I've previously run my own mail server, sort of successfully, but not from scratch. This book is on my radar.</p>\n<p><a href=\"http://www.phrack.org/index.html\">Phrack Magazine</a> Somebody had brought up 2600 magazine awhile ago, and this is another (non printed) magazine that's dedicated to the scene. I've read 2600 for decades, and also enjoy reading this one when it's available.</p>\n<p>Like I say, not a lot this week.</p>\n<h3 id=\"end-stuff\">End stuff <a class=\"direct-link\" href=\"#end-stuff\">#</a></h3>\n<p>I'm going to consider this my first entry into the <a href=\"https://100daystooffload.com/\">#100DaysToOffload</a> challenge for the next 365 days. I don't have any special pages set up for these, besides using the hashtag.</p>\n<p>This is post 1/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-16T21:05:11+00:00"
    }
  ]
}
