{
  "version": "https://jsonfeed.org/version/1",
  "title": "My Corner of the Internet feed for 100DaysToOffload",
  "home_page_url": "https://shanewrogers.lol/",
  "feed_url": "https://shanewrogers.lol/feed/feed.json",
  "description": "Just a place for me to share some stuff.",
  "author": {
    "name": "Shane Rogers",
    "url": ""
  },
  "items": [{
      "id": "https://shanewrogers.lol/posts/long-weekend-and-no-motivation/",
      "url": "https://shanewrogers.lol/posts/long-weekend-and-no-motivation/",
      "title": "Long weekend and no motivation",
      "content_html": "<p>Happy long weekend all!</p>\n<p>I guess.</p>\n<p>I can't really relax, I have this constant feeling today that I need to be doing something. Anything.</p>\n<p>It's not like I've been lazy today, either. Woke up, made my mug of coffee. Cleaned out the floor of our &quot;soon to be coat&quot; closet. Emptied the dishwasher. Filled the dishwasher. Ran the dishwasher. Took my first sip of coffee.</p>\n<p>Still there are so many things that need to be done. Or, that I feel should be done.</p>\n<p>I should mow the lawn, for example.</p>\n<p>I can't get motivated today.</p>\n<h3 id=\"the-weekend\">The weekend <a class=\"direct-link\" href=\"#the-weekend\">#</a></h3>\n<p>We had a pretty decent weekend I guess.</p>\n<p>Saturday was a birthday party for the daughter of a friend. Our little man enjoys going over there, so it was a good time.</p>\n<p>Sunday was the penultimate day for the local water park to be open this year, so we went out that direction. I didn't go there as I'm not as big a fan, but the wife and the little did go and seemed to enjoy the day.</p>\n<p>Myself and the eldest twin went to the amusement park side. It was really pretty good, not too hot, not too many people. We were able to get in half a dozen rides in - mostly coasters - within a handful of hours.</p>\n<p>Any time you don't have to spend three hours in a single line is a good day.</p>\n<p>Afterwards, we met up and had dinner in the the amusement park so the little guy could ride some stuff too.</p>\n<p>Then the adults got to eat.</p>\n<p>It was a successful trip, all in all.</p>\n<p>We'll be back in a couple of weeks for the halloween haunts they set up. Those are great!</p>\n<h3 id=\"link-dump\">Link dump <a class=\"direct-link\" href=\"#link-dump\">#</a></h3>\n<p>A day late and a dollar short. Refunds can be had at the door.</p>\n<ul>\n<li>\n<p><a href=\"https://fighthealthinsurance.com\">Fight Health Insurance</a><br>\nHave you ever been denied a health insurance claim? This site was built by a user who was sick and tired and wanted to help others. So this was created using an LLM.</p>\n</li>\n<li>\n<p><a href=\"https://sfstandard.com/2024/08/23/holden-karau-fight-health-insurance-appeal-claims-denials/\">'Make your health insurance company cry': One woman’s fight to turn the tables on insurers</a><br>\nAn article on the previous link.</p>\n</li>\n<li>\n<p><a href=\"https://landsat.gsfc.nasa.gov/apps/YourNameInLandsat-main/index.html\">Your name in LANDSAT</a><br>\nThis is just cool. 😎</p>\n</li>\n</ul>\n<p>This is post 35/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-09-02T16:00:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/did-we-not-just-do-that/",
      "url": "https://shanewrogers.lol/posts/did-we-not-just-do-that/",
      "title": "Did we not just do that",
      "content_html": "<p>It's almost like it never ends, you know!</p>\n<p>Received an email notification from <em>Ye Olde Vendor</em> that they were scheduling the next patch for our development environment. Great! But damn...it sure seems like we <em>just</em> went through all this!</p>\n<p>I guess that was in mid to late May. But <em>test</em> didn't get patched until flipping June, not to mention <em>prod</em> not that long ago.</p>\n<p>Ugh. At least they actually keep stuff updated. No new patches available for the gateway product, yet, so we'll keep an eye out there.</p>\n<p>It's been a pretty good week, actually. Got some documentation written and sent out. Got a quote and an order out together for some new laptops to replace out of warranty stuff. Not a bad week.</p>\n<h3 id=\"no-flame-wars-here\">No flame wars here <a class=\"direct-link\" href=\"#no-flame-wars-here\">#</a></h3>\n<p>I figured I'd start a separate header for this one.</p>\n<p>I have always been of the belief that you should use the tool, or tools, that work for you and your situation. If that took us, say, <em>vi</em>, then great! If that took is <em>emacs</em>, then great! Personally, it effects me exactly zero on the iota scale.</p>\n<p>Whatever makes you happy and floats that boat, or scratches that itch, or whatever. Though, I do believe that every body who is going to do any kind of system administration on a Unix style server should at least be able to stumble through vi or vim. If for no other reason than it's almost always available.</p>\n<p>Then even within those two sacred camps you've got people who espouse certain styles of usage. Take emacs, for example. Some people like to use the &quot;starter kits&quot;. Be that purcell, spacemacs, doom, bedrock, etc etc. Some people think you should use vanilla. Some people swear by a literate programming version of their config.</p>\n<p>Those are all awesome! Again, use what works for you. Personally, I'm familiar with vi enough that I'm a little dangerous. I don't have any kind of vi setup, I just know enough to get by. I have used emacs for some time now, my first real usage and &quot;config&quot; was spacemacs. Then I've gone through other kits. I've tried rolling my own, with and without a literate config. I've finally stopped with doom, complete with my own customizations.</p>\n<p>Just use what works. In Whatever way that is.</p>\n<p>That's all I've got on that.</p>\n<p>This is post 34/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-30T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/irrationality-it-is/",
      "url": "https://shanewrogers.lol/posts/irrationality-it-is/",
      "title": "Irrationality it is",
      "content_html": "<p>Sometimes I just don't really know.</p>\n<p>There are days that I just want to give up.</p>\n<p>Throw in the towel.</p>\n<p>Half of today was one of those.</p>\n<p>Things were okay for the most part, but then, the crap just gets flung into my face.</p>\n<p>Then, I turn irrationally angry.</p>\n<p>My mood sours and I become dour.</p>\n<p>I just, don't know.</p>\n<p>I guess I'm glad I've not done anything I won't regret doing.</p>\n<p>Right?</p>\n<p>This is post 33/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-27T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/oceans-of-tiredness/",
      "url": "https://shanewrogers.lol/posts/oceans-of-tiredness/",
      "title": "Oceans of tiredness",
      "content_html": "<p>Just got back from taking the kiddos to the local water and amusement park locale...we are all incredibly tired and wore out.</p>\n<p>It was, supposedly, a heat warning kinda day - but honestly it didn't seem nearly as bad as it has in the past. At the park, I didn't even get in too bad a shape until towards the end, and to be realistic I was actually cold.</p>\n<p>It goes along with water and not having a large amount of body fat these days. Something of a side effect I suppose.</p>\n<p>After spending some time with the kiddos in the wave pool, we headed over to the adjoining amusement park and fed the family. The nearby diner has a decent selection of, well, cheeseburgers or chicken fingers, salad, fruit, fries and onion rings.</p>\n<p>Lots of stuff that the kids like.</p>\n<p>Since we have four &quot;dining meals&quot; to go along with the gold entry passes, it makes things more worth it to eat a couple of meals there.</p>\n<p>But, good grief am I shockingly sore.</p>\n<h3 id=\"link-dump\">Link dump <a class=\"direct-link\" href=\"#link-dump\">#</a></h3>\n<p>I don't know how much I'll have for the weekly link dumpage, but here we go!</p>\n<ul>\n<li>\n<p><a href=\"https://github.com/mayank99/11ty-jsx-deno\">mayank99 11ty jsx and tsx template</a><br>\nI'm not really a huge fan of jsx style templating, but I can certainly appreciate the work that others have put in.</p>\n</li>\n<li>\n<p><a href=\"https://www.evalapply.org/posts/clojure-web-app-from-scratch/index.html\">Aditya Athalye - Clojuring the web application stack: Meditation One</a><br>\nI haven't read all of this one, but I'm looking forward to going through it all. I love clojure, and I like trying to write apps and web apps with it</p>\n</li>\n<li>\n<p><a href=\"https://www.analog.cafe/r/a-functional-lego-camera-kit-lego-zh1-i9j8\">Zung Hoang - LEGO camera that works!</a><br>\nAs an <em>adult fan of LEGO</em>, I love this <strong>a lot</strong>.</p>\n</li>\n</ul>\n<p>All right, I'm gonna call that a night!</p>\n<p>Take care, till next time.</p>\n<p>This is post 32/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-25T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/upgrades-and-accomplishments/",
      "url": "https://shanewrogers.lol/posts/upgrades-and-accomplishments/",
      "title": "Upgrades and accomplishments",
      "content_html": "<p>Some days you just feel like you got at least one thing accomplished.</p>\n<p>Today is one of those days.</p>\n<p>This morning was good, upgraded one of our development applications to the latest vendor patch. The super awesome thing about this being that as of the middle of last week said update was not available....though it probably should have been. Given the name of the patch and all is from <em>last month</em>.</p>\n<p>Sigh.</p>\n<p>Then, I was able to get some simple documentation done for our users. Granted, I think that we all know that it matters not how well said documentation is written, it's not gonna be good enough.</p>\n<p>Additionally, got some requests fired off to another vendor.</p>\n<p>Nifty.</p>\n<p>Tomorrow is another day. The plan for noonish is to upgrade the same application previously mentioned, but in the test environment.</p>\n<p>It is <strong>so nice</strong> actually having both DEV and TEST.</p>\n<p>I'm not anticipating any issues, I think I've got this down to a science.</p>\n<p>Till next time!</p>\n<p>This is post 31/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-21T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/not-a-day-late-nor-a-dollar-short/",
      "url": "https://shanewrogers.lol/posts/not-a-day-late-nor-a-dollar-short/",
      "title": "Not a day late nor a dollar short",
      "content_html": "<p>I would say that I'm a day late with my post, but then than would imply some sort of contract between myself and the reader. I'm pretty sure that we are all aware that there is no such thing here. Ha.</p>\n<p>Last week I did go ahead and get a pre-order in for <a href=\"https://io.mwl.io/@mwl\">Michael W Lucas'</a> new book on <em>Run Your Own Mail Server</em>. The ebook has already been delivered and I'm very much looking forward to flipping through the paperback when it arrives. I had considered picking up the hardback, but that cost is a little more difficult to justify.</p>\n<p>I don't necessarily intend to run my own mail server from scratch, but you never know. I do, however, currently run a mail server via yunonost and have in the past used mail-in-a-box, which is very nice as well.</p>\n<p>They are mostly just toy or hobby servers in my case though.</p>\n<p>Now that the kiddos are in school and it's super quiet during most of the day, I've been more able to take some time to get out and walk during the mid day once again.</p>\n<p>Related to an earlier post of mine, these are not exactly mind clearing excursions, but moreso a way to get active once again.</p>\n<p>Currently my average is right around the fifteen minute minute mile, or just below. I want to get faster, and once I'm super comfortable with my progress I will attempt to jog it.</p>\n<p>All for my goal to, possibly, maybe, run a 5K.</p>\n<p>Today's walk was pretty good, I changed my route up quite a bit and made a much larger circuit. Although it didn't actually make much of a difference in the distance, very negligible.</p>\n<p>Anyhow. That's what I've got, I think I've worked on this entry long enough now. It's been sitting for a couple of days.</p>\n<p>This is post 30/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-19T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/not-so-competitive-for-success/",
      "url": "https://shanewrogers.lol/posts/not-so-competitive-for-success/",
      "title": "Not so competitive for success",
      "content_html": "<p>There are a couple of things that I've recently realized about myself.</p>\n<p>One of them is something that I'm absolutely terrified about.</p>\n<p>Another is just a quirk, an interesting tidbit about me that I hadn't fully recognize before.</p>\n<p>First - in some ways success terrifies me.</p>\n<p>Second - while I'm about the least competitive person that I know, I'm always extremely competitive against (with?) myself.</p>\n<h3 id=\"item-the-first\">Item the first <a class=\"direct-link\" href=\"#item-the-first\">#</a></h3>\n<p>I'm sure that I'm not the only person out there that is terrified of something turning out to be successful. Whatever that something might be.</p>\n<p>Whether it's putting myself out there when looking for employment, for example, I have that fear not of <em>what if I get denied</em> but of <em>what if I get approved?</em></p>\n<p>Then there are social situations. This might, or might not, have just as much to do with being introverted as well, though.</p>\n<p>Let us say that I were to go looking for some kind of connection. Platonic or otherwise, it makes no matter. Frankly, I'm terrible at small talk. I've been told that I'm a competent communicator, but that's not necessarily for me to decide.</p>\n<p>I don't know how to make friends any more. It's tough.</p>\n<h3 id=\"item-the-second\">Item the second <a class=\"direct-link\" href=\"#item-the-second\">#</a></h3>\n<p>I have never been competitive.</p>\n<p>Ever.</p>\n<p>I was basically forced into playing team sports when I was a kid (granted, T-ball was fun - ha). Baseball. Basketball. Football.</p>\n<p>I could actually pitch with either left or right handed. Couldn't do it now to save my life, but it was a thing I was capable of.</p>\n<p>I never liked any of it though.</p>\n<p>Probably didn't help that all of the teams I was on stunk. But that's not relevant.</p>\n<p>I was able to come to the conclusion the other day that the only person I compete with, in any way, is myself.</p>\n<p>And it does not allow me to relax. Ever.</p>\n<p>Take keto, for example. When we started on keto five years ago I dove into the deep end. Got an app and basically <em>gamed the heck out of it</em>. I would try to see just how few carbs I could do compared to all the other users of the app. Routinely I fell into the top tier and could easily go less than 5 to 7 net carbs a day. Logging everything.</p>\n<p>I would go to sleep at night super stoked to get up in morning to see how much weight has fallen off. Quite often it would be a pound or so.</p>\n<p>Was it safe? Not really. But it was my addiction, that self competition.</p>\n<p>Another example would be when I take my noon walks.</p>\n<p>I would imagine that when most people take walks it helps to clear their minds for the time ahead.</p>\n<p>Yeah, that's not how my head works.</p>\n<p>My oh my how I wish it did.</p>\n<p>Nope, I have this constant beat that runs through my mind: <em>one, two, three, four, one, two...</em> On and on and on.</p>\n<p>I have the need to push myself, quicker and quicker. Finish strong! I tell myself.</p>\n<p>I matters not if I've got music in my ears or listening to an NPR podcast. Same story.</p>\n<p>Why can't I just relax?</p>\n<p>This is post 29/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-15T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/smooth-days/",
      "url": "https://shanewrogers.lol/posts/smooth-days/",
      "title": "Smooth days",
      "content_html": "<p>The first day of school for the kiddos is in the bag!</p>\n<p>Everything would seem to have gone nice and smooth, although it's not that much is actually done during the first day.</p>\n<p>I have to consider the fact that all of the kids really enjoy school, which does make things so much easier.</p>\n<p>Granted, the majority of them are teenagers (more or less) so all is not peachy and rosy. Sometimes just getting the older ones up and about can be quite the chore.</p>\n<p>But, I will most certainly take that little inconvenience over having a house full of kids that want nothing to do with school.</p>\n<p>Blessings counted and duly noted.</p>\n<h3 id=\"other-things-that-went-smooth\">Other things that went smooth <a class=\"direct-link\" href=\"#other-things-that-went-smooth\">#</a></h3>\n<p>Today has been kind of a day to dread for me. Two meetings that center around a project that has my anxiety levels beyond maxed out.</p>\n<p>We are moving from one &quot;top tier, best in class&quot; system (brought to you by Atlassian) to another....which isn't quite as user friendly.</p>\n<p>For both service desk (help desk ticketing) and project management.</p>\n<p>The help desk side is fine. Whatever.</p>\n<p>The project side. Could use a bit of <em>TLC</em>.</p>\n<p>It's going to require a bit of a rethink in the way we use the software.</p>\n<p>But, even the contact that we were able to work with today realizes and concedes some of the shortcomings.</p>\n<p>How fantastically refreshing.</p>\n<p>Still, it's not gonna alleviate a lot of the pushback from staff that I'm anticipating.</p>\n<p>Still not looking forward to it.</p>\n<p>This is post 28/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-14T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/the-day-after/",
      "url": "https://shanewrogers.lol/posts/the-day-after/",
      "title": "The Day After",
      "content_html": "<p>Whew, one day post birthday and one more on the books.</p>\n<p>For myself, I consider my birthday to be just another day. I can't say that I really care how the day goes, one way or the other. I would assume, like most other adults my age - it's just another day.</p>\n<p>I'm 47 as of yesterday. It's not a milestone year, just another step in the path.</p>\n<p>I don't feel 47. It's no different to me than, say 42 or 45.</p>\n<p>It's kind of surreal, if I were to say it was anything.</p>\n<p>When you're a kid, you don't really think of middle age. It's just something that you don't really see yourself being.</p>\n<p>Then, all of a sudden, your trying to put things into perspective. I try to place myself into my father's mindset and shoes and whatever when he was my age. How things were back then.</p>\n<p>How things have changed.</p>\n<p>I'm sure there's a word for the way I think, the way I feel.</p>\n<p>Ah well.</p>\n<h3 id=\"b-day-stuff\">B-Day Stuff <a class=\"direct-link\" href=\"#b-day-stuff\">#</a></h3>\n<p>The day before my birthday, we made pizza for the kiddos so the wife and I could get out and have a good dinner. I guess by good, I mean expensive.</p>\n<p>Well, of course it was good. We went out to a local fish house and raw bar. Big plate of broccolini and a delicious Greek salad with some of the sweetest cherry tomatoes we'd ever had. Then a large plate of oysters, shrimp, lobster tail and snow crab. Pretty good.</p>\n<p>Yesterday, we went to Worlds of Fun. Probably not the best idea as it was super busy. Gotta love lines. We were there maybe six hours and my eldest twin and I only rode three things. We've got passes, though, so we'll go back eventually.</p>\n<p>Today, we are just relaxing. New school year shoe purchases and mowing the lawn.</p>\n<p>Tomorrow, while not the first day of school, is close enough that the flurry will commence. I'm a little anxious about it all, the mornings are going to be really hectic around here.</p>\n<h3 id=\"link-dump\">Link dump <a class=\"direct-link\" href=\"#link-dump\">#</a></h3>\n<ul>\n<li><a href=\"https://blog.smithsecurity.biz/hacking-the-scammers\">https://blog.smithsecurity.biz/hacking-the-scammers</a><br>\nDEFCON is going on currently, and I love a good tale. I imagine that most of us have received those stupid &quot;USPS&quot; delivery package text messages. Here, Grant tells the tale of, ahem, someone taking things into their own hands.</li>\n<li><a href=\"https://100go.co\">https://100go.co</a><br>\nI don't really write in Go, but I'd like to. This seems like a decent list of what to avoid, perhaps.</li>\n<li><a href=\"https://wedistribute.org/2024/08/decentralized-social-icons\">https://wedistribute.org/2024/08/decentralized-social-icons</a><br>\nI don't think I could explain it any better than they could: <em>It's like Font Awesome, but for Platforms &amp; Protocols</em></li>\n<li><a href=\"https://sfwriter.com/ws7.htm\">https://sfwriter.com/ws7.htm</a><br>\nI'm more of an Emacs user, but I can certainly appreciate Wordstar. Here is an <strong>awesome</strong> package put together by author Robert J Sawyer.</li>\n</ul>\n<p>With that, I think we're good.</p>\n<p>This is post 27/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-11T20:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/five-years-keto/",
      "url": "https://shanewrogers.lol/posts/five-years-keto/",
      "title": "Five years keto",
      "content_html": "<p>It's funny how some things work out, you know?</p>\n<p>Yesterday was a milestone post for my bloggy journal thing, whatever one wants to refer to this site as, and today is a life changing milestone in that today is the fifth anniversary of the day that I started keto.</p>\n<p>Five years ago we made huge lifestyle changes. We were both sick and tired of being obese and wanted to see our kids grow up and have lives of their own.</p>\n<p>Five years ago we decided that we wanted to model better behavior for our kids, at least as far as nutrition choices were concerned.</p>\n<p>Five years ago I was well on my way to diabetes I'm sure of it. On my way to an early death at least.</p>\n<p>Five years ago I weighed over 330 pounds. I hated how I looked. I hated how I felt. I hated that I couldn't sleep without a CPAP.</p>\n<p>Now, while most of the physical stuff has changed and I'm significantly in a healthier state, I'm still working on my mental health. Though not as actively as I did on my physical body, I'll admit.</p>\n<p>But, at least now I can select from a wider variety of clothing while I do it.</p>\n<p>This is post 26/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-08T19:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/updates-of-life-and-systems/",
      "url": "https://shanewrogers.lol/posts/updates-of-life-and-systems/",
      "title": "Updates of life and systems",
      "content_html": "<p>I suppose this is the first milestone that I've reached for the 100 Days To Offload challenge - post number 25!</p>\n<p>As those who have read many of my previous posts (and, thank you for that!) you may know that I have struggled of late with some aspects of my keto lifestyle. Not so much the keto part, per se, so much as the amount of calories that I haven't been logging and keeping account of.</p>\n<p>In other words, snacking.</p>\n<p>I was standing in the kitchen earlier today, having toasted a slice of &quot;keto friendly&quot; bread (the heel, if you're curious), buttered and cinnamon &quot;sugar&quot; topped....and stared at it.</p>\n<p>I took a bit of a pause at that moment: <em>did I really want to eat this</em>? I've gone from thinking that I could easily do a 24 hour fast (perhaps even going longer for more frequent timing), to this undesirable feeling that I've got to snack.</p>\n<p>It's not even that I feel hungry.</p>\n<p>I used to eat out of boredom, maybe that's what I'm going back to? I need to get back in the game, my head is just a bit on the spacey side.</p>\n<p>I need to be able to look in the mirror again and be proud of what I've accomplished.</p>\n<p>It's a strange feeling.</p>\n<h3 id=\"in-the-world-of-work\">In the world of work <a class=\"direct-link\" href=\"#in-the-world-of-work\">#</a></h3>\n<p>I was able to get one new task taken care of earlier today. While nothing earth shattering, it was an important item that needs to be done and it makes me a little more useful - not a bad thing.</p>\n<p>Now, I'm getting to work late/after &quot;normal&quot; hours to essentially babysit another application upgrade.</p>\n<p>Not that I mind, it should be uneventful. But you never know.</p>\n<p>The main fun with this type of work is that you get to do it while everybody else in the house is home and I'm downstairs in the &quot;dining room&quot;.</p>\n<p>At least all I should have to do is monitor some CPU cycles then re-enable some schedules.</p>\n<p>....and that went off without a hitch.</p>\n<p>Until next time, we shall leave it at that.</p>\n<p>This is post 25/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-07T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/after-the-storm/",
      "url": "https://shanewrogers.lol/posts/after-the-storm/",
      "title": "After the Storm",
      "content_html": "<p>Talk about one heck of a week.</p>\n<p>We had a pretty standard storm come through the area on Wednesday night, with the added benefit of up to 80 mile per hour winds at the head of it. Lots of trees down. Lots of power lines down. We were without power for just under 24 hours here, though some unfortunately people were much longer.</p>\n<p>If it's something that we take for granted, it's electricity. Thankfully our home is decently insulated, so the downstairs remained in the lower mid 70s temperature wise. The upstairs, not so much.</p>\n<p>We were gonna have the kids sleep downstairs the second night, but that was not necessary. The thought had occurred to get a couple of hotel rooms, but we didn't really want to spend the near $300 that would have ran us.</p>\n<p>It was certainly very nice when power was restored.</p>\n<h3 id=\"linkdump\">Linkdump <a class=\"direct-link\" href=\"#linkdump\">#</a></h3>\n<p><a href=\"https://irreal.org/blog/?p=12352\">Getting Disappeared</a><br>\nSome preaching to the choir about getting off of Google (et al) services. I'd love to do this myself as well, and have been looking at some alternative solutions.</p>\n<p><a href=\"https://sarah-savage.com/makefiles-make-life-easier/\">Makefiles make life easier</a><br>\nSarah Savage discusses how she utilizes the ever useful and humble makefile.</p>\n<p><a href=\"https://www.brycewray.com/posts/2023/03/time-move-on-nunjucks/\">Is it time to move on from Nunjucks?</a><br>\nNow that WebC is available, is it time to look towards something besides Nunjucks?</p>\n<p>That's all that I've got for now. Until next time.</p>\n<p>This is post 24/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-04T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/new-years-of-a-different-sort/",
      "url": "https://shanewrogers.lol/posts/new-years-of-a-different-sort/",
      "title": "New years of a different sort",
      "content_html": "<p>The new school season is nearly upon us once again.</p>\n<p>We will have three kiddos back in the same building, at least for a little while, with but two grades between them. Not that they don't always have, or that they won't always have two grades between them. Sometimes we forget that the youngest of these three is the <em>youngest</em> of the three - this kiddo has seemed for some time now to be the more mature of them all. Always a surprise to me and also I must admit that I am not overly certain that I am deserving of such amazing children.</p>\n<p>One of the twins will be spending the first part of some days at another school taking higher level math courses. Similar to what the youngest kiddo was going through last year, when he bussed from the elementary school to the middle school for his math course. I am more scared for the elder twin, though, than I was for the younger brother. Probably has to do with the fact he'll be going into a High School, opposed to a middle school.</p>\n<p>I think that everybody will do fine, but as a parent I think I'm allowed to feel that fear for my kiddo.</p>\n<p>We also find ourselves near the time of open enrollment for insurance.</p>\n<p>This year, I'm definitely looking forward to making some changes there. My wife has recently - this is her third week - started working at the same employer as I. Which means that we'll get to save a not insignificant amount of money on insurance! She will take over her own insurance plan and payment, using the same provider. I will continue to cover the kids and myself. All in, we look to save about $500 a month for coverage.</p>\n<p>It is insane.</p>\n<p>I have slowly been working my way through <a href=\"https://thebookofelsewhere.com/\">the book of elsewhere</a>, taking a bit of a break from The Expanse books. The hope is that I can finish reading this before my hardback copy of the BRZRKR graphic novel arrives, which should arrive early October I think. Plenty of time, right?</p>\n<p>This is post 23/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-29T15:00:10+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/some-recent-binges/",
      "url": "https://shanewrogers.lol/posts/some-recent-binges/",
      "title": "Some recent binges",
      "content_html": "<p>We've been watching a lot of streaming shows over the past couple of days.</p>\n<p>I didn't normally go in for the binge mentality of how things seem to be these days, although I haven't ever been against waiting things out for a few weeks to let the (old school) DVR (or, even older Tivo) build up a few weeks worth of episodes to watch.</p>\n<p>I still prefer to not watch them all at once.</p>\n<p>Still though, it does happen.</p>\n<p>Yesterday we watched the entirety of <a href=\"https://m.imdb.com/title/tt16283824/\">Eric</a> on Netflix. It was a pretty decent tale, with a handful of threads that wove together okay. I think that it could probably have been cut down by an hour/an episode, but all things considered it was enjoyable.</p>\n<p>Today we finished up with Netflix's <a href=\"https://m.imdb.com/title/tt14403178/\">Beef</a>. We had watched the first episode the other day, and worked out way through the rest of them today. I really like all of the A24 stuff that I've seen, and this was not too bad either. Granted, the overall story is just insane enough...but then so was Eric.</p>\n<p>So far as other television stuff, I've got my YouTube TV set to record <em>all the Olympics</em> stuff, so I'll watch some of that in time. I'm more of a Winter fan than Summer, though.</p>\n<p>Of course we're also watching <a href=\"https://m.imdb.com/title/tt11198330/\">House of the Dragon</a> and <a href=\"https://m.imdb.com/title/tt1190634/\">The Boys</a>, as one is aught to do.</p>\n<h3 id=\"link-dump\">Link Dump <a class=\"direct-link\" href=\"#link-dump\">#</a></h3>\n<p>I think I can come up with a small handful of links this week, so let us see what's out there.</p>\n<p><a href=\"https://kansasreflector.com/2024/07/28/spyware-turned-this-kansas-high-school-into-a-red-zone-of-dystopian-surveillance/\">Spyware turned this Kansas high school into a ‘red zone’ of dystopian surveillance</a> We had our own little run in with this particular piece of software last year as well, and I can't really honestly say that I'm a fan. I get it, but I don't care for it.</p>\n<p><a href=\"https://howardism.org/Technical/Emacs/literate-writ-large.html\">Literate Programming Writ Large</a><br>\nHoward Abrams is an excellent resource on literate programming in emacs and org mode, this article continues on with more great information along that line.</p>\n<p>....and that, as they say, is that.</p>\n<p>Until next time my friends.</p>\n<p>This is post 22/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-28T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/successful-updates-et-al/",
      "url": "https://shanewrogers.lol/posts/successful-updates-et-al/",
      "title": "Successful updates et al",
      "content_html": "<p>It's been a pretty successful day thus far.</p>\n<p>Upgraded one of our large test application servers with no issues. Insofar as application patches go, it's one of the easier ones that we've got. Not quite of the &quot;click, click, click&quot; and FIN variety, but very close. It does require a certain amount of babysitting, which is completely and totally obnoxious.</p>\n<p>I did get a start on reading my newest book, though I'm going to admit to not making it all that far yet.</p>\n<p><img src=\"https://cdn.some.pics/swrogers/66a14a69306c3.jpg\" alt=\"Photo of the book, &quot;the book of elsewhere&quot; by the authors Keanu Reeves and China Miéville. Next to the book is my blue coffee canister.\"></p>\n<p>On the personal way of life stuff (isn't that what this whole journal thing is, though?) I'm attempting to get my mindset back into the keto game. That doesn't mean that I haven't continued to remain in the keto lifestyle all this time - I have. What I've not done is be more strict/stringent on logging everything I consume, which leads to laziness and unnecessary snacking.</p>\n<p>My weight is slowly sneaking up past that 190 pound entry, way too close to 200 for my taste. Things are not helped along by the fact that we have too much prepackaged junk in the house, sugar free slash keto &quot;friendly&quot; or not. I shall be getting back on that wagon, full speed.</p>\n<p>This is post 21/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-24T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/problems-solved-and-trilogies-read/",
      "url": "https://shanewrogers.lol/posts/problems-solved-and-trilogies-read/",
      "title": "Problems solved and trilogies read",
      "content_html": "<p>It's been a couple of days since my last update, so obviously there must have been basically nothing going on at all.</p>\n<p>Some progress was made in the work/vendor department though, from Friday and on through the weekend. Mainly in that the patch scheduling foobar was taken care of.</p>\n<p>All that took was opening up to two technical support requests. Sigh.</p>\n<p>One of which was really only commented on by the vendor representative once. <strong>Once.</strong> I'm not gonna count the comment that was entered <em>after</em> the second SR was opened and resolved.</p>\n<p>Once that problem was taken care of, we were off to the races on, well, yet another problem. All of which is somewhat related to every tool being moved to someone else's comput....er...cloud.</p>\n<p>I will give them props, though, because at least this particular cloud took us replacing some old arse java app. So, progress. Yay?</p>\n<p>On the home front side, we've got some appointments tomorrow that will need to get taken care of.</p>\n<p>The lawn, yeah, it didn't get taken care of this weekend nor today. I'm hopeful that I can tackle that tomorrow as well.</p>\n<p>Otherwise my poor, poor battery powered mower will not make it.</p>\n<p>I'm also closing in on a third of the way through reading The Icewind Dale trilogy to my kiddos. Good stuff and it's my second time through this series.</p>\n<p>This is post 20/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-22T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/some-questionable-past-choices/",
      "url": "https://shanewrogers.lol/posts/some-questionable-past-choices/",
      "title": "Some Questionable Past Choices",
      "content_html": "<p>It's crazy the stuff that I have packaged up and toted along with me throughout all of my moves.</p>\n<p>What's even crazier are the items that I <em>didn't</em> bring along with me, for some reason or another.</p>\n<p>Items like video games. Lots of cartridges and disks, cases and manuals.</p>\n<p>Games that I wouldn't mind playing again on my SEGA Genesis/SEGA CD/32X (yeah, I had the SEGA Stack....) or Super NES.</p>\n<p>But.</p>\n<p>There's always a &quot;but&quot;, isn't there?</p>\n<p>Do I actually <em>have</em> any of those here with me? No, of course not.</p>\n<p>I do have my boxed Dreamcast and some high profile games, but not the older stuff.</p>\n<p>Sadly, I'll probably never see those things again, either. Last year I made the couple hour trek back to my childhood home, with the hope that I could bring some stuff back.</p>\n<p>My father (whom I love immensely) had moved an entire home full of <em>stuff</em> into a couple of self built storage buildings.</p>\n<p>I was heart broken. Having seen a couple of the figures that I still could find completely covered in dust and dirt and everything, and some electronics just in tatters...the weather had done them no favors.</p>\n<p>Of the items that I was hoping to find (including multiple unopened, complete on card figures) was a complete in box Neo Geo AES with two sticks, memory cards and six games (I think). I can recall Magician Lord, Baseball Stars, 2020 Baseball, Samurai Showdown, I can't recall the others. I'd purchased the whole package over 20 years ago on eBay for less than $600. Good luck trying to find anything similar these days for twice that. This gutted me.</p>\n<p>Completely.</p>\n<p>These days, as I attempt to go through a boatload of boxes, I just have to ask myself: Why would you bring bits and pieces of this stuff, and not the actual decks that make these things work?!</p>\n<p>Gah!</p>\n<p>This is post 19/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-18T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/vendors-gonna-vendor/",
      "url": "https://shanewrogers.lol/posts/vendors-gonna-vendor/",
      "title": "Vendors Gonna Vendor",
      "content_html": "<p>There are a handful of things that I don't understand.</p>\n<p>For one, why can't certain vendors let their customers know that the product that they depend on for their day to day usage was not actually patched to the current patch level on the scheduled time.</p>\n<p>Not only was the time scheduled, but it was of course scheduled by the vendor, seeing as how the customer is basically at the mercy of said vendor.</p>\n<p>Not only did the customer (us) have to check to ensure that the product was patched, but then the customer (us, again) has to contact <em>big vendor</em> support to ask why it wasn't patched.</p>\n<p>Why can't they just pop some kind of email notification that says it was either successful or not?</p>\n<p>Then if not - what the plan of action is?</p>\n<p>Yeah. We asked this question on Monday.</p>\n<p>I was out sick on Tuesday.</p>\n<p>The <strong>only</strong> response we've had thus far was an incorrect notice that none of our instances have been patched at all.</p>\n<p>We have three instances: one each for development, testing and production.</p>\n<p>Our development instance had already been patched, as scheduled, so I got to let the vendor know that...um, no, I don't believe that's correct please don't re-patch.</p>\n<p>Sigh.</p>\n<p>Anyhow - now the vendor has let us know that it's time to board the patching train because they've scheduled the production instance for updating next week, when we haven't had a chance to do <em>any</em> testing in the test instance. Which is less of a playground than dev.</p>\n<p>It's beyond infuriating.</p>\n<p>Welcome to the cloud.</p>\n<p>This is post 18/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-17T17:22:01+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/sunday-stuff-and-link-dumpage/",
      "url": "https://shanewrogers.lol/posts/sunday-stuff-and-link-dumpage/",
      "title": "Sunday stuff and link dumpage",
      "content_html": "<p>It's Sunday. Whatever that means.</p>\n<p>The end of the weekend and the beginning of a new week.</p>\n<p>Currently we're just taking in the time to watch the youngest play in a local indoor jungle gym. It's a friends birthday party for the little.</p>\n<p>So far as Sundays go, it's actually been a moderately busy one.</p>\n<p>The boys and I got haircuts. We went to the store.</p>\n<p>Spent some time at the local splash pad. Definitely a decent way for the little to cool off, but still.... really hot.</p>\n<p>Drove around town for a bit, mainly due to having forgotten when the party started. Ha.</p>\n<p>Now, it's all about figuring dinner out. Although I think we'll let the older kiddos fend for themselves with leftovers and pasta.</p>\n<h3 id=\"link-dump\">Link Dump <a class=\"direct-link\" href=\"#link-dump\">#</a></h3>\n<p>I've been a bit lapse on this listing, but then I'm just not too certain that what I've always got is worth it.</p>\n<p><a href=\"https://spectrum.ieee.org/shipt\">https://spectrum.ieee.org/shipt</a><br>\nShipt's pay algorithm screwing people over. The gig workers weren't gonna have it, so they took things into their own hands to crack open that black box.</p>\n<p><a href=\"https://www.axios.com/2024/07/08/johns-hopkins-bloomberg-donation\">https://www.axios.com/2024/07/08/johns-hopkins-bloomberg-donation</a><br>\nJohn's Hopkins medical school to be free for most students. This is just amazing. An excellent example of the good that can be done via philanthropy.</p>\n<p><a href=\"https://micro.webology.dev/2024/07/12/duckdb-may-be.html\">https://micro.webology.dev/2024/07/12/duckdb-may-be.html</a><br>\nJeff Triplett has a neat example using DuckDB to pull metadata from YouTube.</p>\n<p><a href=\"https://whynothugo.nl/journal/2024/06/13/ssh-as-a-sudo-replacement/\">https://whynothugo.nl/journal/2024/06/13/ssh-as-a-sudo-replacement/</a><br>\nSSH as a replacement for sudo. This is an interesting idea, certainly with a few hoops. I wonder about setting this up...?</p>\n<p><a href=\"https://help.vivaldi.com/desktop/tools/import-and-export-browser-data/\">https://help.vivaldi.com/desktop/tools/import-and-export-browser-data/</a><br>\nMainly for my future use, lots of imports and exports for Vivaldi.</p>\n<p>This is post 17/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-14T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/it-is-mesh-at-least/",
      "url": "https://shanewrogers.lol/posts/it-is-mesh-at-least/",
      "title": "It is mesh at least",
      "content_html": "<p>Sometimes I wonder how in the world I managed to write a new post every day during the previous challenge that I subjected myself to.</p>\n<p>This week has thus far been fairly non eventful. Boredom is a good thing sometimes.</p>\n<p>Last week I made a purchase that I almost regret doing. Even though it's an item that gets daily use, and I'm in it probably eight plus hours a day, which kind of makes it a necessity, I'm not a hundred percent happy with it.</p>\n<p>Obviously it's some kind of work from home item. It's the <a href=\"https://www.staples.com/union-scale-flexfit-hyken-ergonomic-mesh-swivel-task-chair-black-un59460/product_990119?cid=EM:ordconfrm::sku&amp;\">Hyken Mesh Chair</a> from Staples. The one thing that I'm not happy with is the &quot;headrest&quot;.</p>\n<p>Note the quotes there.</p>\n<p>As it's not super adjustable, this headrest comes all the way up to in between my shoulder blades.</p>\n<p>Unless I crouch down.</p>\n<p>Which I am not going to do.</p>\n<p>Fortunately I can remove it, which I'll probably do.</p>\n<p>Other than that, it's an okay chair for those who don't have or can't afford to get the kick arse Herman Miller Aeron. Sigh.</p>\n<p>Ah well, back to the grind!</p>\n<p>This is post 16/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-11T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/first-day-back/",
      "url": "https://shanewrogers.lol/posts/first-day-back/",
      "title": "First Day Back",
      "content_html": "<p>First day back is now in the bag!</p>\n<p>Not nearly as bad as those times when I take two weeks off (FSM knows that those both make me want to never take another vacation <strong>and</strong> never go back to work again) but there was still a bit of cleanup and catch up to do.</p>\n<p>Some of the cleanup involves coming back in to work post fiscal year end, when it's not necessarily been completely opened back up. Not a huge deal, but still needs to be taken care of.</p>\n<p>There is also the metric arse ton of email to sift through. Although I'll be honest and say that I do continue to keep my work email synching through my phone and delete most of the crap that doesn't pertain to me.</p>\n<p>Sue me. I don't like surprises.</p>\n<p>What was best today, though, was not one but <em>TWO</em> Monday morning meetings.</p>\n<p>Back to back.</p>\n<p>Right up there with Friday afternoon meetings with my favorites.</p>\n<p>Fortunately these are extremely rare for me and Mondays are generally pretty tame.</p>\n<p>Well, I'm thinking it's getting close to dinner time and I haven't yet figured out what to feed the kids - I probably ought to take that under consideration.</p>\n<p>Until next time.</p>\n<p>This is post 15/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-08T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/post-fourth-post-vacation/",
      "url": "https://shanewrogers.lol/posts/post-fourth-post-vacation/",
      "title": "Post-Fourth Post-Vacation",
      "content_html": "<p>Does Sunday count as a vacation day, ergo being the last day of a vacation?</p>\n<p>I can't say that I've ever actually counted the weekends in my vacation, but I suppose they do.</p>\n<p>Tomorrow is return to work day. We'll put &quot;return&quot; in quotes, seeing as I work from home and it's not like we actually left home over the last week.</p>\n<p>There were no plans set out for the week, so nothing was accomplished. But on the other hand, seeing as there were no plans to do anything I can't be disappointed that nothing got done!</p>\n<p>Win win for everybody on that one.</p>\n<p>The family did get out for the Fourth of July (non) event that was held in town. There was music (not that great), craft booths (not that great), food trucks (probably decent, but not our kind of nutrition), and a drone show.</p>\n<p>Oh, and a kids play area. Which was fun for the young one.</p>\n<p>We went for less than an hour and walked around to see what was what. Finding things not worth it, we left to go get the kids some ice cream cones.</p>\n<p>We did go back for the drone show, which was supposed to start at 9:45.</p>\n<p>Then it was supposed to start at 10:00. Then 10:30. 10:45. Then it was called at 11:00.</p>\n<p>At which time it started raining.</p>\n<p>Evidently, the vendor was having issues getting the show code loaded onto the 200 drones via their Verizon Wireless hotspot. They shoulda had T-Mobile. Ha.</p>\n<p>The weather had stunk all day, so they weren't able to do the pre-work earlier, either.</p>\n<p>Now, the city has a $30,000 credit for next year.</p>\n<p>We were really looking forward to seeing how it went, so I guess we'll check it out next year.</p>\n<p>This is post 14/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-07T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/fourth-of-july-post/",
      "url": "https://shanewrogers.lol/posts/fourth-of-july-post/",
      "title": "Fourth of July Post",
      "content_html": "<p>Happy Fourth of July, for those that celebrate.</p>\n<p>Yet another Holiday here in the States where we, basically, get to set our wallets on fire.</p>\n<p>Quite literally in some cases.</p>\n<p>I will admit that this is one of my favorite days of the year.</p>\n<p>It is currently just after 22:30 Central time, we just finished up with our small handful of fountains and sprinklers. The kids seemed to enjoy themselves, and yet another year with no need to send anybody to the emergency room is a win in my book.</p>\n<p>This was also one of the cheaper years that we've managed to get away with, with a bill only just shy of two hundred.</p>\n<p>Yeah, we totally didn't need to spend the money. But think of the kids! Especially the six year old who lives for the smoke bombs.</p>\n<p>Still more than I'd like to spend for an hours worth of entertainment.</p>\n<p>In other news, we will be back to a double income family soon. Super nice.</p>\n<p>Until next time!</p>\n<p>This is post 13/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-04T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/the-next-day/",
      "url": "https://shanewrogers.lol/posts/the-next-day/",
      "title": "The Next Day",
      "content_html": "<p>First day of vacation and I'm already sick and tired of it. <em>Note: it's now the second day, but my feelings haven't changed much here.</em></p>\n<p>Maybe one of these times I can actually plan to go somewhere or do something, get away from things.</p>\n<p>I just don't get it.</p>\n<p>These things should be enjoyable, right?</p>\n<p>Does it help that most of the people - it seems - in this home are depressed? I'm gonna go with a &quot;No sir, not one bit&quot; on that one my friends.</p>\n<p>We've got one adult who is dealing with a loss of something that never should have happened in the first place (something that never should have to to fruition to have <em>been lost</em>, that is). Another adult dealing with their own family issues, which are by their nature spilling over into the home life. Kids who we are trying to keep from becoming depressed.</p>\n<p>I'm walking on eggshells around here, and it's extremely tiring.</p>\n<p>This is post 12/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-02T14:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/time-aplenty/",
      "url": "https://shanewrogers.lol/posts/time-aplenty/",
      "title": "Time aplenty",
      "content_html": "<p>What a week!</p>\n<p>Last week was quite a ride. The weekend hasn't been much different.</p>\n<p>I look through a few job listings, not only for my spouse but - potentially - for myself as well.</p>\n<p>Again, not that I'm looking to replace my current job, but perhaps more to supplement what I do have.</p>\n<p>As far as the spouse goes, well, sometimes I feel like I'm kind of limited. She is great with children and youths, not so much with peers.</p>\n<p>It's her perfectionism and drive to do things by the book. Which, in and of itself is not so much a bad thing.</p>\n<p>However, when you are around a new group of coworkers who have been doing things the same way for <em>years</em>, well, then that can be a little dicey.</p>\n<p>It's not always good to be that squeaky wheel. It gets greased, or it gets replaced.</p>\n<p>Not to mention the fact that fitting I to a new clique can be extraordinarily difficult.</p>\n<p>Another thing that makes things challenging is that I'm not the most patient teacher, I think. Especially when it comes to how basic computer applications work. I do understand that I should do better here, do more teaching rather than taking over and doing.</p>\n<p>There are a lot of jobs out there these days that require basic skills - not to mention even getting an application submitted. I get frustrated far too easily, sometimes.</p>\n<p>No matter what she does, though, I completely will be here to support.</p>\n<p>All things said, even hobbies can make some extra money. There have been plenty of ideas in this home, plenty of supplies have been purchased, now there is also an abundance of time.</p>\n<p>This is post 11/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-30T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/change-and-stock-in-trade/",
      "url": "https://shanewrogers.lol/posts/change-and-stock-in-trade/",
      "title": "Change and stock in trade",
      "content_html": "<p>I had something written up earlier that I was going to post, but as is often the case in life things change.</p>\n<p>Is it always for the best?</p>\n<p>I find that I am, for the first time in a very long time, contemplating the need to do one of two things: either procure a second income, or find another income.</p>\n<p>Neither of which is something that I desire to any degree.</p>\n<p>I like what I do and I like where I am.</p>\n<p>However. Something something life.</p>\n<p>Whatever.</p>\n<p>I guess it's time to take stock of what my abilities are and what I'm capable of.</p>\n<p>What a week.</p>\n<p>This is post 10/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-28T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/tighten-that-silver-lining/",
      "url": "https://shanewrogers.lol/posts/tighten-that-silver-lining/",
      "title": "Tighten that silver lining",
      "content_html": "<p>Now is the time to tighten the proverbial belts.</p>\n<p>We will very soon be down to a single income in the home. More or less. I do suppose that the older kiddo does have a paycheck, but he has his own set of problems to take care of.</p>\n<p>One really has to hope that this situation does not last longer than it needs to, and, perhaps, it can be used to open some doors for another opportunity.</p>\n<p>Like now there should be plenty of people hours available to work on getting the home straight for that in-home childcare plan that was mentioned previously.</p>\n<p>Is there a silver lining?</p>\n<p>This is post 9/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-26T18:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/non-events/",
      "url": "https://shanewrogers.lol/posts/non-events/",
      "title": "Non Events",
      "content_html": "<p>It has been a couple of uneventful days, which if I'm being honest is not such a bad thing.</p>\n<p>Work has been moving along at a nice steady pace, with some progress being made on the good old Team Dynamix front.</p>\n<p>On that, I shall say that my enthusiasm has been ever so tempered at this point. There does not seem to be a path forward for our department to be able to have the type of control that we would like, nor some of the project management features that some would hope for.</p>\n<p>We shall, however, make due.</p>\n<p>Next week will be an off week for me. Yet another week of vacation.</p>\n<p>Most people would be super stoked and excited about that, I'm sure, but if you're a reader of my past posts you might know that I'm not a fan.</p>\n<p>However, my wife also has next week off - so maybe we can get out and hit a local park or something with the kids. Take advantage of those uber expensive passes we have.</p>\n<p>What we really should do, though, is work on getting our extra bedroom set back up for the eldest kiddo. Along with the rest of the home. We are considering getting licensed by the State for an in-home childcare center. To do that will require a little bit of setup but totally worth it.</p>\n<p>Of course, I know for a fact what we'll <em>actually</em> do next week. Absolutely nothing. Apart from doing stuff with the kids for the Fourth of July.</p>\n<p>Here's to a good rest of the week.</p>\n<p>This is post 8/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-25T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/single-party/",
      "url": "https://shanewrogers.lol/posts/single-party/",
      "title": "Single Party",
      "content_html": "<p>When I was in middle school, in what now seems like half a million years ago, a friend and I started writing stories.</p>\n<p>We each had a single subject notebook and filled them with what were - to us anyhow, at the time - fantastically interesting tales.</p>\n<p>I can't recall what stories my friend had written about (and, sadly, cancer has taken him) but mine was some kind of   space opera mash up with robots and power suits and who knows what all else.</p>\n<p>I'm sure that it was all horribly juvenile, but it felt really grandiose to me at the time.</p>\n<p>My Mom even read what I had one at one point and did say that it was pretty good. Of course, as a parent you are a little biased.</p>\n<p>She was - is? - well read, however, and did encourage me to read a large variety of works. I still have that love of reading.</p>\n<p>There are far too many conversations going on in this house, I can not recall where I was going with any of these thoughts.</p>\n<p>Oh, yes. Writing. Write anything. I've seen a lot of posts from people recently who struggled to start writing, who thought that people would not want to read what they had to say.</p>\n<p>Does any of that matter? No.</p>\n<p>When writing for yourself, it matters not what your getting down. It doesn't matter if you think it's &quot;juvenile&quot; or otherwise uninteresting - you are writing for yourself.</p>\n<p>It matters not if my readership is a party of one.</p>\n<h3 id=\"the-link-dump\">The Link Dump <a class=\"direct-link\" href=\"#the-link-dump\">#</a></h3>\n<p>Now for the Sunday link dump.</p>\n<ul>\n<li><a href=\"https://wand3r.net/adding-a-reply-on-mastodon-to-each-post/\">Add a Reply on Mastodon Link</a> Brandon has a pretty good idea using a new feature of omg.lol's version perma-urls and redirects that I might see about adopting here.</li>\n<li><a href=\"https://michal.sapka.me/blog/2024/leaving-firefix-behind/\">Michal is looking for a new browser</a> what with all the ad (and ai, and -nauseam) nonsense that's going around these days, is there any wonder that people are looking to move on from the behemoths? I've tried nyxt, it's interesting and different, but I'm thinking I might move to Librewolf.</li>\n</ul>\n<p>I guess I didn't have much linkage for this week. I've just not been spending much time going down the rabbit holes lately.</p>\n<p>Until next time.</p>\n<p>This is post 7/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-23T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/some-works-of-art/",
      "url": "https://shanewrogers.lol/posts/some-works-of-art/",
      "title": "Some works of art",
      "content_html": "<p>I figured that today would be a good time to post something a little more lighthearted.</p>\n<p>So I present some of the artwork of my youngest kiddo, which is basically overtaking all of the free space of the fridge.</p>\n<p>Not that there is a problem with that, of course.</p>\n<p><img src=\"https://cdn.some.pics/swrogers/66764667ab663.jpg\" alt=\"Photo of children's artwork taking over a refrigerator\"></p>\n<p>This is post 6/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-21T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/food-and-weight-again/",
      "url": "https://shanewrogers.lol/posts/food-and-weight-again/",
      "title": "Food and Weight Again",
      "content_html": "<p>I know that I have previously written on my struggle to work on maintaining my weight, as well as some of the body and confidence issues that go along with that.</p>\n<p>We shall count today's journal entry as yet another one of those.</p>\n<p>Within the next two months, August 8th I believe, will the the fifth year milestone of living a keto lifestyle.</p>\n<p>Before that, I remember sitting in my office chair and watching these amazing transformation videos of people. It always felt a little hypocritical of myself when I did this. There I sat, three hundred thirty plus pounds, knowing that I would never be able to be one of those with a success story of my own.</p>\n<p>Within weeks of starting keto, I knew that I wanted nothing more than to just be down a hundred pounds after one year.</p>\n<p>Well, I like to say that I basically turned that whole change into a game: how large of a calorie restriction could I maintain, how close to zero net carbs could I average?</p>\n<p>I blew way past that hundred pounds loss within that year and was already very close to my current weight already.</p>\n<p>My lowest weight was in the 168 pound ballpark. I'm a six foot two plus guy, and I know for a fact that that was too low. I did not look good.</p>\n<p>I have slowly worked back up to low 190s. Insofar as health goes, I know that's perfectly acceptable.</p>\n<p>But. Mentally, it is not good enough for me. I want 180s. For my mind, where I'm at is just too close to 200. I don't want to be there again.</p>\n<p>So, I know that I dropped the weight (I don't like to say I <em>lost</em> it, because I really don't want to <em>find</em> it again) really quickly. Probably not super healthily either. However, I have managed in many ways to change my relationship with food.</p>\n<p>I never really ate my feelings. It was more out of boredom than anything. Now, I really try to enjoy the feeling of looking better and use the extra time to read or work on some other self development process.</p>\n<p>If I have missed anything at all during this life change, it's that my hair is no longer thick and composed of ringlets (think Weird Al hair). That's about the only thing I miss. But, it could be age related as well.</p>\n<p>Today has been a good day, thus far, when it comes to food. Here's to keeping on.</p>\n<p>This is post 5/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-20T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/power-or-lack-thereof/",
      "url": "https://shanewrogers.lol/posts/power-or-lack-thereof/",
      "title": "Power Or Lack Thereof",
      "content_html": "<p>What to say about today?</p>\n<p>Today is Juneteenth. This would be the first year that my place of employment has (I think...) provided those of us who are able to have the Holiday off, off. There are those who are declared as essential, so I would assume that they could have their Holiday moved, or just make the extra pay. I don't honestly know how that will work for this case.</p>\n<p>Me, being a white, caucasian, cis dude who is near half a century old at this point in his life...I can not help but just feel really kind of weird having this day off as a Holiday. Now, I absolutely do believe that it should be a Holiday, no doubt about that.</p>\n<p>It just feels strange for me, personally, to have the day out.</p>\n<p>Okay, that's about as political as I ever want to get.</p>\n<p>In other moments of not so much excitement, the power was off for an hour or so here.</p>\n<p>No idea what happened, but it did provide a moment to ponder and read a part of my newest book:</p>\n<p><img src=\"https://cdn.some.pics/swrogers/6671c7a543862.jpg\" alt=\"Photo of book &quot;Jonathan Strange and Mr. Norrell&quot; by Susanna Clark. First Edition, First printing, US Edition, Black Cover.\"></p>\n<p>I remember watching the series of this when it aired a few years ago and thought that it might make a good read.</p>\n<p>I was grateful to have found a good hardback copy of the first printing/first US edition for a really good price.</p>\n<p>Here's to eventually getting it finished!</p>\n<p>This is post 4/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-19T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/not-from-the-peanut-gallery/",
      "url": "https://shanewrogers.lol/posts/not-from-the-peanut-gallery/",
      "title": "Not From the Peanut Gallery",
      "content_html": "<p>I am notoriously difficult to purchase any kind of gift for.</p>\n<p>Anything that I generally want, I have a tendency to go ahead and make the purchase at any and every time.</p>\n<p>Anything that I <em>don't</em> immediately buy, is most likely because the item just cost too much and I can not justify the purchase.</p>\n<p>I do have a few things that I enjoy though, and high on that list is anything and everything Peanuts.</p>\n<p>Of the <a href=\"https://en.m.wikipedia.org/wiki/Charles_M._Schulz\">Charles Schulz</a> variety, of course. Charlie Brown, Snoopy, Woodstock, all of them! I've been enamored of the crew since I was a child.</p>\n<p>Some of my earliest memories of reading, not just making things up and babbling and looking at pictures, is of laying on the living room floor, the Sunday Comics spread open in front of me, reading and laughing at Peanuts.</p>\n<p>I remember Dad asking me if I was actually reading, then him being surprised when I said yep!</p>\n<p>All of that to say that my wife is pretty awesome! She always knows what to get me.</p>\n<p><img src=\"https://cdn.some.pics/swrogers/6671b4a30cb0e.jpg\" alt=\"A Charlie Brown Squish Mellow. \"></p>\n<p>The best squishmellow of all time!</p>\n<p>This is post 3/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-18T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/the-banana-thing/",
      "url": "https://shanewrogers.lol/posts/the-banana-thing/",
      "title": "The banana thing",
      "content_html": "<p>Last night my head was killing me.</p>\n<p>This morning my head was still killing me. I have to say that I consider myself extremely fortunate to have a very flexible career that affords me the ability to take time when I need it. It is not something that need be done very often - not for myself anyhow - but I'm more than happy to take it.</p>\n<p>Currently, I'm sitting in the quiet of the dinning area, watching one of the kiddos make some kind of banana <em>slash</em> chocolate <em>slash</em> puff pastry dessert that he and Mom had seen online somewhere. It looks interesting, and I'm sure it'll be tasty for them.</p>\n<p>Did I mention that this kiddo is only just out of fifth grade? He's been baking and cooking for what seems like a couple of years now. The kiddo is very driven and fairly well rounded.</p>\n<p>Normally, anyhow. Sometimes these kids will surprise with some of those &quot;You asked what?!&quot; questions. They are all super intelligent, have gifted IEPs in school, but still - on occasion - they show their age and remind us that they are still children, and need guidance to make their way.</p>\n<p>And that is perfectly fine. It's what we are here for.</p>\n<p>This is post 2/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-17T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/happy-fathers-day/",
      "url": "https://shanewrogers.lol/posts/happy-fathers-day/",
      "title": "Happy Fathers Day",
      "content_html": "<p>As today prepares to come to an end, I'm sitting here at home waiting on the ibuprofen and acetaminophen cocktail to do its thing.</p>\n<p>We did make it to Worlds Of Fun, as a way to have a fun Father's Day. It was a pretty good day. There were a couple of us that managed to get in a few good coaster rides, facilitated by some decently short lines.</p>\n<p>I had never ridden the Prowler before today - definitely one of my new faves. It's an older wooden coaster, I think it's celebrating a birthday this year as well. I'm kind of surprised that I had never been on it previously, but sure glad that I did.</p>\n<p>Now I've just got to get over the heat and sun induced ache that I've put myself through.</p>\n<h3 id=\"the-sunday-linkdump\">The Sunday Linkdump <a class=\"direct-link\" href=\"#the-sunday-linkdump\">#</a></h3>\n<p>I don't really have a whole lot this week, as I've just not really had the time to go down too many rabbit holes this week.</p>\n<p><a href=\"https://www.tiltedwindmillpress.com/product/ryoms-preorder/\">Michael W Lucas' Run Your Own Mail server preorder</a> I've previously run my own mail server, sort of successfully, but not from scratch. This book is on my radar.</p>\n<p><a href=\"http://www.phrack.org/index.html\">Phrack Magazine</a> Somebody had brought up 2600 magazine awhile ago, and this is another (non printed) magazine that's dedicated to the scene. I've read 2600 for decades, and also enjoy reading this one when it's available.</p>\n<p>Like I say, not a lot this week.</p>\n<h3 id=\"end-stuff\">End stuff <a class=\"direct-link\" href=\"#end-stuff\">#</a></h3>\n<p>I'm going to consider this my first entry into the <a href=\"https://100daystooffload.com/\">#100DaysToOffload</a> challenge for the next 365 days. I don't have any special pages set up for these, besides using the hashtag.</p>\n<p>This is post 1/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-16T21:05:11+00:00"
    }
  ]
}
