{
  "version": "https://jsonfeed.org/version/1",
  "title": "My Corner of the Internet feed for c25k",
  "home_page_url": "https://shanewrogers.lol/",
  "feed_url": "https://shanewrogers.lol/feed/feed.json",
  "description": "Just a place for me to share some stuff.",
  "author": {
    "name": "Shane Rogers",
    "url": ""
  },
  "items": [{
      "id": "https://shanewrogers.lol/posts/my-couch-to-5k-start/",
      "url": "https://shanewrogers.lol/posts/my-couch-to-5k-start/",
      "title": "My couch to 5k start",
      "content_html": "<p>Yesterday I started my first session of the <em>Couch to 5K</em> program.</p>\n<p>I'm not going to say that it was completely brutal, but it was definitely a challenge for myself.</p>\n<p>I've never been a runner. Nor a jogger. Heck I haven't even been much of a walker with the exception of the last year, maybe.</p>\n<p>But for some reason, I've got this crazy idea that I would like to run a 5K.</p>\n<p>Slowly but surely I have been trying to work my body to to being prepped, in some way, for the coming activity. By walking and trying to keep a brisk pace, by going longer and longer distances.</p>\n<p>At this point, I can do right at a three mile walk in about 40 to 45 minutes. My average is just over a 13 minute mile.</p>\n<p>Certainly not an Olympic caliber, but I'm okay with that.</p>\n<p>Yesterday, using one of the many <em>C25k</em> apps out there, was my first stress test. I would say that I succeeded.</p>\n<p>Sure, it was not easy, and yeah I was looking forward to that &quot;You are on run 8 of 8&quot; notification, but I survived.</p>\n<p>I did the complete 3K (I think) trek in 30 minutes, finishing very close to the end of our trail at the conclusion of the program.</p>\n<p>Of course, silly me still wanted to finalize my <em>actual</em> normal walk path, so I continued on for another less than mile.</p>\n<p>That, I admit and know now, was a mistake. According to my Fitbit app, the first two miles were under 13 minutes each.</p>\n<p>The last was at an over 17 minutes pace. Yeah, no good, and I felt it!</p>\n<p>I'm looking forward to doing this again today!</p>\n<p>This is post 42/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-09-27T14:05:11+00:00"
    }
  ]
}
