{
  "version": "https://jsonfeed.org/version/1",
  "title": "My Corner of the Internet",
  "home_page_url": "https://shanewrogers.lol/",
  "feed_url": "https://shanewrogers.lol/feed/feed.json",
  "description": "Just a place for me to share some stuff.",
  "author": {
    "name": "Shane Rogers",
    "url": ""
  },
  "items": [{
      "id": "https://shanewrogers.lol/posts/uncertain-refrigerator/",
      "url": "https://shanewrogers.lol/posts/uncertain-refrigerator/",
      "title": "Uncertain refrigerator",
      "content_html": "<p>If it isn't one thing it's about seventy three others with our luck.</p>\n<p>When we moved into our home over nine years ago we had to pick up a few appliances. A refrigerator, washer and dryer, we also procured a stand up freezer for the garage.</p>\n<p>The house came with dishwasher, range and microwave.</p>\n<p>After tomorrow, only two (!) of those items will remain as original.</p>\n<p>The warranty on our fridge, an LG, ran out after 5 years had passed. We just <em>barely</em> squeaked in a warranty covered repair to the compressor on it, mere months before the expiration.</p>\n<p>The washer and dryer unit that we originally bought, well, that I originally picked out because of cost (either Maytag or Whirlpool, I don't recall at this point) have been replaced. Twice. (The original units, believe it or not, <em>did not have a clean out for the washer</em>....so eventually when all the kids socks get sucked in, you can't easily access them to clear them out.)</p>\n<p>Two Novembers ago, maybe three, the range died. It's been replaced.</p>\n<p>Now... After sitting with an error code that has not allowed the external panel to work for a couple years, nor the external water and ice maker (yeah, horrible, sigh...it's tough to find them without ice) to work, the fridge has finally decided that it's the end of days.</p>\n<p>It gets replaced tomorrow.</p>\n<p>This stuff is nearly impossible to work on. It's just not the same kind of items that even our parents bought.</p>\n<p>Gone are the times when you grew up with the same, oh say....refrigerator...in the home throughout your childhood and young adult years.</p>\n<p>Sigh.</p>\n<p>Naturally, the assigned delivery window for tomorrow's unit is right smack dab around school pick up time for the kids.</p>\n<p>Because, why wouldn't it be.</p>\n<p>This is post 64/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2025-01-09T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/not-the-good-kind-of-blizzard/",
      "url": "https://shanewrogers.lol/posts/not-the-good-kind-of-blizzard/",
      "title": "Not the good kind of blizzard",
      "content_html": "<p>Well we are evidently in an actua <em>Blizzard Warning</em> now.</p>\n<p><img src=\"/img/Attachment-2025-01-05.png\" alt=\"Attachment-2025-01-05\"></p>\n<p>Yippee!</p>\n<p>I attempted earlier this evening, just after dinner, to go out and grab some stuff from the store. Milk and whatever.</p>\n<p>I had, earlier this afternoon, salted the walk and driveway. I guess I should have salted just a bit more in some areas, since I took a decent header going to the car.</p>\n<p>Made it about half a block down, slip sliding all the while, until I decided that nobody needed milk that badly. Backed up and headed back home.</p>\n<p>Gone maybe 5 minutes, including scraping ice off the windows.</p>\n<p>Now, I've got a ginormous welt on the side of my left leg.</p>\n<p>It's sore, but livable. Certainly huge though.</p>\n<p>Woot.</p>\n<p>This is post 63/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2025-01-04T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/another-year-already/",
      "url": "https://shanewrogers.lol/posts/another-year-already/",
      "title": "Another year already",
      "content_html": "<p>Has it really been a year?</p>\n<p>Another one??</p>\n<p>Already?!</p>\n<p>As one gets older, it just relentlessly accelerates towards whatever the endgame is in all of this.</p>\n<p>The next thing we know, we shall have four more birthdays in the house - one in February, three in March.</p>\n<p>Then it's time for end of school.</p>\n<p>Next it's school starting back up.</p>\n<p>Then Holiday season starts all over again.</p>\n<p>Somewhere in there, we'll have to mow the lawn perhaps.</p>\n<p>I'll be one year closer to half a century old. Definitely something that I never, ever would have considered anything of import during my youth.</p>\n<p>You know, I've never really been one for resolutions. New Year's or otherwise.</p>\n<p>They seem silly. It is the extraordinarily rare person that is able to - essentially - flip and inner switch and say &quot;I'm gonna do X&quot; from this day onward.</p>\n<p>Sure, goals are great. Targets and milestones are great. But they're difficult to come up with something that's achievable. I certainly don't want to feel like I've failed at something within the first week.</p>\n<p>Maybe that's why it took me so long to get my rear in gear on a healthier lifestyle. Keto was a thing that I feared for a decade or more. Not just the cost (which is debatable at this point) but the fear of failure looking wide over me.</p>\n<p>Now, are there things that I would like to accomplish within the next year?</p>\n<p>Absolutely.</p>\n<p>I would like to finish reading <em>The Expanse</em> series. I'm on <em>Babylon's Ashes</em> currently.</p>\n<p>I would like to get some debt paid down. That's actually plausible this year, with the wife having her own insurance this year (same everything, so no real change apart from new cards on her side). That's over $500 a month in our pocket right there.</p>\n<p>I want to start a vegetable garden out back, using the straw bale method.</p>\n<p>I'd love to get some permanent LED holiday lights set up on the house.</p>\n<p>Getting the garage organized. Getting our bedroom organized.</p>\n<p>Some of these things are certainly more doable than the others.</p>\n<p>Ah well.</p>\n<p>On a closing note, I started a <a href=\"https://hardcover.app/@swrogers\">Hardcover account</a>. I kinda like it, but I do think I prefer the way books can be added over on OpenReads with taking pics of the barcodes. I may use both for a bit before deciding to stop using either of them, because, honesty. While I need to keep track of what books I've got and read, I don't know that I can actually do that.</p>\n<p>Maybe I should add that to my New Year's Resolutions.</p>\n<p>This is post 62/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-12-31T13:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/one-holiday-down/",
      "url": "https://shanewrogers.lol/posts/one-holiday-down/",
      "title": "One holiday down",
      "content_html": "<p>We have survived another Christmas Holiday season.</p>\n<p>We have spent far to much money.</p>\n<p>But - at least - we haven't overdone things.</p>\n<p>I would like to think that everyone in the home received at least one item that they wanted or like.</p>\n<p>We did, somehow, some way, manage to get through the event without picking anything up that requires batteries to operate.</p>\n<p>I don't know how we managed that one, it was definitely accidental.</p>\n<p>Christmas Eve we took the family on a small tour through town to see some of the neighborhoods lit up, including a handful of homes that do the whole animation alongside mini radio transmitters.</p>\n<p>It's something that I would like to do one of these years. I want to do the permanent LED light installation here.</p>\n<p>We did find one very cool section of town where there were blocks and blocks of people who had strung lights all throughout their trees from home to home, it looked very cool and almost web-like. Very much not something I'd expected to find but I was so glad that we had!</p>\n<p>Our newest family member, the Sheepadoodle, has been doing really well. She's not super comfortable with strangers or non family members, apart from the door knocking, doors opening or closing, or certain family members coming down the stairs, it's about the only time she'll get vocal.</p>\n<p>Still need to find and get her into a vet though.</p>\n<p>Now just to get through New Year's.</p>\n<p>This is post 61/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-12-27T15:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/time-off-for-maintenance/",
      "url": "https://shanewrogers.lol/posts/time-off-for-maintenance/",
      "title": "Time off for maintenance",
      "content_html": "<p>Tis the season, I suppose.</p>\n<p>For some car maintenance and time off, that is. Ha!</p>\n<p>Oh, and Christmas and New Year's and all that jazzy stuff.</p>\n<p>Yesterday was my last day of, um, &quot;work&quot; for the year. There was much really to do except help with a couple of requests, which was totally cool. Had a handful of things that needed wrapped up and it was actually kinda nice to be able to do so.</p>\n<p>This morning was up at the standard time - sleeping in?! What the hell is that?? Had to get the car into the shop for some juuuuust barely overdue service (maybe a hundred miles?). Not too bad.</p>\n<p>At least the dealership doesn't try too hard to oversell crap.</p>\n<p>That done, it was time to go home. Open door, hear the kids argue.</p>\n<p>Sigh.</p>\n<p>Dammit.</p>\n<p>Sometimes I just wish they could solve their own problems. I basically just ignored them this time. Ha.</p>\n<p>In some absolutely non related tangents, I've really been trying to come up with a new from scratch emacs config.</p>\n<p>Don't ask me why, I don't have any answers at all.</p>\n<p>None. Zero. Zilch. Zip. Nada.</p>\n<p>I've managed to stick with Doom Emacs for quite some time now and I just keep going back to that. I like it, sure.</p>\n<p>There is just part of me that, I don't know, wants to grok the whole dang thing. For some reason.</p>\n<p>The problem is, I either keep trying to basically recreate Doom, or I'm just not really certain what packages I want to start with.</p>\n<p>I've got all of what is consider the &quot;new standards&quot; covered: vertigo, marginalia, orderless, whatever else goes into that stack.</p>\n<p>Then I'm like a stinking dog that chases squirrels all over the woods. It gets exhausting.</p>\n<p>Plus, I'm trying to get org more incorporated into my desk life - so there's that. I'd say &quot;life&quot;, but there aren't a whole lot of decent and mature org related apps on Android. Tmux and emacs running within on my phone don't count, in my mind.</p>\n<p>I do have Zettel (using it now!), Orgzly Revived and OrgNotes...but....eeh. I want better templates and capture/sharing.</p>\n<p>Anyhow.</p>\n<p>Take care, you all.</p>\n<p>This is post 60/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-12-20T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/a-day-of-firsts/",
      "url": "https://shanewrogers.lol/posts/a-day-of-firsts/",
      "title": "A day of firsts",
      "content_html": "<p>A Saturday down, a kiddo and his first chess tournament.</p>\n<p>A very successful day, all in all.</p>\n<p>Today was not all roses and daffodils, however. Yesterday afternoon I pulled a real doozy move and somehow managed to close my right thumb in the driver's side door of my car. How in the nine hells I managed to do that I have absolutely no flipping clue, I wasn't thinking at all and just managed to ever so slowly and methodically gently close my thumb in the door.</p>\n<p>It smarted, quite a bit. My dog was in the car, my youngest was in the car. I let out quite the yelp.</p>\n<p>After attempting to yank my thumb free I realized that wasn't gonna work, so I'm glad I was able to relax and actually open the door.</p>\n<p>It still hurts. From the tip of the digit to the middle of the palm. I'll be shocked if I don't lose the nail.</p>\n<p>Anyhow, back to today.</p>\n<p>Up good and early for a Saturday at 0700. I'd been up since 0600 with the thumb throbbing in pain anyhow. Shower. Coffee made. Dog taken out and fed. Snacks and easy provisions gathered and our the door.</p>\n<p>We got little man registered and set up around 0845. Then 6 rounds of chess. He had on win and two draws, for two points. We call that a successful first event for the first grader!</p>\n<p>His team tied for third, but got fourth due to the point tiebreaker. Still not too shabby.</p>\n<p>Done a little before 1700, then off to the DQ for a Blizzard and O-rings! He'd never had DQ before.</p>\n<p>It was also my first chess tournament, quite the experience.</p>\n<p>All told, not a bad day.</p>\n<p>This is post 59/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-12-15T03:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/than-google-for-saving-money/",
      "url": "https://shanewrogers.lol/posts/than-google-for-saving-money/",
      "title": "Than Google for saving money",
      "content_html": "<p>I did a thing last night that I never thought I'd ever do.</p>\n<p>For the first time in longer than I can remember, I now reside in a home that does not subscribe to some kind of non-ota television service.</p>\n<p>I've been subscribed, well <em>been</em> subscribed, to YouTube TV since almost day one. Sucked into the whole Google everything and the kick butt &quot;DVR&quot; that came along in tow.</p>\n<p>I even talked multiple people into signing up, it really was a great value.</p>\n<p>Yeah. At $73 a month it was time to rethink the subscription. The only thing I was really using it for at the time was to put PBS on, or maybe the occasional Daily Show.</p>\n<p>I had been considering saving the monthly cost, but just hadn't pulled the trigger on the cut. But, at $83 a month I'm out. Not that anyone really cares, but yeah.</p>\n<p>I swapped over my MAX add-on to Prime. Went ahead and decided that I might as well throw three more bucks Jeff's way and go AD free on Prime as well. I imagine I'll also toss some cash into the coffers of my local KPR station since I listen to them quite a lot.</p>\n<p>So far as PBS goes, I've been a supporter of the Kansas City station for some time, so I've got their passport into the app for viewing their content.</p>\n<p>My only complaint: We've got an LG TV, and while I love WebOS they don't have a PBS Passport application. I'll have to either dig my Chromecast back out, vor maybe look into another option.</p>\n<p>It'll be nice to save a bit more cash this year! Thank you, Google!!</p>\n<p>This is post 58/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-12-13T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/survived-the-weekend/",
      "url": "https://shanewrogers.lol/posts/survived-the-weekend/",
      "title": "Survived the weekend",
      "content_html": "<p>Well, we have survived the weekend that I had been dreading!</p>\n<p>I would even consider the past weekend to have been something of a success.</p>\n<p>A few months ago, both of the twins auditioned and were accepted into the regional Honor's Choir. Super awesome for them! The older twin had performed last year, the younger did not get the opportunity. Both were accepted this year as bass singers. The older has an exceptionally low singing voice for his age group.</p>\n<p>Also, a few months ago, the older twin also tried out and was accepted into the regional Honor's Band for Horn. He is an excellent instrumentalist, and could be even better if he were able to get more hours in to practice (but he has something of a full schedule). While I don't know if the chairs were ranked in the concert seating, his name was listed third in the Horn section for his group - and they weren't alphebetical. We're kind of proud of him, so this was pretty awesome.</p>\n<p>About a month ago, probably a bit over, looking at some of the emailed details I notice that these two events are on the same day. Okay, cool.</p>\n<p>Looking closer, they are at different locations. Okay, not quite as cool.</p>\n<p>I had already been in talks with at least the choir teacher at thier school, and did know that the students would not be able to perform in both. So, definitely not as cool.</p>\n<p>Naturally, the band kiddo wanted to perform in the band concert - since he'd already had the choir experience. I fully understood, respected and supported that choice. Cool.</p>\n<p>The next logistical challenge would be figuring out whether or not we'd be able to make it from one location to the other, about 10 miles give or take - 20 minutes or so - within the timeframe of say 15 minutes. That includes gathering two other kiddos, getting back to the parking location, grabbing the older twin and his instrument and stuff, driving into the city, finding a parking location after everybody was already there, walking all the way back across the second location and finding a place to sit. No fun.</p>\n<p>We did it though! Only missed perhaps the first song and the introduction. I'm kind of amazed and proud that we were able to make it through.</p>\n<p>The twins did amazing. Both of them were up around 05:00, 05:30 or so. One had to be on a bus by 06:30 the other - at another location of course - by 06:50. It was a long day.</p>\n<p>Worth it, though.</p>\n<p>This is post 57/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-12-09T18:43:34+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/the-day-unplanned/",
      "url": "https://shanewrogers.lol/posts/the-day-unplanned/",
      "title": "The day unplanned",
      "content_html": "<p>Well, today certainly did not go anywhere near how I had planned it to go.</p>\n<p>Though there is a proverbial silver lining, I hope, since something that I'm hoping was the problem has been solved.</p>\n<p>You'll see.</p>\n<p>Went to the store yesterday, only picked up one gallon of milk. Now, normally this wouldn't be a huge issue, but this family of mine can easily go through a gallon of milk with no problem. Should have bought two.</p>\n<p>I'd also intended, or had expressed that I'd damn near come close, to picking up another bookcase for the bedroom. To store books on. And other crap that I have piled around the room.</p>\n<p>So, plans were then laid out that I would go back to the store today, get those items and a few other incidentals that are darn near always needed: eggs, cheese, what have you.</p>\n<p>I drop a couple of the boys off with their friends and head to the store around noon. Do my shopping, pay, load up the car.</p>\n<p>Get into the car, press the starter...</p>\n<p>And....it throws an error that it has been throwing either earlier this year or last year. Coincidentally sometime around the point when the dealership updated the software to automatically engage the parking break.</p>\n<p>It hadn't done this in quite some time, it did eventually stop and didn't repeat. Online searches suggested that the errors were due to the battery needing changed. Which I could totally understand, but the battery was checked and had decent life still left.</p>\n<p>But, this time it also nearly stranded my wife in KC, and then me on the other side of town. It also definitely sounded like the battery wasn't providing the power to do what needed to be done.</p>\n<p>It was, eventually, able to start. Left it running for some time while we tracked a battery down then went to grab it. Had to bring it back home to get it installed, with help from my wonderful wife - I was unable to get the connection to the positive terminal to lift off. She was able to work the magic.</p>\n<p>New battery in, all so far so good.</p>\n<p>The only thing I wanted to do today was try to get some organizing done in the bedroom.</p>\n<p>Sigh.</p>\n<p>Until next time.</p>\n<p>This is post 56/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-12-01T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/turkey-day-it-is/",
      "url": "https://shanewrogers.lol/posts/turkey-day-it-is/",
      "title": "Turkey Day It Is",
      "content_html": "<p>Today is turkey day here in the States.</p>\n<p>Whatever that means.</p>\n<p>Many people, families, whatever, will gather for some kind of meal - stuffing their bellies overfull of food and arguing about who the heck knows what.</p>\n<p>Many people will profess their &quot;thankfulness&quot; for things and ideas that they hold dear to their hearts.</p>\n<p>I'll not deny that I and mine are also participants in some way. We've got the turkey in the oven. The pumpkin and pecan pies have been made. The corn flavored bread has been made. Other stuff will also be made.</p>\n<p>We'll have perhaps one or two other people here in our home, though there will be no talk of politics or other high blood pressure inducing subjects. We shall just enjoy our food and company.</p>\n<p>There would have been a time, many long years ago, that we would be planning out what to do tomorrow. What stores we would hit, where we would attempt to stake our claim on the commercial purchases for the upcoming gift giving season.</p>\n<p>While I have no doubt that some people will be doing that - we are not. I would think that, in general, with stores and companies having expanded their &quot;Black Friday&quot; sales from a single day to a week (or more) that many people would be closer to done with shopping than not.</p>\n<p>I know that we won't be going shopping tomorrow. I'll say that I'm mostly sure we are done for this year - with perhaps the exception of one or two things.</p>\n<p>I'd say that we didn't overspend this year, but that would be a lie. The same as every other year, sigh. We try to do one nice gift for each kiddo....with five kiddos that gets a little spendy. So we try to do what we can throughout the year.</p>\n<p>I don't normally do the whole &quot;I'm thankful spiel&quot;, but I am thankful that I've got a roof over my head that I was able to get a mortgage for and that I've got a decent vehicle and a job that I really enjoy.</p>\n<p>I don't doubt that I'm definitely privileged to be in the position that I'm in.</p>\n<p>So, for those of you out there who read this, and for those of you who celebrate - enjoy the day.</p>\n<p>Take it easy. Until next time.</p>\n<p>This is post 55/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-11-28T18:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/the-weekend-that-was-not/",
      "url": "https://shanewrogers.lol/posts/the-weekend-that-was-not/",
      "title": "The Weekend That Was Not",
      "content_html": "<p>The past weekend, despite it being my three day weekend, absolutely did not feel long enough.</p>\n<p>It almost feels as if there were two days stolen from me.</p>\n<p>A thought that I find unexplainable and honestly just plain weird.</p>\n<p>Friday and Saturday were event days, in more than a couple of ways, with Friday being the second evening of the middle school production of <em>Emma</em> and Saturday being the final showing of the same in the early afternoon.</p>\n<p>Saturday was also something of an interesting morning as well, we went into Kansas City and checked out a couple of rescue dogs.</p>\n<p>All right - let's get things straight first: I am <strong>not</strong> a dog person. I am a <strong>cat</strong> person. We already have a cat, who is nearing 10 years old at this point. I don't despise dogs, nor other animals, but I have come to the conclusion that I <em>much prefer other peoples pets</em>. I certainly do not have time to train and deal with a puppy.</p>\n<p>The plan on Saturday, was not to come home with a dog. We were going to look at a couple of them, both poodle mixes: a Bernedoodle and a Sheepadoodle.</p>\n<p>The Berne was your run of the mill rescue animal: skittish, but not aggressive at all, just scared and wanting to go back to his enclosure. His coat was okay, soft but in definite need of grooming. We walked with him for a bit, got to see that his stool was a little on the runny and soft side - which, not completely unexpected as he's nervous, but it could also be other problems. We had about an hour to check this guy out before we had to go to the next appointment.</p>\n<p>Next up we had the Sheepadoodle. It would be fair to say, I believe, that this lady was a complete 180 degree turnaround from the Berne. Super friendly, the people at the rescue had been with her since birth as her mama was litter bound when brought into the center. She basically choose me, it seems, a pretty lovable dog.</p>\n<p>There are certain breeds that I really like. Old English Sheepdogs being one, though - again - I don't want one. They are gorgeous animals. They take a lot of work. But they are iconic. I don't like Poodles. Now, that could be because most poodles that I've seen have that pretentious cut and groom on them. I don't know. But, I like some of the features of Poodles: not much shedding being one of the key points. I'll say that I do like the mixes and sheepadoodles look really good to me.</p>\n<p>So.</p>\n<p>We probably know where this is heading.</p>\n<p>Meet the new family member.</p>\n<iframe title=\"Pixelfed Post Embed\" src=\"https://pixelfed.social/p/swrogers/766107758650734771/embed?caption=false&likes=false&layout=compact\" class=\"pixelfed__embed\" style=\"max-width: 100%; border: 0\" width=\"400\" allowfullscreen=\"allowfullscreen\"></iframe><script async defer src=\"https://pixelfed.social/embed.js\"></script>\n<p>This is post 54/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-11-25T18:53:33+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/testing-the-echo-feed-to-bluesky/",
      "url": "https://shanewrogers.lol/posts/testing-the-echo-feed-to-bluesky/",
      "title": "Testing the echo feed to bluesky",
      "content_html": "<p>There is nothing to see here, folks.</p>\n<p>I was just noticing that the Echofeed to Bluesky cross posting wasn't working, so that's what I'm testing here.</p>\n",
      "date_published": "2024-11-22T17:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/a-week-of-progress/",
      "url": "https://shanewrogers.lol/posts/a-week-of-progress/",
      "title": "A Week Of Progress",
      "content_html": "<p>That has been both a very long and a very busy week.</p>\n<p>At least it's only my four day work week.</p>\n<p>Progress has been made in the work realm, that's probably one of the more fulfilling aspects of the week.</p>\n<p>Earlier this year Oracle decided that they were no longer going to support the graphical interface version of their Business Integration Catalog tool, which, grand scheme of things is awesome as it's an icky, gross, Java gooey that I despise.</p>\n<p>But, having replaced my laptop and not having kept the older version of the BI tools install setup (why, Shane....why), I had to get the newer one set up.</p>\n<p>Which, shock of shocks, is a command line tool.</p>\n<p>Super cool, now I can actually sorta kinda script the process. Not to mention that now report creation can be somewhat saved! We always had to manually select and click to create and run reports - now, at least, by virtue of saving the command line it's more easily repeatable.</p>\n<p>Now, it's just all about learning the switches and fine tuning the reports themselves.</p>\n<p>Oh and don't even get me started on getting the stupid tool installed.</p>\n<p>I'd almost, <em>almost</em>, forgotten just how horrible that process was.</p>\n<p>Our environments have a limited amount of <em>temporary</em> directory space. Normally it wouldn't be an issue, just make some new directory, assign it properly as as temp, set your shell environment variables and your good to go.</p>\n<p>Sometimes you might even need to set your java options. Because, java.</p>\n<p>But, does the Oracle installer bin file respect those environment variables?</p>\n<p>Of course it doesn't.</p>\n<p>Why would it.</p>\n<p>Nope, it needed some obtuse way to let the bin file know what the <code>java.io.temp</code> (don't quote me on that one) needs to be: <code>-J-Djava.io.temp</code> (again, don't quote me). Sigh. At least I got it and it's documented.</p>\n<p>On the personal and family side of things, tonight is opening night for the middle school musical. This year they are performing <em>Emma</em>.</p>\n<p>The older twin has the male lead. I feel horrible that I can't recall what the younger twin has....<em>but</em>, he is the understudy of the older. So there is that.</p>\n<p>Supposedly the other middle school brother is doing crew - but I have my doubts as to the veracity of that claim.</p>\n<p>I guess he'll be performing in the Spring play, though he probably doesn't realize that at this point.</p>\n<p>Not much else going on currently, so with that I'll sign off.</p>\n<p>This is post 53/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-11-21T20:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/what-have-i-been-doing/",
      "url": "https://shanewrogers.lol/posts/what-have-i-been-doing/",
      "title": "What have I been doing",
      "content_html": "<p>What have I been doing lately?</p>\n<p>Not much, I would say.</p>\n<p>I did start a new book recently, <em>What Moves the Dead</em> by <em>T Kingfisher</em>.</p>\n<iframe title=\"Pixelfed Post Embed\" src=\"https://pixelfed.social/p/swrogers/762107973477551400/embed?caption=false&likes=false&layout=compact\" class=\"pixelfed__embed\" style=\"max-width: 100%; border: 0\" width=\"400\" allowfullscreen=\"allowfullscreen\"></iframe><script async defer src=\"https://pixelfed.social/embed.js\"></script>\n<p>It's a retelling of Poe's <em>Fall of the House of Usher</em>. I'm only a few chapters in, and it's fairly short, but so far it's pretty good.</p>\n<p>I'm still also reading The Expanse series as well, plus I've picked up a decent number of other titles that will get added to the <em>to be read</em> pile.</p>\n<p>I think I'm preparing for the times when physical books are not as easily accessible, what with the way things are going. Both societally and politically.</p>\n<p>Anyhow.</p>\n<p>I've also ordered a couple of 12TB hard drives to pair with my Zima Board NAS kit and am certainly looking forward to getting that set up to store my media on. The stack of Blu-ray movies and DVDs in our library are in desperate need of being ripped.</p>\n<p>Can't say that I'm looking forward to that process, but it's needed.</p>\n<p>Another item that has had me occupied over the last couple of weeks or so is coming up with a new emacs config.</p>\n<p>While I have been using Doom Emacs for quite awhile at this point, I do like to know how things work a bit better, and this is a good way to grasp that understanding.</p>\n<p>The sad thing is, that I'm afraid I will basically just wind up reimplementing Soon Emacs, only with elpaca.</p>\n<p>There are a lot of good things with Doom, however, so I may just stick it out with that. There are also some quirkiness' as well - such as needing both <em>package!</em> along with <em>use-package!</em> to get something both installed and configured. It does make sense, seeing as <em>use-package!</em> is not a package installer though.</p>\n<h3 id=\"sunday-linkdump\">Sunday Linkdump <a class=\"direct-link\" href=\"#sunday-linkdump\">#</a></h3>\n<ul>\n<li>\n<p><a href=\"https://write.as/batata/observation\">https://write.as/batata/observation</a><br>\nWhoa, somebody who actually has more tabs opened up on their mobile browser than I do: 4500 to about 1600. I need to step up my game I guess! This is a great write up about setting up bookmark and RSS aggregation on their self hosted NAS.</p>\n</li>\n<li>\n<p><a href=\"https://about.iftas.org/2024/10/29/5-ways-to-fight-election-disinformation-on-bluesky-and-the-fediverse/\">https://about.iftas.org/2024/10/29/5-ways-to-fight-election-disinformation-on-bluesky-and-the-fediverse/</a><br>\nFrom the <em>Federated Trust and Safety</em> group, they've got some great tips on fighting disinformation (aka baldfaced lies) in this new day and age. Timeless stuff, really.</p>\n</li>\n<li>\n<p><a href=\"https://www.tunemymusic.com/transfer\">https://www.tunemymusic.com/transfer</a><br>\nVery handy little online tool for moving music playlists from service to service.</p>\n</li>\n</ul>\n<p>With that, I believe we'll call it a week.</p>\n<p>Until next time.</p>\n<p>This is post 52/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-11-17T15:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/not-really-reflection/",
      "url": "https://shanewrogers.lol/posts/not-really-reflection/",
      "title": "Not really reflection",
      "content_html": "<p>I have just not really been feeling it over the last week.</p>\n<p>I do believe that I shall leave it to as an exercise for the reader to figure out why that might be.</p>\n<p>Friday was my &quot;off work&quot; Friday, so it's essentially a four day weekend for me, what with tomorrow being Veteran's Day. I guess I won't actually complain about that, since there really are worse things going on right now.</p>\n<p>Eventually, my complaints won't even be referable as <em>first world problems</em>, for, you know, reasons.</p>\n<p>I just don't understand some people's children.</p>\n<p>But, I sure do believe that we're gonna waltz right into the <em>find out</em> portion of the night's program.</p>\n<p>And I, absolutely, one hundred percent, hope those people find the.... Yeah.</p>\n<p>The rather unfortunate aspect of all of this being, that those of us who do understand some of these things will also get to go along with this ride.</p>\n<p>I don't know who to blame.</p>\n<p>I don't know, I didn't understand.</p>\n<p>What I do know, is that I am at least fortunate being what I <em>am</em>. A white, hetero male.</p>\n<p>I guess I'm lucky.</p>\n<p>I'm also glad that I've already got a mortgage and a roof over our heads.</p>\n<p>I just want my family and kiddos and friends to be able to live and work and play in a safe world.</p>\n<p>I'm not too sure that's going to be the case.</p>\n<h3 id=\"linkdump\">Linkdump <a class=\"direct-link\" href=\"#linkdump\">#</a></h3>\n<ul>\n<li>\n<p>Molly White's Blogroll<br>\n<a href=\"https://www.mollywhite.net/blogroll/\">https://www.mollywhite.net/blogroll/</a><br>\nIf you're on the lookout for some good sources to fill out your feeds, here is a great start!</p>\n</li>\n<li>\n<p>John Scalzi  <a href=\"https://whatever.scalzi.com/2024/11/09/making-money-in-the-next-four-years-and-why-you-need-to-plan-now-to-support-your-favorite-creators/\">https://whatever.scalzi.com/2024/11/09/making-money-in-the-next-four-years-and-why-you-need-to-plan-now-to-support-your-favorite-creators/</a><br>\nAnother great read from a pretty good writer.</p>\n</li>\n<li>\n<p>Scholar’s new rap album seeks to turn the tables on the ‘masters’ from the Old South<br>\n<a href=\"https://theconversation.com/scholars-new-rap-album-seeks-to-turn-the-tables-on-the-masters-from-the-old-south-241895\">https://theconversation.com/scholars-new-rap-album-seeks-to-turn-the-tables-on-the-masters-from-the-old-south-241895</a><br>\nJust seems extraordinarily interesting!</p>\n</li>\n</ul>\n<p>This is post 51/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-11-10T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/at-the-desk-on-voting-eve-or-50-days-down/",
      "url": "https://shanewrogers.lol/posts/at-the-desk-on-voting-eve-or-50-days-down/",
      "title": "At The Desk on Voting Eve - Or 50 days down",
      "content_html": "<p>Here I sit, doing something that has become - for lack of a better word - unusual.</p>\n<p>I normally do my posting, updating, whatever you may, from my phone. So for me to be sitting at my desk, hands on a keyboard, eyes firmly entrenched on the monitor to my left, typing away at this Emacs (FTW!) window, it's rather not normal.</p>\n<p>Over time, I've just kind of gotten used to writing in this journal from my mobile device. It's easy, if not quick, and it <em>just works</em>. I guess.</p>\n<p>I would love to be one of those persons who could throw out tens of hundreds of words at a time, in a coherent and easy to follow manner, on any number of wonderful themes. But I'm not.</p>\n<p>I write about what's going on in my life, usually something that's centered around my kiddos or my job. Most usually something that probably isn't even interesting to myself. But I still try to find the time to do this.</p>\n<p>It does, perhaps, in its own way, help me to keep my sanity in some kind of check.</p>\n<p>So I sit here today, writing at my desk.</p>\n<p>Yeah, I'm using Emacs (not, I guess, in a <em>by the way</em> fashion of the <em>Archlinux</em> variety - which I do not actually use). Of the Doom Emacs variety. I've tried to go the <em>roll your own</em> route, but I've come to the conclusion that I'm always just trying to come up with my own Doom-spin-from-scratch...so might as well flippin' use Doom.</p>\n<p>But I don't use evil. Because I'm not evil-leaning. If you wanna use vim keybindings, then you do you. No harm no foul, doesn't hurt me either way. I can get by in vim, I think that anyone who works in a Unix environment should at least know their way around.</p>\n<p>Oh...yeah, tomorrow is <strong>the day</strong>. I'm so ready for this crap to be over, but I am realistic to know that tomorrow is really only the beginning of the ending. Either it's all gonna burn down (again) or it's gonna be a controlled burn. Either way. I know that I'll vote for the side of sanity, because I care about where I would like things to go and I care about the country that I leave my kids to.</p>\n<p>Living in a Red State, I'd normally say that my actual vote doesn't really count, but, it's kind of (almost) starting to actually count. Give it time, maybe it will. There is still local stuff, which is uber important as well.</p>\n<p>Then, well - and I kind of <em>almost</em> hate myself for admitting this fact - there is a small tiny part of me that hopes the side of chaos and insanity wins. <strong>Why the ever loving F would I want that?!</strong> Because I really despise the morons and idiots who <em>think</em> that the great orange gibbon gives a flying flip about them. Maybe they should get their just desserts. But, I don't really, <strong>really</strong>, hope that happens. Certainly not enough to vote that way.</p>\n<p>That would make a great story, though, perhaps.</p>\n<p>Though, I guess it's probably already been written a few times.</p>\n<p>This is post 50/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n<p>Whoa! I'm halfway through the challenge! Woot.</p>\n",
      "date_published": "2024-11-04T21:20:33+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/another-halloween-down/",
      "url": "https://shanewrogers.lol/posts/another-halloween-down/",
      "title": "Another Halloween Down",
      "content_html": "<p>I think I'm slowing down.</p>\n<p>I'm moderately certain that I am slowing down.</p>\n<p>Not that I want to make this post be anything more than a &quot;Hey, guys! I'm <em>almost</em> halfway finished with my 100 days challenge!&quot; But yeah, that may be dang near what this turns into.</p>\n<p>Today is November 1. (Which reminds me, I need to update the front matter to this post.) Which would make yesterday Halloween. Yep.</p>\n<p>We took the two youngest kiddos out trick or treating last night, along with  a couple of the older ones friends. We had a pretty good time. What were we all dressed as, I hear absolutely nobody asking....well, I'll be glad to say!</p>\n<p>We had Thing 1 and Thing 2, a Minecraft Ender Dragon and the final kid didn't really have a costume unless you counted their standard daily &quot;skater grunge punk&quot; as a costume... meh why not!</p>\n<p>The wife dressed up as a good looking broken doll, while I was some dapper looking gentleman from old time-y whenever and wherever. It was fun.</p>\n<p>The older two did also dress up, though one went out with his friend to trick or treat, while the other started out at the community garden before heading downtown. The first was a cool looking anime school character while the other was some kind of dark leather bound bird demon or something.</p>\n<p>I'm glad that's over, though. More or less.</p>\n<p>Now it's all about getting ready for the holidays.</p>\n<p>I'm just kinda sad that I never made it to the World's of Fun Haunts.</p>\n<p>This is post 49/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-11-01T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/another-week-down/",
      "url": "https://shanewrogers.lol/posts/another-week-down/",
      "title": "Another week down",
      "content_html": "<p>What all is going on this week?</p>\n<p>Not a whole heck of a lot, although I do suppose that there will be a holiday of some sort thrown into the mix, in one way or another.</p>\n<p>We've got most of the costume situation sorted out, at least for those that want them.</p>\n<p>The major question is whether or not the last one is going to arrive in time. I do believe that things are going to be very close.</p>\n<p>Last week was pretty good over all. One contract at work was finally taken care of, which is one giant weight off of my shoulders.</p>\n<p>I've also recently (re)learned, after having forgotten, that Oracle is no longer supporting their graphical catalog manager from the BI tools packages. They are, however, continuing development of the command line client.</p>\n<p>Which, I suppose, is actually not a bad thing as I can script that bad boy to get my reports.</p>\n<p>This upcoming week should be good, one kiddo will be heading to an orchestra event. Leaving at 6:45 in the morning. Yippee.</p>\n<p>Should be a good week!</p>\n<p>This is post 48/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-10-26T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/such-a-strange-week/",
      "url": "https://shanewrogers.lol/posts/such-a-strange-week/",
      "title": "Such a strange week",
      "content_html": "<p>It has been such a long, unusually strange week.</p>\n<p>Let us take yesterday, as an example: it was a Friday, but it didn't feel like a Friday. Nor did it feel like a Saturday. Or a Sunday. I don't know what day of thee week it felt like, it just seemed off.</p>\n<p>I would imagine that having odd number of kiddos home probably had something to do with it. Parent teacher conferences make for a short week of school. The majority of them only had a three day week. The one oddity being the kiddo in advanced math having to take his class on Thursday at the high school. Then they were all home on Friday, which is super exciting.</p>\n<p>Insofar as work goes for me, I assisted with a presentation and facilitation of a question and answer session for the new ticketing tool that we've been on for a month or so.</p>\n<p>That actually went pretty well.</p>\n<p>Documentation has been added to for the department. I think that is one of my favorite things to do, if I'm being honest. I try to keep good instructions for not only future me, but for my users as well. We've got a pretty decent wiki application for that. Of course I still wind up just exporting stuff out to PDF, but it is what it is.</p>\n<p>I have jumped back into trying to learn Angular once again. The previous attempt was back in 2020 and I almost made it all the way through the course that I was taking. I've got a handful of them, two of them are pretty highly recommended. I would say that I'd like to get some kind of webdev position, but I think realistically I love what I do far too much to go that route.</p>\n<p>Of course, I also like to dabble in Clojure, so yeah.</p>\n<p>I feel that I'm kind of akin to the hyperactive pet who sees one shiny thing after another and just can't keep his mind on one thing at a time. I get bored easily I suppose.</p>\n<p>Then I'm also currently staring at a hard copy of <em>Django 5 By Example</em>. Ugh. I've liked django since before they went through the magic removal stuff. Way, way back in the day at this point. I'd even built a blog that contained a reading list that pulled info from a certain well known book selling website to keep my reading list in. I was kind of proud of that.</p>\n<p>Ah well.</p>\n<p>Not much going on today - we'll make a store run and take the little one to birthday party. Should be fun!</p>\n<p>This is post 47/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-10-19T15:51:44+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/week-that-was-and-other-stuff/",
      "url": "https://shanewrogers.lol/posts/week-that-was-and-other-stuff/",
      "title": "Week that was and other stuff",
      "content_html": "<p>Time to play a little bit of catch-up, seeing as I didn't post anything yesterday. Or the day before.</p>\n<p>I shall wait for the collective &quot;aww, shucks, we sure missed reading your stuff!&quot;, because, yeah, it's still basically just for myself. Which is totally cool with me.</p>\n<h3 id=\"last-week\">Last Week <a class=\"direct-link\" href=\"#last-week\">#</a></h3>\n<p>Not a whole heck of a lot going on last week really.</p>\n<p>Picked up the new work laptop so I could replace the one that has basically had the battery and keyboard crap all over itself, so that's been fun. Which, I'm pretty sure that nobody in the history of the world has ever actually said. While I do have backups of everything and don't have much to worry about in that department, getting the new machine all sorted out is just a huge pain in the rear.</p>\n<p>But, it is a great time to look and reflect on the applications that I <em>really</em> need to do my work with. Plus, it's been great to get away from Firefox and move my work browsing over to Vivaldi. So there is that.</p>\n<p>I was able to get WSL2 set up, even exported/imported my old setup image which is amazing.</p>\n<p>We might finally have the Halloween costume situation sorted out for everyone in the house - no small feet these days. Yesterday we made a short trip to one of the regional <em>Spririt Halloween</em> stores, conveniently located near a <em>Costco</em> that we also needed to run into, to gather ideas and make a handful of purchases.</p>\n<p>One of the twins picked up some black raven stuff, about all that we needed to get afterwards was a black overcoat and now some black pants that he won't complain about. Wish us luck there. The overcoat was not very easy to find and we wound up spending a bit more than I'd like - but, we sure do love our kids, right?</p>\n<p>The other twin was going to go with a Knight theme, but decided last minute not to go that route. Now he's going with an anime character. We had to order his costume last night, and the hope now is that it <em>fits him</em> and <em>isn't made super cheaply</em>. So, we'll see there.</p>\n<p>The wife picked up some cool face masks, the favorite at the moment would seem to be a broken doll. I really like the idea.</p>\n<p>For myself, I procured a <em>Phantom of the Opera</em> style mask that I'm hoping is able to complement the rest of the outfit that I've got. I'm not doing a silly cape, though.</p>\n<p>The little one already had his costume purchased - an <em>Ender Dragon</em> from <em>Minecraft</em>.</p>\n<p>The next to youngest (but quite possibly the most mature) of the group, still has yet to really put a finger on what he'll do. We had thought that he and a friend were gonna do some kind of matching costume set, but that seems to have changed. Last year they did <em>Mario and Luigi</em>, the year before was the <em>Sun and Moon</em>. I don't know what they'll do yet.</p>\n<p>I do believe that was basically most of last week (with some smattering of yesterday, alas) which brings us to...</p>\n<h3 id=\"this-week\">This Week <a class=\"direct-link\" href=\"#this-week\">#</a></h3>\n<p>It's a short school week, which is always fun.</p>\n<p>Not.</p>\n<p>Parent teacher conferences are at the end of this week. We've really only got one kiddo who I'm concerned about, but really, all in all I can't complain about our kids.</p>\n<p>The youngest kiddo has Fall Picture Day coming up Tuesday. Which at least kinda makes sense, moreso than the middle school who does picture day on like the third day of school. I, for one, am looking forward to when picture day happens like the week before school starts. It's only a matter of time.</p>\n<p>We've got some other appointments happening this week too, which shouldn't be too trying.</p>\n<p>On the work front, I'll be taking part in a demo/question/answer session for some new tools that I'm also in the middle of learning. Fun times, that.</p>\n<p>We are also still fighting with getting things paid, so that blows chunks all over the road. Sometimes one wonders if the <em>right hand</em> is aware that the <em>left hand</em> exists and is doing things.</p>\n<h3 id=\"link-dump\">Link Dump <a class=\"direct-link\" href=\"#link-dump\">#</a></h3>\n<p>I might even have some links to dump on the post this week.</p>\n<ul>\n<li>\n<p><a href=\"https://htmlforpeople.com/\">HTML for people</a><br>\nI have yet to go through much of this, well, any of it really. But you can't go wrong with a good up to date source for learning HTML. From Blake Watson.</p>\n</li>\n<li>\n<p><a href=\"https://www.kcur.org/arts-life/2024-10-11/were-fighting-that-throwaway-culture-local-kitchenaid-repair-shop-gains-international-following\">A KitchenAid repair shop in Kansas found a global following by ‘fighting that throwaway culture’</a><br>\nThought this was pretty cool, given that it's from the home State.</p>\n</li>\n<li>\n<p><a href=\"https://every.to/p/the-disappearance-of-an-internet-domain\">The Disappearance of an Internet Domain</a><br>\nI have seen a lot of talk about this, given recent politcal happenings. This might be something to keep an eye on. I don't have any dot-io domains, but I do use some dot-io services.</p>\n</li>\n<li>\n<p><a href=\"https://www.thetimes.com/life-style/parenting/article/we-only-learnt-of-our-sons-secret-online-life-after-he-died-at-20-rj3bqfnqn\">We only learnt of our son’s secret online life after he died at 25</a><br>\nI'll admit, this one got me in the feels.</p>\n</li>\n</ul>\n<p>With that, we'll call it a day.</p>\n<p>Until next time.</p>\n<p>This is post 46/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-10-14T14:50:30+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/trying-to-leave-onenote/",
      "url": "https://shanewrogers.lol/posts/trying-to-leave-onenote/",
      "title": "Trying to leave OneNote",
      "content_html": "<p>This particular post is most likely just going to be of interest to future me, though some others may find some information of use.</p>\n<p>As my place of employment is a Microsoft shop, we use a large number of Microsoft applications. Personally, I'm not really a major fan of some of these apps so I like to look for good alternatives.</p>\n<p>Fortunately, I have grown used to being in the WSL environment and Emacs in particular.</p>\n<p>Historically I have been using OneNote to keep track of, um, notes and tidbits and whatever else one might want to put into a notebook. It has worked <em>just fine</em> but I don't like the fact that I don't have a lot of control over the format. I've kind of grown fond of just using text, and have been attempting to integrate Emacs' org-mode into more of my workflow.</p>\n<p>(I would love to say that I'm using org-mode for this blog, but alas, I am not - although it <strong>is</strong> plain markdown.)</p>\n<p>I recently came upon a tool that caught my interest, the <a href=\"https://github.com/alopezrivera/OneNoteExporter\" title=\"OneNoteExporter by alopezrivera\">OneNoteExporter</a> PowerShell script from <strong>alopezrivera</strong>. Easily enough installed into my Windows 11 laptop, it only really required pandoc as an additional requirement.</p>\n<p>Once I had the configuration file tweaked to my liking, I fired the script off. Of note, the powershell script needs to run at the same user level elevation as the currently running OneNote application. Also, a temporary script bypass may need to be run in powershell in order for the process to succeed: <code>Set-ExecutionPolicy ByPass -Scope Process</code></p>\n<p>There were a handful of errors at first, which were similar <a href=\"https://github.com/alopezrivera/OneNoteExporter/issues/11\">to this issue</a>. I was able to make the same edit as suggested and those problems were resolved.</p>\n<p>The next stumbling block that I came upon was the large amount of screenshots and images that I had in my OneNote notebooks. Those were not being exported by the pandoc process. As is normal within the world of the internet, I <a href=\"https://github.com/theohbrothers/ConvertOneNote2MarkDown/issues/183\">was not the first person to have this problem</a>. One thing that I most absolutely <em>did not</em> want to have to do was re-save all of those images in another format, <strong>or</strong> copy and paste the pages themselves into a new page - both of which were suggested as possible solutions. Thankfully, a very simple solution was found by another user <a href=\"https://github.com/theohbrothers/ConvertOneNote2MarkDown/issues/183#issuecomment-2343708831\">in that OneNote needs to download all files and images before syncing</a>.</p>\n<p>With that issue taken care of, everything was golden, right?</p>\n<p>Mostly.</p>\n<p>I still had to go through and add the proper filename extension to all of my fresh org files. Still haven't figured out why that was, but it was easy enough with emacs and wdired mode.</p>\n<p>Now, with my work related notes over in org mode and copied up to the work OneDrive I should be ready to roll.</p>\n<p>I hope.</p>\n<p>This is post 45/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-10-10T15:21:38+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/work-work-work/",
      "url": "https://shanewrogers.lol/posts/work-work-work/",
      "title": "Work work work",
      "content_html": "<p>It feels like it's been a decade since I last made a post here.</p>\n<p>It has not, of course, but just the nature of the beast that is time, has made the days and hours drag on into endless streams of murk.</p>\n<h3 id=\"work-stuff\">Work stuff <a class=\"direct-link\" href=\"#work-stuff\">#</a></h3>\n<p>At work we have been going through a new purchasing and procurement process. Oh my ever loving flying spaghetti monster...talk about making the days flipping drag on. The problem with this is that many weeks ago we had let them know that we were going to need to renew a cloud based service license that we've been using since before I started there, about five years ago.</p>\n<p>Our contract expires on the ninth of this month. We've had a quite from them since before the start of this month, say late September. This was sent to procurement.</p>\n<p>Who it seems have sat on it, as is their way. They did, eventually, let us know that &quot;Hey, can we get you guys to fill out this form?&quot; Oh <strong>FFS</strong>. Sure, I'll fill the form out.</p>\n<p>Couple of days later, &quot;Hey, we need some clarification on such and such.&quot;</p>\n<p>Oh. Em. Gee.</p>\n<p>If we lose access to this freaking tool because they took their sweet arse time, I'm gonna hurl.</p>\n<h3 id=\"more-work-stuff\">More work stuff <a class=\"direct-link\" href=\"#more-work-stuff\">#</a></h3>\n<p>In other work related fun and excitement, I've got a brand spanking new work laptop to get set up.</p>\n<p>I think this is my least favorite activity to do in the whole entirety of existence.</p>\n<p>I feel that I should be working on getting it set up now, but it's a Saturday and I don't work on weekends. I love my job, but not that much.</p>\n<p>Besides it's about time to get dinner ready.</p>\n<h3 id=\"non-work-stuff\">Non work stuff <a class=\"direct-link\" href=\"#non-work-stuff\">#</a></h3>\n<p>Do I have any non work related stuff to share today?</p>\n<p>Oh, I managed to get into the dentist office not <em>once</em>, but <em>twice</em> this week! You should be sooo jealous and envious of me now.</p>\n<p>I've got some other projects in the making, I think, one of which will be a new smaller NAS using a Zima Blade server. I've got the setup I just need to get the storage now.</p>\n<p>I'll be rooting for the Kansas City Royals, too. They've already had a successful season, but it would be amazing to see them win another series and move on.</p>\n<p>All right, until we meet again.</p>\n<p>This is post 44/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-10-05T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/my-tool-selection-stinks/",
      "url": "https://shanewrogers.lol/posts/my-tool-selection-stinks/",
      "title": "My tool selection stinks",
      "content_html": "<p>Yeah, this is one of those &quot;I'm just kinda pissed off days&quot;.</p>\n<p>I despise these days, but I guess at least I know it's a thing - right?</p>\n<p>The so called straw today has been the fact that we have to replace the plate on one of the vehicles. This would not be a problem if the plate were easy to remove.</p>\n<p>But, no, one of the screws is good and rusted in and now stripped out. Went to one of the hardware stores in town and bought the only screw extraction kits they had - some POS that is. Sigh.</p>\n<p>Now I'm waiting on the Dremel to charge up. Yeah, I'm just going to go nuclear on it. Kind of out of options at this point, honestly.</p>\n<p>I just want to know why it is that the State can't just have plates replaced as they go. Seems like an expensive ordeal to me.</p>\n<p>Oh well. I need better tools.</p>\n<h3 id=\"link-dump-sunday\">Link Dump Sunday <a class=\"direct-link\" href=\"#link-dump-sunday\">#</a></h3>\n<ul>\n<li>\n<p><a href=\"https://simonwillison.net/2024/Sep/27/themes-from-djangocon-us-2024/\">Simon Wilson has a writeup of DjangoCon 2024</a><br>\nSome really cool talks and other stuff from the looks of it.</p>\n</li>\n<li>\n<p><a href=\"https://www.citationneeded.news/posse/\">POSSE: Reclaiming social media in a fragmented world</a><br>\nInfo on how Molly White does her own style of POSSE, includes a link to her own source repo.</p>\n</li>\n<li>\n<p><a href=\"https://glenneth.org/a-journey-into-scheme.html\">My Journey into Scheme: Building a Simple Symlink Manager with Guile Scheme</a><br>\nHave yet to read this, but I do like to read about other people's journeys through these types of paths.</p>\n</li>\n</ul>\n<p>We shall call that good for now.</p>\n<p>This is post 43/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-09-29T19:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/my-couch-to-5k-start/",
      "url": "https://shanewrogers.lol/posts/my-couch-to-5k-start/",
      "title": "My couch to 5k start",
      "content_html": "<p>Yesterday I started my first session of the <em>Couch to 5K</em> program.</p>\n<p>I'm not going to say that it was completely brutal, but it was definitely a challenge for myself.</p>\n<p>I've never been a runner. Nor a jogger. Heck I haven't even been much of a walker with the exception of the last year, maybe.</p>\n<p>But for some reason, I've got this crazy idea that I would like to run a 5K.</p>\n<p>Slowly but surely I have been trying to work my body to to being prepped, in some way, for the coming activity. By walking and trying to keep a brisk pace, by going longer and longer distances.</p>\n<p>At this point, I can do right at a three mile walk in about 40 to 45 minutes. My average is just over a 13 minute mile.</p>\n<p>Certainly not an Olympic caliber, but I'm okay with that.</p>\n<p>Yesterday, using one of the many <em>C25k</em> apps out there, was my first stress test. I would say that I succeeded.</p>\n<p>Sure, it was not easy, and yeah I was looking forward to that &quot;You are on run 8 of 8&quot; notification, but I survived.</p>\n<p>I did the complete 3K (I think) trek in 30 minutes, finishing very close to the end of our trail at the conclusion of the program.</p>\n<p>Of course, silly me still wanted to finalize my <em>actual</em> normal walk path, so I continued on for another less than mile.</p>\n<p>That, I admit and know now, was a mistake. According to my Fitbit app, the first two miles were under 13 minutes each.</p>\n<p>The last was at an over 17 minutes pace. Yeah, no good, and I felt it!</p>\n<p>I'm looking forward to doing this again today!</p>\n<p>This is post 42/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-09-27T14:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/one-most-non-excellent-day/",
      "url": "https://shanewrogers.lol/posts/one-most-non-excellent-day/",
      "title": "One most non excellent day",
      "content_html": "<p>Good grief has it been a rough day.</p>\n<p>Had the youngest kid home today, &quot;sick&quot;, from school.</p>\n<p>Naturally, when I got back home from picking one of the twins up from zero hour to take him to school number two, the child was all &quot;I feel much better now, can I do this other thing that I am not allowed to do on days that I'm home sick from school?&quot;</p>\n<p>Of course, that wasn't <em>exactly</em> how he asked, but I'm sure the idea has been transferred.</p>\n<p>That was also not the only thing that was asked for, nor were these questions only asked one time.</p>\n<p>Incessant, constant nagging.</p>\n<p>It really, just kind of grates on the mood and makes one want to just disassociate.</p>\n<p>After all of that, then it's time to get dinner prepped and ready. Something that I generally actually enjoy doing.</p>\n<p>Cooking is fun. Relaxing. Prepping things that people might want to eat.</p>\n<p>Low and behold, today was the attack of the crummy, small, no stinking room in it, kitchen.</p>\n<p>No room in the floor. Nor the countertop. Cat food spilled all over the floor. Cauliflower dropped on the floor.</p>\n<p>There are some days where it just feels like the world is out to get you. I know that's ridiculous.</p>\n<p>But oh my ever loving lord.</p>\n<p>This is post 41/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-09-24T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/some-accomplishments-and-a-challenge/",
      "url": "https://shanewrogers.lol/posts/some-accomplishments-and-a-challenge/",
      "title": "Some accomplishments and a challenge",
      "content_html": "<p>Yesterday was <em>disable access and delete our cloud service desk</em> product day.</p>\n<p>I think. The days just kind of blend together. It went fairly well, I think. I've been able to get a small handful of documentation put together as well.</p>\n<p>There was a lot of stuff that got accomplished yesterday, in fact. Got some quotes, got some import scripts written and ran. I still want to go through and clean these up, maybe get them working with <em>uv</em>. Assuming root isn't required.</p>\n<p>I've got to get some patches on the schedule, which is all good.</p>\n<h3 id=\"october-challenge\">October challenge <a class=\"direct-link\" href=\"#october-challenge\">#</a></h3>\n<p>There aren't a whole lot of things that I do to challenge myself these days. I need to change that, so I'm going to go easy with this one.</p>\n<p>First, I've decided that my Steam library is just too ridiculous. Plus, my wallet.</p>\n<p>I find that I far, far too often get sucked into steam sales and other bundle sales. It's time to try to go a month without making any game purchases.</p>\n<p>Wish me luck.</p>\n<p>This is post 40/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-09-20T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/change-is-for-the-anxious/",
      "url": "https://shanewrogers.lol/posts/change-is-for-the-anxious/",
      "title": "Change is for the anxious",
      "content_html": "<p>Sometimes there are aspects of my job that are really, really, butt pickering and anxiety inducing.</p>\n<p>Today is lining up to be one of those days.</p>\n<p>As I write this, it's after 08:30, as soon as I get back into the (home) office I get to remove a couple of our cloud applications we subscribe to.</p>\n<p>It's a <em>cloud</em> service desk product, a very popular and well known one. We have turned over to a new system as of this week, basically. We will only be continuing with one of their products, for project management, since the new one kinda sucks, in order for people to get used to the change.</p>\n<p>Naturally, this company is unable to provide us with an appropriate quote for just the single product unless we remove, thus deleting, everything that's on their servers. We have their <em>export for our own cloud</em> pulled down, so, we should have everything.</p>\n<p>In theory.</p>\n<p>It is still arse clenching to remove these though.</p>\n<p>This is post 39/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-09-19T13:45:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/dammit-amazon/",
      "url": "https://shanewrogers.lol/posts/dammit-amazon/",
      "title": "Dammit Amazon",
      "content_html": "<p>I think I'll keep it short and sweet today.</p>\n<p>I'm at that point to where I think I really stinking despise Amazon deliveries.</p>\n<p>Was supposed to get a couple of packages today, a movie along with some other useful items.</p>\n<p>We received <em>some</em> of them. One item, though it was packaged decently, has this ridiculous white scratch mark that shouldn't be there and that I shouldn't have to live with. So that'll have to be dealt with - fine.</p>\n<p>One item, a 4K movie, which had been ordered separately but was shipped in the same delivery (theoretically) was not received. But does Amazon have a way to say &quot;one item from this delivery was not received&quot;? Not that I can tell. So, I just say &quot;delivery not received&quot;, with a comment about the item missing.</p>\n<p>I'm done with Amazon.</p>\n<p>At least for now.</p>\n<p>It's hard to avoid them sometimes.</p>\n<p>This is post 38/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-09-13T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/today-was-the-day/",
      "url": "https://shanewrogers.lol/posts/today-was-the-day/",
      "title": "Today was the day",
      "content_html": "<p>Well today was the day.</p>\n<p>We've been working towards getting the new single overall help desk slash inventory slash <em>cough</em>project management<em>cough</em> service set up for our department for a handful of months at this point.</p>\n<p>Things were finally, more or less, set up and turned on this afternoon. The last thing that was holding things up was the email set up and monitor service. This, evidently, required a lot of thought and assistance from central IT, from the vendor we're purchasing the service from, and from the vendor we procure our email service from.</p>\n<p>Even with all of that help, it took hours of working over multiple days.</p>\n<p>But, they've gotten it set up for us. It's great to be the guinea pig.</p>\n<h3 id=\"cross-country\">Cross country <a class=\"direct-link\" href=\"#cross-country\">#</a></h3>\n<p>The twins attended the second cross country meet of the season this week. Both of them were able to run this time and I'm proud as heck of them.</p>\n<p>Just finishing one of these things would be a major challenge for me, and these two both do all right. They have made excellent progress since last year.</p>\n<h3 id=\"entertain-me\">Entertain me <a class=\"direct-link\" href=\"#entertain-me\">#</a></h3>\n<p>It has certainly been a week for receiving movies and books and other entertainment items.</p>\n<p>My copy of the Japanese collectors edition box of <em>Godzilla Minus One</em> arrived early this week. Blu Ray, 4K UHD, it looks <strong>phenomenal</strong>. Plus it comes with <em>Godzilla Minus One Minus Color</em>. I'm beyond excited to have this!</p>\n<p>I also picked up steelbooks of <em>Coraline</em> and <em>The Last Unicorn</em>. Two of my favorites.</p>\n<p>My copy of <em>Dark Nights Metal</em> graphic novel arrived this week as well. I've actually read the series previously, back when I subscribed to DC Universe Unlimited, or whatever it is that the online DC comics platform is called. Very good stuff and I'm looking forward to reading it again.</p>\n<p>In &quot;TV&quot; land, we've been watching <em>The Fall of the House of Usher</em> on Netflix over the past week. Pretty decent stuff, only eight episodes so not a lot of filler. The volume is a little inconsistent at times though.</p>\n<p>All right then, that's what I've got this time, until the next.</p>\n<p>This is post 37/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-09-12T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/call-it-a-weekly-wrapup/",
      "url": "https://shanewrogers.lol/posts/call-it-a-weekly-wrapup/",
      "title": "Call it a weekly wrapup",
      "content_html": "<p>Not much of an interesting week, this one.</p>\n<p>I've been meaning to try to get something down and posted but it's been a week of zero motivation.</p>\n<p>I haven't even mowed the lawn in two weekends at this point. Fortunately I don't think I <em>need</em> to mow yet, but I probably will before the season is out.</p>\n<p>One of the twins was able to participate in the first cross country event this season and he did pretty well! I would like to be able to run with him, but I'm not there yet.</p>\n<p>I still try to take my lunch hour excursions and walk. Generally I can get in just under three miles in about forty minutes. Then a quick shower before logging back in to work.</p>\n<p>My goal still remains to run a 5K. I'm sure I'll get there.</p>\n<p>I had ordered the <em>Run Your Own Mail Server</em> book, by Michael W Lewis, towards the end of the pre-order period and it finally arrived this week! I've run mail servers for myself in the past, generally through systems like <a href=\"https://mailinabox.email/\">mail on a box</a> or <a href=\"https://yunohost.org/\">yunonost</a>. I think even at one point I had set up <a href=\"http://www.qmailtoaster.net/\">qmail toaster</a>.</p>\n<p>But it's nice to know more about the what's and the why's, and it looks like this most excellent book is going to help out in that department. I don't know that I'll set something up from scratch... But that is certainly an itch.</p>\n<p><img src=\"https://cdn.some.pics/swrogers/66de154608ac5.jpg\" alt=\"The book: Run Your Own Mail Server, by Michael W Lucas\"></p>\n<h3 id=\"linkdump\">Linkdump <a class=\"direct-link\" href=\"#linkdump\">#</a></h3>\n<ul>\n<li>\n<p><a href=\"https://www.sigops.org/2024/the-moral-implications-of-being-a-moderately-successful-computer-scientist-and-a-woman/\">The Moral Implications of Being a Moderately Successful Computer Scientist and a Woman</a><br>\nI have not read this one yet, but it's certainly high on my list.</p>\n</li>\n<li>\n<p><a href=\"https://cleoinvestigation.notion.site/Investigating-Cleo-0796ef7ce8464a90ba388cdb68e08eef\">Investigating Cleo</a><br>\nIt's always entertaining to read about who mysterious anonymous posters might be, even if there is no real need or desire to dox anyone. I haven't made it through everything in this, but it's about a user in one of the math boards who always manages to post responses to some very challenging integration problems. Are they a team? Are they using multiple accounts? Who knows.</p>\n</li>\n<li>\n<p><a href=\"https://earthly.dev/blog/golang-http/\">Building a Golang JSON HTTP Server - Earthly Blog</a><br>\nI've been looking more into learning go, so it's nice to have more stuff to learn from.</p>\n</li>\n</ul>\n<p>That's all I've got for now, until time the next all!<br>\nThis is post 36/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-09-08T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/long-weekend-and-no-motivation/",
      "url": "https://shanewrogers.lol/posts/long-weekend-and-no-motivation/",
      "title": "Long weekend and no motivation",
      "content_html": "<p>Happy long weekend all!</p>\n<p>I guess.</p>\n<p>I can't really relax, I have this constant feeling today that I need to be doing something. Anything.</p>\n<p>It's not like I've been lazy today, either. Woke up, made my mug of coffee. Cleaned out the floor of our &quot;soon to be coat&quot; closet. Emptied the dishwasher. Filled the dishwasher. Ran the dishwasher. Took my first sip of coffee.</p>\n<p>Still there are so many things that need to be done. Or, that I feel should be done.</p>\n<p>I should mow the lawn, for example.</p>\n<p>I can't get motivated today.</p>\n<h3 id=\"the-weekend\">The weekend <a class=\"direct-link\" href=\"#the-weekend\">#</a></h3>\n<p>We had a pretty decent weekend I guess.</p>\n<p>Saturday was a birthday party for the daughter of a friend. Our little man enjoys going over there, so it was a good time.</p>\n<p>Sunday was the penultimate day for the local water park to be open this year, so we went out that direction. I didn't go there as I'm not as big a fan, but the wife and the little did go and seemed to enjoy the day.</p>\n<p>Myself and the eldest twin went to the amusement park side. It was really pretty good, not too hot, not too many people. We were able to get in half a dozen rides in - mostly coasters - within a handful of hours.</p>\n<p>Any time you don't have to spend three hours in a single line is a good day.</p>\n<p>Afterwards, we met up and had dinner in the the amusement park so the little guy could ride some stuff too.</p>\n<p>Then the adults got to eat.</p>\n<p>It was a successful trip, all in all.</p>\n<p>We'll be back in a couple of weeks for the halloween haunts they set up. Those are great!</p>\n<h3 id=\"link-dump\">Link dump <a class=\"direct-link\" href=\"#link-dump\">#</a></h3>\n<p>A day late and a dollar short. Refunds can be had at the door.</p>\n<ul>\n<li>\n<p><a href=\"https://fighthealthinsurance.com\">Fight Health Insurance</a><br>\nHave you ever been denied a health insurance claim? This site was built by a user who was sick and tired and wanted to help others. So this was created using an LLM.</p>\n</li>\n<li>\n<p><a href=\"https://sfstandard.com/2024/08/23/holden-karau-fight-health-insurance-appeal-claims-denials/\">'Make your health insurance company cry': One woman’s fight to turn the tables on insurers</a><br>\nAn article on the previous link.</p>\n</li>\n<li>\n<p><a href=\"https://landsat.gsfc.nasa.gov/apps/YourNameInLandsat-main/index.html\">Your name in LANDSAT</a><br>\nThis is just cool. 😎</p>\n</li>\n</ul>\n<p>This is post 35/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-09-02T16:00:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/did-we-not-just-do-that/",
      "url": "https://shanewrogers.lol/posts/did-we-not-just-do-that/",
      "title": "Did we not just do that",
      "content_html": "<p>It's almost like it never ends, you know!</p>\n<p>Received an email notification from <em>Ye Olde Vendor</em> that they were scheduling the next patch for our development environment. Great! But damn...it sure seems like we <em>just</em> went through all this!</p>\n<p>I guess that was in mid to late May. But <em>test</em> didn't get patched until flipping June, not to mention <em>prod</em> not that long ago.</p>\n<p>Ugh. At least they actually keep stuff updated. No new patches available for the gateway product, yet, so we'll keep an eye out there.</p>\n<p>It's been a pretty good week, actually. Got some documentation written and sent out. Got a quote and an order out together for some new laptops to replace out of warranty stuff. Not a bad week.</p>\n<h3 id=\"no-flame-wars-here\">No flame wars here <a class=\"direct-link\" href=\"#no-flame-wars-here\">#</a></h3>\n<p>I figured I'd start a separate header for this one.</p>\n<p>I have always been of the belief that you should use the tool, or tools, that work for you and your situation. If that took us, say, <em>vi</em>, then great! If that took is <em>emacs</em>, then great! Personally, it effects me exactly zero on the iota scale.</p>\n<p>Whatever makes you happy and floats that boat, or scratches that itch, or whatever. Though, I do believe that every body who is going to do any kind of system administration on a Unix style server should at least be able to stumble through vi or vim. If for no other reason than it's almost always available.</p>\n<p>Then even within those two sacred camps you've got people who espouse certain styles of usage. Take emacs, for example. Some people like to use the &quot;starter kits&quot;. Be that purcell, spacemacs, doom, bedrock, etc etc. Some people think you should use vanilla. Some people swear by a literate programming version of their config.</p>\n<p>Those are all awesome! Again, use what works for you. Personally, I'm familiar with vi enough that I'm a little dangerous. I don't have any kind of vi setup, I just know enough to get by. I have used emacs for some time now, my first real usage and &quot;config&quot; was spacemacs. Then I've gone through other kits. I've tried rolling my own, with and without a literate config. I've finally stopped with doom, complete with my own customizations.</p>\n<p>Just use what works. In Whatever way that is.</p>\n<p>That's all I've got on that.</p>\n<p>This is post 34/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-30T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/irrationality-it-is/",
      "url": "https://shanewrogers.lol/posts/irrationality-it-is/",
      "title": "Irrationality it is",
      "content_html": "<p>Sometimes I just don't really know.</p>\n<p>There are days that I just want to give up.</p>\n<p>Throw in the towel.</p>\n<p>Half of today was one of those.</p>\n<p>Things were okay for the most part, but then, the crap just gets flung into my face.</p>\n<p>Then, I turn irrationally angry.</p>\n<p>My mood sours and I become dour.</p>\n<p>I just, don't know.</p>\n<p>I guess I'm glad I've not done anything I won't regret doing.</p>\n<p>Right?</p>\n<p>This is post 33/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-27T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/oceans-of-tiredness/",
      "url": "https://shanewrogers.lol/posts/oceans-of-tiredness/",
      "title": "Oceans of tiredness",
      "content_html": "<p>Just got back from taking the kiddos to the local water and amusement park locale...we are all incredibly tired and wore out.</p>\n<p>It was, supposedly, a heat warning kinda day - but honestly it didn't seem nearly as bad as it has in the past. At the park, I didn't even get in too bad a shape until towards the end, and to be realistic I was actually cold.</p>\n<p>It goes along with water and not having a large amount of body fat these days. Something of a side effect I suppose.</p>\n<p>After spending some time with the kiddos in the wave pool, we headed over to the adjoining amusement park and fed the family. The nearby diner has a decent selection of, well, cheeseburgers or chicken fingers, salad, fruit, fries and onion rings.</p>\n<p>Lots of stuff that the kids like.</p>\n<p>Since we have four &quot;dining meals&quot; to go along with the gold entry passes, it makes things more worth it to eat a couple of meals there.</p>\n<p>But, good grief am I shockingly sore.</p>\n<h3 id=\"link-dump\">Link dump <a class=\"direct-link\" href=\"#link-dump\">#</a></h3>\n<p>I don't know how much I'll have for the weekly link dumpage, but here we go!</p>\n<ul>\n<li>\n<p><a href=\"https://github.com/mayank99/11ty-jsx-deno\">mayank99 11ty jsx and tsx template</a><br>\nI'm not really a huge fan of jsx style templating, but I can certainly appreciate the work that others have put in.</p>\n</li>\n<li>\n<p><a href=\"https://www.evalapply.org/posts/clojure-web-app-from-scratch/index.html\">Aditya Athalye - Clojuring the web application stack: Meditation One</a><br>\nI haven't read all of this one, but I'm looking forward to going through it all. I love clojure, and I like trying to write apps and web apps with it</p>\n</li>\n<li>\n<p><a href=\"https://www.analog.cafe/r/a-functional-lego-camera-kit-lego-zh1-i9j8\">Zung Hoang - LEGO camera that works!</a><br>\nAs an <em>adult fan of LEGO</em>, I love this <strong>a lot</strong>.</p>\n</li>\n</ul>\n<p>All right, I'm gonna call that a night!</p>\n<p>Take care, till next time.</p>\n<p>This is post 32/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-25T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/upgrades-and-accomplishments/",
      "url": "https://shanewrogers.lol/posts/upgrades-and-accomplishments/",
      "title": "Upgrades and accomplishments",
      "content_html": "<p>Some days you just feel like you got at least one thing accomplished.</p>\n<p>Today is one of those days.</p>\n<p>This morning was good, upgraded one of our development applications to the latest vendor patch. The super awesome thing about this being that as of the middle of last week said update was not available....though it probably should have been. Given the name of the patch and all is from <em>last month</em>.</p>\n<p>Sigh.</p>\n<p>Then, I was able to get some simple documentation done for our users. Granted, I think that we all know that it matters not how well said documentation is written, it's not gonna be good enough.</p>\n<p>Additionally, got some requests fired off to another vendor.</p>\n<p>Nifty.</p>\n<p>Tomorrow is another day. The plan for noonish is to upgrade the same application previously mentioned, but in the test environment.</p>\n<p>It is <strong>so nice</strong> actually having both DEV and TEST.</p>\n<p>I'm not anticipating any issues, I think I've got this down to a science.</p>\n<p>Till next time!</p>\n<p>This is post 31/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-21T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/not-a-day-late-nor-a-dollar-short/",
      "url": "https://shanewrogers.lol/posts/not-a-day-late-nor-a-dollar-short/",
      "title": "Not a day late nor a dollar short",
      "content_html": "<p>I would say that I'm a day late with my post, but then than would imply some sort of contract between myself and the reader. I'm pretty sure that we are all aware that there is no such thing here. Ha.</p>\n<p>Last week I did go ahead and get a pre-order in for <a href=\"https://io.mwl.io/@mwl\">Michael W Lucas'</a> new book on <em>Run Your Own Mail Server</em>. The ebook has already been delivered and I'm very much looking forward to flipping through the paperback when it arrives. I had considered picking up the hardback, but that cost is a little more difficult to justify.</p>\n<p>I don't necessarily intend to run my own mail server from scratch, but you never know. I do, however, currently run a mail server via yunonost and have in the past used mail-in-a-box, which is very nice as well.</p>\n<p>They are mostly just toy or hobby servers in my case though.</p>\n<p>Now that the kiddos are in school and it's super quiet during most of the day, I've been more able to take some time to get out and walk during the mid day once again.</p>\n<p>Related to an earlier post of mine, these are not exactly mind clearing excursions, but moreso a way to get active once again.</p>\n<p>Currently my average is right around the fifteen minute minute mile, or just below. I want to get faster, and once I'm super comfortable with my progress I will attempt to jog it.</p>\n<p>All for my goal to, possibly, maybe, run a 5K.</p>\n<p>Today's walk was pretty good, I changed my route up quite a bit and made a much larger circuit. Although it didn't actually make much of a difference in the distance, very negligible.</p>\n<p>Anyhow. That's what I've got, I think I've worked on this entry long enough now. It's been sitting for a couple of days.</p>\n<p>This is post 30/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-19T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/not-so-competitive-for-success/",
      "url": "https://shanewrogers.lol/posts/not-so-competitive-for-success/",
      "title": "Not so competitive for success",
      "content_html": "<p>There are a couple of things that I've recently realized about myself.</p>\n<p>One of them is something that I'm absolutely terrified about.</p>\n<p>Another is just a quirk, an interesting tidbit about me that I hadn't fully recognize before.</p>\n<p>First - in some ways success terrifies me.</p>\n<p>Second - while I'm about the least competitive person that I know, I'm always extremely competitive against (with?) myself.</p>\n<h3 id=\"item-the-first\">Item the first <a class=\"direct-link\" href=\"#item-the-first\">#</a></h3>\n<p>I'm sure that I'm not the only person out there that is terrified of something turning out to be successful. Whatever that something might be.</p>\n<p>Whether it's putting myself out there when looking for employment, for example, I have that fear not of <em>what if I get denied</em> but of <em>what if I get approved?</em></p>\n<p>Then there are social situations. This might, or might not, have just as much to do with being introverted as well, though.</p>\n<p>Let us say that I were to go looking for some kind of connection. Platonic or otherwise, it makes no matter. Frankly, I'm terrible at small talk. I've been told that I'm a competent communicator, but that's not necessarily for me to decide.</p>\n<p>I don't know how to make friends any more. It's tough.</p>\n<h3 id=\"item-the-second\">Item the second <a class=\"direct-link\" href=\"#item-the-second\">#</a></h3>\n<p>I have never been competitive.</p>\n<p>Ever.</p>\n<p>I was basically forced into playing team sports when I was a kid (granted, T-ball was fun - ha). Baseball. Basketball. Football.</p>\n<p>I could actually pitch with either left or right handed. Couldn't do it now to save my life, but it was a thing I was capable of.</p>\n<p>I never liked any of it though.</p>\n<p>Probably didn't help that all of the teams I was on stunk. But that's not relevant.</p>\n<p>I was able to come to the conclusion the other day that the only person I compete with, in any way, is myself.</p>\n<p>And it does not allow me to relax. Ever.</p>\n<p>Take keto, for example. When we started on keto five years ago I dove into the deep end. Got an app and basically <em>gamed the heck out of it</em>. I would try to see just how few carbs I could do compared to all the other users of the app. Routinely I fell into the top tier and could easily go less than 5 to 7 net carbs a day. Logging everything.</p>\n<p>I would go to sleep at night super stoked to get up in morning to see how much weight has fallen off. Quite often it would be a pound or so.</p>\n<p>Was it safe? Not really. But it was my addiction, that self competition.</p>\n<p>Another example would be when I take my noon walks.</p>\n<p>I would imagine that when most people take walks it helps to clear their minds for the time ahead.</p>\n<p>Yeah, that's not how my head works.</p>\n<p>My oh my how I wish it did.</p>\n<p>Nope, I have this constant beat that runs through my mind: <em>one, two, three, four, one, two...</em> On and on and on.</p>\n<p>I have the need to push myself, quicker and quicker. Finish strong! I tell myself.</p>\n<p>I matters not if I've got music in my ears or listening to an NPR podcast. Same story.</p>\n<p>Why can't I just relax?</p>\n<p>This is post 29/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-15T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/smooth-days/",
      "url": "https://shanewrogers.lol/posts/smooth-days/",
      "title": "Smooth days",
      "content_html": "<p>The first day of school for the kiddos is in the bag!</p>\n<p>Everything would seem to have gone nice and smooth, although it's not that much is actually done during the first day.</p>\n<p>I have to consider the fact that all of the kids really enjoy school, which does make things so much easier.</p>\n<p>Granted, the majority of them are teenagers (more or less) so all is not peachy and rosy. Sometimes just getting the older ones up and about can be quite the chore.</p>\n<p>But, I will most certainly take that little inconvenience over having a house full of kids that want nothing to do with school.</p>\n<p>Blessings counted and duly noted.</p>\n<h3 id=\"other-things-that-went-smooth\">Other things that went smooth <a class=\"direct-link\" href=\"#other-things-that-went-smooth\">#</a></h3>\n<p>Today has been kind of a day to dread for me. Two meetings that center around a project that has my anxiety levels beyond maxed out.</p>\n<p>We are moving from one &quot;top tier, best in class&quot; system (brought to you by Atlassian) to another....which isn't quite as user friendly.</p>\n<p>For both service desk (help desk ticketing) and project management.</p>\n<p>The help desk side is fine. Whatever.</p>\n<p>The project side. Could use a bit of <em>TLC</em>.</p>\n<p>It's going to require a bit of a rethink in the way we use the software.</p>\n<p>But, even the contact that we were able to work with today realizes and concedes some of the shortcomings.</p>\n<p>How fantastically refreshing.</p>\n<p>Still, it's not gonna alleviate a lot of the pushback from staff that I'm anticipating.</p>\n<p>Still not looking forward to it.</p>\n<p>This is post 28/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-14T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/the-day-after/",
      "url": "https://shanewrogers.lol/posts/the-day-after/",
      "title": "The Day After",
      "content_html": "<p>Whew, one day post birthday and one more on the books.</p>\n<p>For myself, I consider my birthday to be just another day. I can't say that I really care how the day goes, one way or the other. I would assume, like most other adults my age - it's just another day.</p>\n<p>I'm 47 as of yesterday. It's not a milestone year, just another step in the path.</p>\n<p>I don't feel 47. It's no different to me than, say 42 or 45.</p>\n<p>It's kind of surreal, if I were to say it was anything.</p>\n<p>When you're a kid, you don't really think of middle age. It's just something that you don't really see yourself being.</p>\n<p>Then, all of a sudden, your trying to put things into perspective. I try to place myself into my father's mindset and shoes and whatever when he was my age. How things were back then.</p>\n<p>How things have changed.</p>\n<p>I'm sure there's a word for the way I think, the way I feel.</p>\n<p>Ah well.</p>\n<h3 id=\"b-day-stuff\">B-Day Stuff <a class=\"direct-link\" href=\"#b-day-stuff\">#</a></h3>\n<p>The day before my birthday, we made pizza for the kiddos so the wife and I could get out and have a good dinner. I guess by good, I mean expensive.</p>\n<p>Well, of course it was good. We went out to a local fish house and raw bar. Big plate of broccolini and a delicious Greek salad with some of the sweetest cherry tomatoes we'd ever had. Then a large plate of oysters, shrimp, lobster tail and snow crab. Pretty good.</p>\n<p>Yesterday, we went to Worlds of Fun. Probably not the best idea as it was super busy. Gotta love lines. We were there maybe six hours and my eldest twin and I only rode three things. We've got passes, though, so we'll go back eventually.</p>\n<p>Today, we are just relaxing. New school year shoe purchases and mowing the lawn.</p>\n<p>Tomorrow, while not the first day of school, is close enough that the flurry will commence. I'm a little anxious about it all, the mornings are going to be really hectic around here.</p>\n<h3 id=\"link-dump\">Link dump <a class=\"direct-link\" href=\"#link-dump\">#</a></h3>\n<ul>\n<li><a href=\"https://blog.smithsecurity.biz/hacking-the-scammers\">https://blog.smithsecurity.biz/hacking-the-scammers</a><br>\nDEFCON is going on currently, and I love a good tale. I imagine that most of us have received those stupid &quot;USPS&quot; delivery package text messages. Here, Grant tells the tale of, ahem, someone taking things into their own hands.</li>\n<li><a href=\"https://100go.co\">https://100go.co</a><br>\nI don't really write in Go, but I'd like to. This seems like a decent list of what to avoid, perhaps.</li>\n<li><a href=\"https://wedistribute.org/2024/08/decentralized-social-icons\">https://wedistribute.org/2024/08/decentralized-social-icons</a><br>\nI don't think I could explain it any better than they could: <em>It's like Font Awesome, but for Platforms &amp; Protocols</em></li>\n<li><a href=\"https://sfwriter.com/ws7.htm\">https://sfwriter.com/ws7.htm</a><br>\nI'm more of an Emacs user, but I can certainly appreciate Wordstar. Here is an <strong>awesome</strong> package put together by author Robert J Sawyer.</li>\n</ul>\n<p>With that, I think we're good.</p>\n<p>This is post 27/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-11T20:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/five-years-keto/",
      "url": "https://shanewrogers.lol/posts/five-years-keto/",
      "title": "Five years keto",
      "content_html": "<p>It's funny how some things work out, you know?</p>\n<p>Yesterday was a milestone post for my bloggy journal thing, whatever one wants to refer to this site as, and today is a life changing milestone in that today is the fifth anniversary of the day that I started keto.</p>\n<p>Five years ago we made huge lifestyle changes. We were both sick and tired of being obese and wanted to see our kids grow up and have lives of their own.</p>\n<p>Five years ago we decided that we wanted to model better behavior for our kids, at least as far as nutrition choices were concerned.</p>\n<p>Five years ago I was well on my way to diabetes I'm sure of it. On my way to an early death at least.</p>\n<p>Five years ago I weighed over 330 pounds. I hated how I looked. I hated how I felt. I hated that I couldn't sleep without a CPAP.</p>\n<p>Now, while most of the physical stuff has changed and I'm significantly in a healthier state, I'm still working on my mental health. Though not as actively as I did on my physical body, I'll admit.</p>\n<p>But, at least now I can select from a wider variety of clothing while I do it.</p>\n<p>This is post 26/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-08T19:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/updates-of-life-and-systems/",
      "url": "https://shanewrogers.lol/posts/updates-of-life-and-systems/",
      "title": "Updates of life and systems",
      "content_html": "<p>I suppose this is the first milestone that I've reached for the 100 Days To Offload challenge - post number 25!</p>\n<p>As those who have read many of my previous posts (and, thank you for that!) you may know that I have struggled of late with some aspects of my keto lifestyle. Not so much the keto part, per se, so much as the amount of calories that I haven't been logging and keeping account of.</p>\n<p>In other words, snacking.</p>\n<p>I was standing in the kitchen earlier today, having toasted a slice of &quot;keto friendly&quot; bread (the heel, if you're curious), buttered and cinnamon &quot;sugar&quot; topped....and stared at it.</p>\n<p>I took a bit of a pause at that moment: <em>did I really want to eat this</em>? I've gone from thinking that I could easily do a 24 hour fast (perhaps even going longer for more frequent timing), to this undesirable feeling that I've got to snack.</p>\n<p>It's not even that I feel hungry.</p>\n<p>I used to eat out of boredom, maybe that's what I'm going back to? I need to get back in the game, my head is just a bit on the spacey side.</p>\n<p>I need to be able to look in the mirror again and be proud of what I've accomplished.</p>\n<p>It's a strange feeling.</p>\n<h3 id=\"in-the-world-of-work\">In the world of work <a class=\"direct-link\" href=\"#in-the-world-of-work\">#</a></h3>\n<p>I was able to get one new task taken care of earlier today. While nothing earth shattering, it was an important item that needs to be done and it makes me a little more useful - not a bad thing.</p>\n<p>Now, I'm getting to work late/after &quot;normal&quot; hours to essentially babysit another application upgrade.</p>\n<p>Not that I mind, it should be uneventful. But you never know.</p>\n<p>The main fun with this type of work is that you get to do it while everybody else in the house is home and I'm downstairs in the &quot;dining room&quot;.</p>\n<p>At least all I should have to do is monitor some CPU cycles then re-enable some schedules.</p>\n<p>....and that went off without a hitch.</p>\n<p>Until next time, we shall leave it at that.</p>\n<p>This is post 25/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-07T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/after-the-storm/",
      "url": "https://shanewrogers.lol/posts/after-the-storm/",
      "title": "After the Storm",
      "content_html": "<p>Talk about one heck of a week.</p>\n<p>We had a pretty standard storm come through the area on Wednesday night, with the added benefit of up to 80 mile per hour winds at the head of it. Lots of trees down. Lots of power lines down. We were without power for just under 24 hours here, though some unfortunately people were much longer.</p>\n<p>If it's something that we take for granted, it's electricity. Thankfully our home is decently insulated, so the downstairs remained in the lower mid 70s temperature wise. The upstairs, not so much.</p>\n<p>We were gonna have the kids sleep downstairs the second night, but that was not necessary. The thought had occurred to get a couple of hotel rooms, but we didn't really want to spend the near $300 that would have ran us.</p>\n<p>It was certainly very nice when power was restored.</p>\n<h3 id=\"linkdump\">Linkdump <a class=\"direct-link\" href=\"#linkdump\">#</a></h3>\n<p><a href=\"https://irreal.org/blog/?p=12352\">Getting Disappeared</a><br>\nSome preaching to the choir about getting off of Google (et al) services. I'd love to do this myself as well, and have been looking at some alternative solutions.</p>\n<p><a href=\"https://sarah-savage.com/makefiles-make-life-easier/\">Makefiles make life easier</a><br>\nSarah Savage discusses how she utilizes the ever useful and humble makefile.</p>\n<p><a href=\"https://www.brycewray.com/posts/2023/03/time-move-on-nunjucks/\">Is it time to move on from Nunjucks?</a><br>\nNow that WebC is available, is it time to look towards something besides Nunjucks?</p>\n<p>That's all that I've got for now. Until next time.</p>\n<p>This is post 24/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-04T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/new-years-of-a-different-sort/",
      "url": "https://shanewrogers.lol/posts/new-years-of-a-different-sort/",
      "title": "New years of a different sort",
      "content_html": "<p>The new school season is nearly upon us once again.</p>\n<p>We will have three kiddos back in the same building, at least for a little while, with but two grades between them. Not that they don't always have, or that they won't always have two grades between them. Sometimes we forget that the youngest of these three is the <em>youngest</em> of the three - this kiddo has seemed for some time now to be the more mature of them all. Always a surprise to me and also I must admit that I am not overly certain that I am deserving of such amazing children.</p>\n<p>One of the twins will be spending the first part of some days at another school taking higher level math courses. Similar to what the youngest kiddo was going through last year, when he bussed from the elementary school to the middle school for his math course. I am more scared for the elder twin, though, than I was for the younger brother. Probably has to do with the fact he'll be going into a High School, opposed to a middle school.</p>\n<p>I think that everybody will do fine, but as a parent I think I'm allowed to feel that fear for my kiddo.</p>\n<p>We also find ourselves near the time of open enrollment for insurance.</p>\n<p>This year, I'm definitely looking forward to making some changes there. My wife has recently - this is her third week - started working at the same employer as I. Which means that we'll get to save a not insignificant amount of money on insurance! She will take over her own insurance plan and payment, using the same provider. I will continue to cover the kids and myself. All in, we look to save about $500 a month for coverage.</p>\n<p>It is insane.</p>\n<p>I have slowly been working my way through <a href=\"https://thebookofelsewhere.com/\">the book of elsewhere</a>, taking a bit of a break from The Expanse books. The hope is that I can finish reading this before my hardback copy of the BRZRKR graphic novel arrives, which should arrive early October I think. Plenty of time, right?</p>\n<p>This is post 23/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-29T15:00:10+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/some-recent-binges/",
      "url": "https://shanewrogers.lol/posts/some-recent-binges/",
      "title": "Some recent binges",
      "content_html": "<p>We've been watching a lot of streaming shows over the past couple of days.</p>\n<p>I didn't normally go in for the binge mentality of how things seem to be these days, although I haven't ever been against waiting things out for a few weeks to let the (old school) DVR (or, even older Tivo) build up a few weeks worth of episodes to watch.</p>\n<p>I still prefer to not watch them all at once.</p>\n<p>Still though, it does happen.</p>\n<p>Yesterday we watched the entirety of <a href=\"https://m.imdb.com/title/tt16283824/\">Eric</a> on Netflix. It was a pretty decent tale, with a handful of threads that wove together okay. I think that it could probably have been cut down by an hour/an episode, but all things considered it was enjoyable.</p>\n<p>Today we finished up with Netflix's <a href=\"https://m.imdb.com/title/tt14403178/\">Beef</a>. We had watched the first episode the other day, and worked out way through the rest of them today. I really like all of the A24 stuff that I've seen, and this was not too bad either. Granted, the overall story is just insane enough...but then so was Eric.</p>\n<p>So far as other television stuff, I've got my YouTube TV set to record <em>all the Olympics</em> stuff, so I'll watch some of that in time. I'm more of a Winter fan than Summer, though.</p>\n<p>Of course we're also watching <a href=\"https://m.imdb.com/title/tt11198330/\">House of the Dragon</a> and <a href=\"https://m.imdb.com/title/tt1190634/\">The Boys</a>, as one is aught to do.</p>\n<h3 id=\"link-dump\">Link Dump <a class=\"direct-link\" href=\"#link-dump\">#</a></h3>\n<p>I think I can come up with a small handful of links this week, so let us see what's out there.</p>\n<p><a href=\"https://kansasreflector.com/2024/07/28/spyware-turned-this-kansas-high-school-into-a-red-zone-of-dystopian-surveillance/\">Spyware turned this Kansas high school into a ‘red zone’ of dystopian surveillance</a> We had our own little run in with this particular piece of software last year as well, and I can't really honestly say that I'm a fan. I get it, but I don't care for it.</p>\n<p><a href=\"https://howardism.org/Technical/Emacs/literate-writ-large.html\">Literate Programming Writ Large</a><br>\nHoward Abrams is an excellent resource on literate programming in emacs and org mode, this article continues on with more great information along that line.</p>\n<p>....and that, as they say, is that.</p>\n<p>Until next time my friends.</p>\n<p>This is post 22/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-28T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/successful-updates-et-al/",
      "url": "https://shanewrogers.lol/posts/successful-updates-et-al/",
      "title": "Successful updates et al",
      "content_html": "<p>It's been a pretty successful day thus far.</p>\n<p>Upgraded one of our large test application servers with no issues. Insofar as application patches go, it's one of the easier ones that we've got. Not quite of the &quot;click, click, click&quot; and FIN variety, but very close. It does require a certain amount of babysitting, which is completely and totally obnoxious.</p>\n<p>I did get a start on reading my newest book, though I'm going to admit to not making it all that far yet.</p>\n<p><img src=\"https://cdn.some.pics/swrogers/66a14a69306c3.jpg\" alt=\"Photo of the book, &quot;the book of elsewhere&quot; by the authors Keanu Reeves and China Miéville. Next to the book is my blue coffee canister.\"></p>\n<p>On the personal way of life stuff (isn't that what this whole journal thing is, though?) I'm attempting to get my mindset back into the keto game. That doesn't mean that I haven't continued to remain in the keto lifestyle all this time - I have. What I've not done is be more strict/stringent on logging everything I consume, which leads to laziness and unnecessary snacking.</p>\n<p>My weight is slowly sneaking up past that 190 pound entry, way too close to 200 for my taste. Things are not helped along by the fact that we have too much prepackaged junk in the house, sugar free slash keto &quot;friendly&quot; or not. I shall be getting back on that wagon, full speed.</p>\n<p>This is post 21/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-24T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/problems-solved-and-trilogies-read/",
      "url": "https://shanewrogers.lol/posts/problems-solved-and-trilogies-read/",
      "title": "Problems solved and trilogies read",
      "content_html": "<p>It's been a couple of days since my last update, so obviously there must have been basically nothing going on at all.</p>\n<p>Some progress was made in the work/vendor department though, from Friday and on through the weekend. Mainly in that the patch scheduling foobar was taken care of.</p>\n<p>All that took was opening up to two technical support requests. Sigh.</p>\n<p>One of which was really only commented on by the vendor representative once. <strong>Once.</strong> I'm not gonna count the comment that was entered <em>after</em> the second SR was opened and resolved.</p>\n<p>Once that problem was taken care of, we were off to the races on, well, yet another problem. All of which is somewhat related to every tool being moved to someone else's comput....er...cloud.</p>\n<p>I will give them props, though, because at least this particular cloud took us replacing some old arse java app. So, progress. Yay?</p>\n<p>On the home front side, we've got some appointments tomorrow that will need to get taken care of.</p>\n<p>The lawn, yeah, it didn't get taken care of this weekend nor today. I'm hopeful that I can tackle that tomorrow as well.</p>\n<p>Otherwise my poor, poor battery powered mower will not make it.</p>\n<p>I'm also closing in on a third of the way through reading The Icewind Dale trilogy to my kiddos. Good stuff and it's my second time through this series.</p>\n<p>This is post 20/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-22T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/some-questionable-past-choices/",
      "url": "https://shanewrogers.lol/posts/some-questionable-past-choices/",
      "title": "Some Questionable Past Choices",
      "content_html": "<p>It's crazy the stuff that I have packaged up and toted along with me throughout all of my moves.</p>\n<p>What's even crazier are the items that I <em>didn't</em> bring along with me, for some reason or another.</p>\n<p>Items like video games. Lots of cartridges and disks, cases and manuals.</p>\n<p>Games that I wouldn't mind playing again on my SEGA Genesis/SEGA CD/32X (yeah, I had the SEGA Stack....) or Super NES.</p>\n<p>But.</p>\n<p>There's always a &quot;but&quot;, isn't there?</p>\n<p>Do I actually <em>have</em> any of those here with me? No, of course not.</p>\n<p>I do have my boxed Dreamcast and some high profile games, but not the older stuff.</p>\n<p>Sadly, I'll probably never see those things again, either. Last year I made the couple hour trek back to my childhood home, with the hope that I could bring some stuff back.</p>\n<p>My father (whom I love immensely) had moved an entire home full of <em>stuff</em> into a couple of self built storage buildings.</p>\n<p>I was heart broken. Having seen a couple of the figures that I still could find completely covered in dust and dirt and everything, and some electronics just in tatters...the weather had done them no favors.</p>\n<p>Of the items that I was hoping to find (including multiple unopened, complete on card figures) was a complete in box Neo Geo AES with two sticks, memory cards and six games (I think). I can recall Magician Lord, Baseball Stars, 2020 Baseball, Samurai Showdown, I can't recall the others. I'd purchased the whole package over 20 years ago on eBay for less than $600. Good luck trying to find anything similar these days for twice that. This gutted me.</p>\n<p>Completely.</p>\n<p>These days, as I attempt to go through a boatload of boxes, I just have to ask myself: Why would you bring bits and pieces of this stuff, and not the actual decks that make these things work?!</p>\n<p>Gah!</p>\n<p>This is post 19/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-18T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/vendors-gonna-vendor/",
      "url": "https://shanewrogers.lol/posts/vendors-gonna-vendor/",
      "title": "Vendors Gonna Vendor",
      "content_html": "<p>There are a handful of things that I don't understand.</p>\n<p>For one, why can't certain vendors let their customers know that the product that they depend on for their day to day usage was not actually patched to the current patch level on the scheduled time.</p>\n<p>Not only was the time scheduled, but it was of course scheduled by the vendor, seeing as how the customer is basically at the mercy of said vendor.</p>\n<p>Not only did the customer (us) have to check to ensure that the product was patched, but then the customer (us, again) has to contact <em>big vendor</em> support to ask why it wasn't patched.</p>\n<p>Why can't they just pop some kind of email notification that says it was either successful or not?</p>\n<p>Then if not - what the plan of action is?</p>\n<p>Yeah. We asked this question on Monday.</p>\n<p>I was out sick on Tuesday.</p>\n<p>The <strong>only</strong> response we've had thus far was an incorrect notice that none of our instances have been patched at all.</p>\n<p>We have three instances: one each for development, testing and production.</p>\n<p>Our development instance had already been patched, as scheduled, so I got to let the vendor know that...um, no, I don't believe that's correct please don't re-patch.</p>\n<p>Sigh.</p>\n<p>Anyhow - now the vendor has let us know that it's time to board the patching train because they've scheduled the production instance for updating next week, when we haven't had a chance to do <em>any</em> testing in the test instance. Which is less of a playground than dev.</p>\n<p>It's beyond infuriating.</p>\n<p>Welcome to the cloud.</p>\n<p>This is post 18/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-17T17:22:01+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/sunday-stuff-and-link-dumpage/",
      "url": "https://shanewrogers.lol/posts/sunday-stuff-and-link-dumpage/",
      "title": "Sunday stuff and link dumpage",
      "content_html": "<p>It's Sunday. Whatever that means.</p>\n<p>The end of the weekend and the beginning of a new week.</p>\n<p>Currently we're just taking in the time to watch the youngest play in a local indoor jungle gym. It's a friends birthday party for the little.</p>\n<p>So far as Sundays go, it's actually been a moderately busy one.</p>\n<p>The boys and I got haircuts. We went to the store.</p>\n<p>Spent some time at the local splash pad. Definitely a decent way for the little to cool off, but still.... really hot.</p>\n<p>Drove around town for a bit, mainly due to having forgotten when the party started. Ha.</p>\n<p>Now, it's all about figuring dinner out. Although I think we'll let the older kiddos fend for themselves with leftovers and pasta.</p>\n<h3 id=\"link-dump\">Link Dump <a class=\"direct-link\" href=\"#link-dump\">#</a></h3>\n<p>I've been a bit lapse on this listing, but then I'm just not too certain that what I've always got is worth it.</p>\n<p><a href=\"https://spectrum.ieee.org/shipt\">https://spectrum.ieee.org/shipt</a><br>\nShipt's pay algorithm screwing people over. The gig workers weren't gonna have it, so they took things into their own hands to crack open that black box.</p>\n<p><a href=\"https://www.axios.com/2024/07/08/johns-hopkins-bloomberg-donation\">https://www.axios.com/2024/07/08/johns-hopkins-bloomberg-donation</a><br>\nJohn's Hopkins medical school to be free for most students. This is just amazing. An excellent example of the good that can be done via philanthropy.</p>\n<p><a href=\"https://micro.webology.dev/2024/07/12/duckdb-may-be.html\">https://micro.webology.dev/2024/07/12/duckdb-may-be.html</a><br>\nJeff Triplett has a neat example using DuckDB to pull metadata from YouTube.</p>\n<p><a href=\"https://whynothugo.nl/journal/2024/06/13/ssh-as-a-sudo-replacement/\">https://whynothugo.nl/journal/2024/06/13/ssh-as-a-sudo-replacement/</a><br>\nSSH as a replacement for sudo. This is an interesting idea, certainly with a few hoops. I wonder about setting this up...?</p>\n<p><a href=\"https://help.vivaldi.com/desktop/tools/import-and-export-browser-data/\">https://help.vivaldi.com/desktop/tools/import-and-export-browser-data/</a><br>\nMainly for my future use, lots of imports and exports for Vivaldi.</p>\n<p>This is post 17/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-14T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/it-is-mesh-at-least/",
      "url": "https://shanewrogers.lol/posts/it-is-mesh-at-least/",
      "title": "It is mesh at least",
      "content_html": "<p>Sometimes I wonder how in the world I managed to write a new post every day during the previous challenge that I subjected myself to.</p>\n<p>This week has thus far been fairly non eventful. Boredom is a good thing sometimes.</p>\n<p>Last week I made a purchase that I almost regret doing. Even though it's an item that gets daily use, and I'm in it probably eight plus hours a day, which kind of makes it a necessity, I'm not a hundred percent happy with it.</p>\n<p>Obviously it's some kind of work from home item. It's the <a href=\"https://www.staples.com/union-scale-flexfit-hyken-ergonomic-mesh-swivel-task-chair-black-un59460/product_990119?cid=EM:ordconfrm::sku&amp;\">Hyken Mesh Chair</a> from Staples. The one thing that I'm not happy with is the &quot;headrest&quot;.</p>\n<p>Note the quotes there.</p>\n<p>As it's not super adjustable, this headrest comes all the way up to in between my shoulder blades.</p>\n<p>Unless I crouch down.</p>\n<p>Which I am not going to do.</p>\n<p>Fortunately I can remove it, which I'll probably do.</p>\n<p>Other than that, it's an okay chair for those who don't have or can't afford to get the kick arse Herman Miller Aeron. Sigh.</p>\n<p>Ah well, back to the grind!</p>\n<p>This is post 16/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-11T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/first-day-back/",
      "url": "https://shanewrogers.lol/posts/first-day-back/",
      "title": "First Day Back",
      "content_html": "<p>First day back is now in the bag!</p>\n<p>Not nearly as bad as those times when I take two weeks off (FSM knows that those both make me want to never take another vacation <strong>and</strong> never go back to work again) but there was still a bit of cleanup and catch up to do.</p>\n<p>Some of the cleanup involves coming back in to work post fiscal year end, when it's not necessarily been completely opened back up. Not a huge deal, but still needs to be taken care of.</p>\n<p>There is also the metric arse ton of email to sift through. Although I'll be honest and say that I do continue to keep my work email synching through my phone and delete most of the crap that doesn't pertain to me.</p>\n<p>Sue me. I don't like surprises.</p>\n<p>What was best today, though, was not one but <em>TWO</em> Monday morning meetings.</p>\n<p>Back to back.</p>\n<p>Right up there with Friday afternoon meetings with my favorites.</p>\n<p>Fortunately these are extremely rare for me and Mondays are generally pretty tame.</p>\n<p>Well, I'm thinking it's getting close to dinner time and I haven't yet figured out what to feed the kids - I probably ought to take that under consideration.</p>\n<p>Until next time.</p>\n<p>This is post 15/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-08T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/post-fourth-post-vacation/",
      "url": "https://shanewrogers.lol/posts/post-fourth-post-vacation/",
      "title": "Post-Fourth Post-Vacation",
      "content_html": "<p>Does Sunday count as a vacation day, ergo being the last day of a vacation?</p>\n<p>I can't say that I've ever actually counted the weekends in my vacation, but I suppose they do.</p>\n<p>Tomorrow is return to work day. We'll put &quot;return&quot; in quotes, seeing as I work from home and it's not like we actually left home over the last week.</p>\n<p>There were no plans set out for the week, so nothing was accomplished. But on the other hand, seeing as there were no plans to do anything I can't be disappointed that nothing got done!</p>\n<p>Win win for everybody on that one.</p>\n<p>The family did get out for the Fourth of July (non) event that was held in town. There was music (not that great), craft booths (not that great), food trucks (probably decent, but not our kind of nutrition), and a drone show.</p>\n<p>Oh, and a kids play area. Which was fun for the young one.</p>\n<p>We went for less than an hour and walked around to see what was what. Finding things not worth it, we left to go get the kids some ice cream cones.</p>\n<p>We did go back for the drone show, which was supposed to start at 9:45.</p>\n<p>Then it was supposed to start at 10:00. Then 10:30. 10:45. Then it was called at 11:00.</p>\n<p>At which time it started raining.</p>\n<p>Evidently, the vendor was having issues getting the show code loaded onto the 200 drones via their Verizon Wireless hotspot. They shoulda had T-Mobile. Ha.</p>\n<p>The weather had stunk all day, so they weren't able to do the pre-work earlier, either.</p>\n<p>Now, the city has a $30,000 credit for next year.</p>\n<p>We were really looking forward to seeing how it went, so I guess we'll check it out next year.</p>\n<p>This is post 14/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-07T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/fourth-of-july-post/",
      "url": "https://shanewrogers.lol/posts/fourth-of-july-post/",
      "title": "Fourth of July Post",
      "content_html": "<p>Happy Fourth of July, for those that celebrate.</p>\n<p>Yet another Holiday here in the States where we, basically, get to set our wallets on fire.</p>\n<p>Quite literally in some cases.</p>\n<p>I will admit that this is one of my favorite days of the year.</p>\n<p>It is currently just after 22:30 Central time, we just finished up with our small handful of fountains and sprinklers. The kids seemed to enjoy themselves, and yet another year with no need to send anybody to the emergency room is a win in my book.</p>\n<p>This was also one of the cheaper years that we've managed to get away with, with a bill only just shy of two hundred.</p>\n<p>Yeah, we totally didn't need to spend the money. But think of the kids! Especially the six year old who lives for the smoke bombs.</p>\n<p>Still more than I'd like to spend for an hours worth of entertainment.</p>\n<p>In other news, we will be back to a double income family soon. Super nice.</p>\n<p>Until next time!</p>\n<p>This is post 13/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-04T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/the-next-day/",
      "url": "https://shanewrogers.lol/posts/the-next-day/",
      "title": "The Next Day",
      "content_html": "<p>First day of vacation and I'm already sick and tired of it. <em>Note: it's now the second day, but my feelings haven't changed much here.</em></p>\n<p>Maybe one of these times I can actually plan to go somewhere or do something, get away from things.</p>\n<p>I just don't get it.</p>\n<p>These things should be enjoyable, right?</p>\n<p>Does it help that most of the people - it seems - in this home are depressed? I'm gonna go with a &quot;No sir, not one bit&quot; on that one my friends.</p>\n<p>We've got one adult who is dealing with a loss of something that never should have happened in the first place (something that never should have to to fruition to have <em>been lost</em>, that is). Another adult dealing with their own family issues, which are by their nature spilling over into the home life. Kids who we are trying to keep from becoming depressed.</p>\n<p>I'm walking on eggshells around here, and it's extremely tiring.</p>\n<p>This is post 12/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-02T14:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/time-aplenty/",
      "url": "https://shanewrogers.lol/posts/time-aplenty/",
      "title": "Time aplenty",
      "content_html": "<p>What a week!</p>\n<p>Last week was quite a ride. The weekend hasn't been much different.</p>\n<p>I look through a few job listings, not only for my spouse but - potentially - for myself as well.</p>\n<p>Again, not that I'm looking to replace my current job, but perhaps more to supplement what I do have.</p>\n<p>As far as the spouse goes, well, sometimes I feel like I'm kind of limited. She is great with children and youths, not so much with peers.</p>\n<p>It's her perfectionism and drive to do things by the book. Which, in and of itself is not so much a bad thing.</p>\n<p>However, when you are around a new group of coworkers who have been doing things the same way for <em>years</em>, well, then that can be a little dicey.</p>\n<p>It's not always good to be that squeaky wheel. It gets greased, or it gets replaced.</p>\n<p>Not to mention the fact that fitting I to a new clique can be extraordinarily difficult.</p>\n<p>Another thing that makes things challenging is that I'm not the most patient teacher, I think. Especially when it comes to how basic computer applications work. I do understand that I should do better here, do more teaching rather than taking over and doing.</p>\n<p>There are a lot of jobs out there these days that require basic skills - not to mention even getting an application submitted. I get frustrated far too easily, sometimes.</p>\n<p>No matter what she does, though, I completely will be here to support.</p>\n<p>All things said, even hobbies can make some extra money. There have been plenty of ideas in this home, plenty of supplies have been purchased, now there is also an abundance of time.</p>\n<p>This is post 11/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-30T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/change-and-stock-in-trade/",
      "url": "https://shanewrogers.lol/posts/change-and-stock-in-trade/",
      "title": "Change and stock in trade",
      "content_html": "<p>I had something written up earlier that I was going to post, but as is often the case in life things change.</p>\n<p>Is it always for the best?</p>\n<p>I find that I am, for the first time in a very long time, contemplating the need to do one of two things: either procure a second income, or find another income.</p>\n<p>Neither of which is something that I desire to any degree.</p>\n<p>I like what I do and I like where I am.</p>\n<p>However. Something something life.</p>\n<p>Whatever.</p>\n<p>I guess it's time to take stock of what my abilities are and what I'm capable of.</p>\n<p>What a week.</p>\n<p>This is post 10/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-28T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/tighten-that-silver-lining/",
      "url": "https://shanewrogers.lol/posts/tighten-that-silver-lining/",
      "title": "Tighten that silver lining",
      "content_html": "<p>Now is the time to tighten the proverbial belts.</p>\n<p>We will very soon be down to a single income in the home. More or less. I do suppose that the older kiddo does have a paycheck, but he has his own set of problems to take care of.</p>\n<p>One really has to hope that this situation does not last longer than it needs to, and, perhaps, it can be used to open some doors for another opportunity.</p>\n<p>Like now there should be plenty of people hours available to work on getting the home straight for that in-home childcare plan that was mentioned previously.</p>\n<p>Is there a silver lining?</p>\n<p>This is post 9/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-26T18:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/non-events/",
      "url": "https://shanewrogers.lol/posts/non-events/",
      "title": "Non Events",
      "content_html": "<p>It has been a couple of uneventful days, which if I'm being honest is not such a bad thing.</p>\n<p>Work has been moving along at a nice steady pace, with some progress being made on the good old Team Dynamix front.</p>\n<p>On that, I shall say that my enthusiasm has been ever so tempered at this point. There does not seem to be a path forward for our department to be able to have the type of control that we would like, nor some of the project management features that some would hope for.</p>\n<p>We shall, however, make due.</p>\n<p>Next week will be an off week for me. Yet another week of vacation.</p>\n<p>Most people would be super stoked and excited about that, I'm sure, but if you're a reader of my past posts you might know that I'm not a fan.</p>\n<p>However, my wife also has next week off - so maybe we can get out and hit a local park or something with the kids. Take advantage of those uber expensive passes we have.</p>\n<p>What we really should do, though, is work on getting our extra bedroom set back up for the eldest kiddo. Along with the rest of the home. We are considering getting licensed by the State for an in-home childcare center. To do that will require a little bit of setup but totally worth it.</p>\n<p>Of course, I know for a fact what we'll <em>actually</em> do next week. Absolutely nothing. Apart from doing stuff with the kids for the Fourth of July.</p>\n<p>Here's to a good rest of the week.</p>\n<p>This is post 8/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-25T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/single-party/",
      "url": "https://shanewrogers.lol/posts/single-party/",
      "title": "Single Party",
      "content_html": "<p>When I was in middle school, in what now seems like half a million years ago, a friend and I started writing stories.</p>\n<p>We each had a single subject notebook and filled them with what were - to us anyhow, at the time - fantastically interesting tales.</p>\n<p>I can't recall what stories my friend had written about (and, sadly, cancer has taken him) but mine was some kind of   space opera mash up with robots and power suits and who knows what all else.</p>\n<p>I'm sure that it was all horribly juvenile, but it felt really grandiose to me at the time.</p>\n<p>My Mom even read what I had one at one point and did say that it was pretty good. Of course, as a parent you are a little biased.</p>\n<p>She was - is? - well read, however, and did encourage me to read a large variety of works. I still have that love of reading.</p>\n<p>There are far too many conversations going on in this house, I can not recall where I was going with any of these thoughts.</p>\n<p>Oh, yes. Writing. Write anything. I've seen a lot of posts from people recently who struggled to start writing, who thought that people would not want to read what they had to say.</p>\n<p>Does any of that matter? No.</p>\n<p>When writing for yourself, it matters not what your getting down. It doesn't matter if you think it's &quot;juvenile&quot; or otherwise uninteresting - you are writing for yourself.</p>\n<p>It matters not if my readership is a party of one.</p>\n<h3 id=\"the-link-dump\">The Link Dump <a class=\"direct-link\" href=\"#the-link-dump\">#</a></h3>\n<p>Now for the Sunday link dump.</p>\n<ul>\n<li><a href=\"https://wand3r.net/adding-a-reply-on-mastodon-to-each-post/\">Add a Reply on Mastodon Link</a> Brandon has a pretty good idea using a new feature of omg.lol's version perma-urls and redirects that I might see about adopting here.</li>\n<li><a href=\"https://michal.sapka.me/blog/2024/leaving-firefix-behind/\">Michal is looking for a new browser</a> what with all the ad (and ai, and -nauseam) nonsense that's going around these days, is there any wonder that people are looking to move on from the behemoths? I've tried nyxt, it's interesting and different, but I'm thinking I might move to Librewolf.</li>\n</ul>\n<p>I guess I didn't have much linkage for this week. I've just not been spending much time going down the rabbit holes lately.</p>\n<p>Until next time.</p>\n<p>This is post 7/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-23T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/some-works-of-art/",
      "url": "https://shanewrogers.lol/posts/some-works-of-art/",
      "title": "Some works of art",
      "content_html": "<p>I figured that today would be a good time to post something a little more lighthearted.</p>\n<p>So I present some of the artwork of my youngest kiddo, which is basically overtaking all of the free space of the fridge.</p>\n<p>Not that there is a problem with that, of course.</p>\n<p><img src=\"https://cdn.some.pics/swrogers/66764667ab663.jpg\" alt=\"Photo of children's artwork taking over a refrigerator\"></p>\n<p>This is post 6/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-21T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/food-and-weight-again/",
      "url": "https://shanewrogers.lol/posts/food-and-weight-again/",
      "title": "Food and Weight Again",
      "content_html": "<p>I know that I have previously written on my struggle to work on maintaining my weight, as well as some of the body and confidence issues that go along with that.</p>\n<p>We shall count today's journal entry as yet another one of those.</p>\n<p>Within the next two months, August 8th I believe, will the the fifth year milestone of living a keto lifestyle.</p>\n<p>Before that, I remember sitting in my office chair and watching these amazing transformation videos of people. It always felt a little hypocritical of myself when I did this. There I sat, three hundred thirty plus pounds, knowing that I would never be able to be one of those with a success story of my own.</p>\n<p>Within weeks of starting keto, I knew that I wanted nothing more than to just be down a hundred pounds after one year.</p>\n<p>Well, I like to say that I basically turned that whole change into a game: how large of a calorie restriction could I maintain, how close to zero net carbs could I average?</p>\n<p>I blew way past that hundred pounds loss within that year and was already very close to my current weight already.</p>\n<p>My lowest weight was in the 168 pound ballpark. I'm a six foot two plus guy, and I know for a fact that that was too low. I did not look good.</p>\n<p>I have slowly worked back up to low 190s. Insofar as health goes, I know that's perfectly acceptable.</p>\n<p>But. Mentally, it is not good enough for me. I want 180s. For my mind, where I'm at is just too close to 200. I don't want to be there again.</p>\n<p>So, I know that I dropped the weight (I don't like to say I <em>lost</em> it, because I really don't want to <em>find</em> it again) really quickly. Probably not super healthily either. However, I have managed in many ways to change my relationship with food.</p>\n<p>I never really ate my feelings. It was more out of boredom than anything. Now, I really try to enjoy the feeling of looking better and use the extra time to read or work on some other self development process.</p>\n<p>If I have missed anything at all during this life change, it's that my hair is no longer thick and composed of ringlets (think Weird Al hair). That's about the only thing I miss. But, it could be age related as well.</p>\n<p>Today has been a good day, thus far, when it comes to food. Here's to keeping on.</p>\n<p>This is post 5/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-20T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/power-or-lack-thereof/",
      "url": "https://shanewrogers.lol/posts/power-or-lack-thereof/",
      "title": "Power Or Lack Thereof",
      "content_html": "<p>What to say about today?</p>\n<p>Today is Juneteenth. This would be the first year that my place of employment has (I think...) provided those of us who are able to have the Holiday off, off. There are those who are declared as essential, so I would assume that they could have their Holiday moved, or just make the extra pay. I don't honestly know how that will work for this case.</p>\n<p>Me, being a white, caucasian, cis dude who is near half a century old at this point in his life...I can not help but just feel really kind of weird having this day off as a Holiday. Now, I absolutely do believe that it should be a Holiday, no doubt about that.</p>\n<p>It just feels strange for me, personally, to have the day out.</p>\n<p>Okay, that's about as political as I ever want to get.</p>\n<p>In other moments of not so much excitement, the power was off for an hour or so here.</p>\n<p>No idea what happened, but it did provide a moment to ponder and read a part of my newest book:</p>\n<p><img src=\"https://cdn.some.pics/swrogers/6671c7a543862.jpg\" alt=\"Photo of book &quot;Jonathan Strange and Mr. Norrell&quot; by Susanna Clark. First Edition, First printing, US Edition, Black Cover.\"></p>\n<p>I remember watching the series of this when it aired a few years ago and thought that it might make a good read.</p>\n<p>I was grateful to have found a good hardback copy of the first printing/first US edition for a really good price.</p>\n<p>Here's to eventually getting it finished!</p>\n<p>This is post 4/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-19T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/not-from-the-peanut-gallery/",
      "url": "https://shanewrogers.lol/posts/not-from-the-peanut-gallery/",
      "title": "Not From the Peanut Gallery",
      "content_html": "<p>I am notoriously difficult to purchase any kind of gift for.</p>\n<p>Anything that I generally want, I have a tendency to go ahead and make the purchase at any and every time.</p>\n<p>Anything that I <em>don't</em> immediately buy, is most likely because the item just cost too much and I can not justify the purchase.</p>\n<p>I do have a few things that I enjoy though, and high on that list is anything and everything Peanuts.</p>\n<p>Of the <a href=\"https://en.m.wikipedia.org/wiki/Charles_M._Schulz\">Charles Schulz</a> variety, of course. Charlie Brown, Snoopy, Woodstock, all of them! I've been enamored of the crew since I was a child.</p>\n<p>Some of my earliest memories of reading, not just making things up and babbling and looking at pictures, is of laying on the living room floor, the Sunday Comics spread open in front of me, reading and laughing at Peanuts.</p>\n<p>I remember Dad asking me if I was actually reading, then him being surprised when I said yep!</p>\n<p>All of that to say that my wife is pretty awesome! She always knows what to get me.</p>\n<p><img src=\"https://cdn.some.pics/swrogers/6671b4a30cb0e.jpg\" alt=\"A Charlie Brown Squish Mellow. \"></p>\n<p>The best squishmellow of all time!</p>\n<p>This is post 3/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-18T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/the-banana-thing/",
      "url": "https://shanewrogers.lol/posts/the-banana-thing/",
      "title": "The banana thing",
      "content_html": "<p>Last night my head was killing me.</p>\n<p>This morning my head was still killing me. I have to say that I consider myself extremely fortunate to have a very flexible career that affords me the ability to take time when I need it. It is not something that need be done very often - not for myself anyhow - but I'm more than happy to take it.</p>\n<p>Currently, I'm sitting in the quiet of the dinning area, watching one of the kiddos make some kind of banana <em>slash</em> chocolate <em>slash</em> puff pastry dessert that he and Mom had seen online somewhere. It looks interesting, and I'm sure it'll be tasty for them.</p>\n<p>Did I mention that this kiddo is only just out of fifth grade? He's been baking and cooking for what seems like a couple of years now. The kiddo is very driven and fairly well rounded.</p>\n<p>Normally, anyhow. Sometimes these kids will surprise with some of those &quot;You asked what?!&quot; questions. They are all super intelligent, have gifted IEPs in school, but still - on occasion - they show their age and remind us that they are still children, and need guidance to make their way.</p>\n<p>And that is perfectly fine. It's what we are here for.</p>\n<p>This is post 2/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-17T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/happy-fathers-day/",
      "url": "https://shanewrogers.lol/posts/happy-fathers-day/",
      "title": "Happy Fathers Day",
      "content_html": "<p>As today prepares to come to an end, I'm sitting here at home waiting on the ibuprofen and acetaminophen cocktail to do its thing.</p>\n<p>We did make it to Worlds Of Fun, as a way to have a fun Father's Day. It was a pretty good day. There were a couple of us that managed to get in a few good coaster rides, facilitated by some decently short lines.</p>\n<p>I had never ridden the Prowler before today - definitely one of my new faves. It's an older wooden coaster, I think it's celebrating a birthday this year as well. I'm kind of surprised that I had never been on it previously, but sure glad that I did.</p>\n<p>Now I've just got to get over the heat and sun induced ache that I've put myself through.</p>\n<h3 id=\"the-sunday-linkdump\">The Sunday Linkdump <a class=\"direct-link\" href=\"#the-sunday-linkdump\">#</a></h3>\n<p>I don't really have a whole lot this week, as I've just not really had the time to go down too many rabbit holes this week.</p>\n<p><a href=\"https://www.tiltedwindmillpress.com/product/ryoms-preorder/\">Michael W Lucas' Run Your Own Mail server preorder</a> I've previously run my own mail server, sort of successfully, but not from scratch. This book is on my radar.</p>\n<p><a href=\"http://www.phrack.org/index.html\">Phrack Magazine</a> Somebody had brought up 2600 magazine awhile ago, and this is another (non printed) magazine that's dedicated to the scene. I've read 2600 for decades, and also enjoy reading this one when it's available.</p>\n<p>Like I say, not a lot this week.</p>\n<h3 id=\"end-stuff\">End stuff <a class=\"direct-link\" href=\"#end-stuff\">#</a></h3>\n<p>I'm going to consider this my first entry into the <a href=\"https://100daystooffload.com/\">#100DaysToOffload</a> challenge for the next 365 days. I don't have any special pages set up for these, besides using the hashtag.</p>\n<p>This is post 1/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-16T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/a-not-so-rainy-day/",
      "url": "https://shanewrogers.lol/posts/a-not-so-rainy-day/",
      "title": "A not so rainy day",
      "content_html": "<p>Happy Father's Day Eve!</p>\n<p>To all of those who are parent figures to somebody or other who needs the support or the assistance, here's to a day filled with the joy and happiness that goes along with that personal fulfillment!</p>\n<p>As a father figure to my kiddos, I have cherished every day I've been around them. Have they all been easy days? Oh, heck no. But even those difficult and challenging days are completely worth it.</p>\n<p>Anyhow, on to today's stuff!</p>\n<p>Not that I've got anything really special to impart today.</p>\n<p>It was supposed to rain today, so the first thing I did upon waking up was head out and get the lawn mowed. It takes about an hour, so long as I'm able to keep up on it every week.</p>\n<p>We've got an old Snapper battery operated mower, with a 4Ah and a 2Ah battery pair. I really love it when I can get things done within a single battery. This morning was no different.</p>\n<p>While the battery operated mower is nice and we don't have to put up with having a gasoline container in the garage, it does entail the need to mow more often. Otherwise you wind up with a field that the poor machine just can't deal with.</p>\n<p>Did it wind up raining? Of course not. It looked pretty gnarly though.</p>\n<p>I'm sure it'll rain tomorrow though. That would be perfect, especially since we plan on heading to World's Of Fun for the day.</p>\n<p>Lastly, I'm considering doing the whole <a href=\"https://100daystooffload.com/\">100 Days To Offload</a> challenge.</p>\n<p>I figure that since I'm trying to write more that it might be something worth doing. I like personal challenges of this sort.</p>\n<p>With that, until next time.</p>\n",
      "date_published": "2024-06-15T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/not-the-battery-you-say/",
      "url": "https://shanewrogers.lol/posts/not-the-battery-you-say/",
      "title": "Not the battery you say",
      "content_html": "<p>This morning, the vehicle was taken into the local big box retailer that also happens to have a tire and lube department. Supposedly they can also check batteries, but honestly I don't know how much I'd trust them to even unlock a vehicle if you handed them the keys and a YouTube video with instructions.</p>\n<p>This is coming from a person who used to be a salary manager at this store. So, yeah, when you've worked there and seen that the department has had to replace two engines because reasons - you lose what little faith there was.</p>\n<p>Where was I? Oh, yes, the vehicle was taken into this store to get the battery checked and maybe replaced. Evidently, they checked the battery and it was fine. I guess.</p>\n<p>I don't know, though. The car is over 36 months old, so in my opinion I think we should replace the thing. It's spendy, but I'd rather not get stranded. I suppose that I'll just keep the mobile jumper in it. Charged.</p>\n<p>The spouse drove it around to her appointments today as well and has said that it did not act up. I would like to follow through with some plans we had for this weekend and go to the local amusement park - but I've got trust issues.</p>\n<p>I have been known to basically be done with my car at the onset of issues. Seems bad, but, it is what it is.</p>\n<h3 id=\"other-stuff\">Other Stuff <a class=\"direct-link\" href=\"#other-stuff\">#</a></h3>\n<p>We've been watching <a href=\"https://m.imdb.com/title/tt12637874/\">Fallout</a> over the past week. Not too bad, certainly looking forward to seeing where it goes.</p>\n<p>I don't know what we'll watch next, but it's not for lack of content.</p>\n<p>Kingdom Hearts came out on Steam. I had not intended on buying the bundle...but I bought the bundle. Of course.</p>\n<p>While I really do think that I like my blogging set up and workflow here, the tinkerer in me just can't leave well enough alone. I've set up a small digitalocean droplet and installed <a href=\"https://withknown.com/\">Known</a> once again. I like it, but I'm just not sure that I <em>love</em> it. I'll probably stick with what I've got.</p>\n<p>It's hard to beat flat text files and markdown.</p>\n",
      "date_published": "2024-06-14T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/not-a-tall-tale/",
      "url": "https://shanewrogers.lol/posts/not-a-tall-tale/",
      "title": "Not a tall tale",
      "content_html": "<p>Ah, the <em>Tale of the Telluride</em> just will not quit. It's like the gift that keeps on giving.</p>\n<p>Not in a good way.</p>\n<p>But then, how often are things &quot;good&quot; when <strong>that</strong> particular phrase comes into play. Yeah, not all that often.</p>\n<p>So after paying too stonking much for repairs due to a, um, we shall say &quot;self imposed&quot; accident, now it looks like we might have a little bit of salt rubbed into that festering wound.</p>\n<p>You know, for good measure.</p>\n<p>While it's probably entirely coincidental, it looks like we'll be replacing the battery in the beast. Twice today when going to start it up we've experienced a series of error checks (ECS, BCW, blah blah blah) and clicks and basically what looks like a computer system spasming out and proverbially vomiting all over itself.</p>\n<p>It's great. The vehicle is a 2021, so I guess it's about that time for the OEM battery to go. At least that's the opinion of the interwebs, that they'll last about 2.5 years. I don't mind, really. Having the battery die or running out of gas are about two of the larger vehicle fears that I have.</p>\n<p>Hopefully that's what the problem is.</p>\n",
      "date_published": "2024-06-13T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/our-feline-friend/",
      "url": "https://shanewrogers.lol/posts/our-feline-friend/",
      "title": "Our feline friend",
      "content_html": "<p>Let me begin today by first stating that I love our cat.</p>\n<p>I'm a cat person, more than any other animal. Please note that I stated &quot;I'm a cat person&quot; and not &quot;I'm a pet person&quot;.</p>\n<p>Over the years I've come to the conclusion that I much prefer <em>other people's pets</em> to having my own.</p>\n<p>It's just so, so much easier. And cheaper. Don't want to forget cheaper.</p>\n<p>All right, now that that's out of the way. Again, I really love our cat. He's a big ol' gray and white beast that would rather just leave you alone so much as look at you. Which is totally cool with me.</p>\n<p>I don't have to worry about him getting around my work area or laying on my laptop. I don't, generally, have to worry about him being underfoot. With the general exception of him racing me downstairs in a vain attempt to trip me.</p>\n<p>Of course life isn't all gumdrops and lollypops with the cantankerous cat around. No sir.</p>\n<p>He's an indoor cat. If it's one thing that I like even less than pets it's fleas. Most likely because fleas <em>really</em> love me. So what's the one thing in all the world that this animal desires?</p>\n<p>Yep. Uh huh. He absolutely desires to go outside. Even just the garage. And good golly gee whiz is he <strong>uber, super</strong> vocal about it.</p>\n<p>I'd swear, listening to this bad boy <strong>meowrl</strong> just could drive me insane. Dude is loud. Like, if I didn't know better we'd swear he was a she and not neutered (he is).</p>\n<p>It's a near constant ordeal, some days.</p>\n<p>Have I told you I love my cat?</p>\n",
      "date_published": "2024-06-11T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/it-still-pains/",
      "url": "https://shanewrogers.lol/posts/it-still-pains/",
      "title": "It still pains",
      "content_html": "<p>Ah, the great and powerful Monday.</p>\n<p>I actually don't mind Mondays. Sure for some people it's the beginning of the work week (myself included), but it also means a great day of getting stuff done at work with little interruption.</p>\n<p>Naturally today we had about an hour long team meeting to discuss projects new/old/upcoming and other leadership tidbits. I don't mind, at least it wasn't a 3pm (4pm!) meeting on a Friday. Those stink.</p>\n<p>In household news, the granddaughter is starting to feel more and more comfortable. She does get a little upset and sad when her Dad leaves the room or goes to work, but it passes much quicker now than it used to. She's a whole lot happier and just seems to be in a better mood overall now. It's great to see.</p>\n<p>Today we also found out what the final cost of repairs are going to be on the vehicle. Shockingly not as bad as I was anticipating, but then I did have a worse case scenario in my head, just so I could be relieved if that was not the case. It still hurts and is money out the door and straight into the incinerator, but it could have been about a thousand dollars worse.</p>\n<p>Now all we need is for a major appliance to vomit all over itself and call it a day.</p>\n<p>I'm thinking it's about time to get some dinner prepped, so off to do that I go.</p>\n",
      "date_published": "2024-06-10T00:00:00+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/notes-of-yesterday/",
      "url": "https://shanewrogers.lol/posts/notes-of-yesterday/",
      "title": "Notes of yesterday",
      "content_html": "<p>I did not post anything yesterday.</p>\n<p>After over a month of managing to get something put up, I skipped a day.</p>\n<p>And you know what? That's okay.</p>\n<p>It's not a habit until it becomes something more normal. I hope that days like yesterday are more the exception than the rule.</p>\n<p>There was some productivity that was had yesterday, despite the overnight rain I was able to get the lawn mowed and some other weeds taken care of. We've got an older Snapper battery operated lawnmower, and I consider it a major accomplishment if I'm able to get the lawn mowed within a single 4Ah battery. If I can get it weekly, it's usually possible, and only takes about an hour.</p>\n<p>Still, I really need to run the weed eater though.</p>\n<p>The second vehicle is still at the dealership, hopefully it's finished by Monday afternoon. It really stinks not having my car. Not that I go anywhere, or that I could go anywhere at this time. But still.</p>\n<p>I've got a question into our insurance agent, wondering about a few things that are related about that vehicle issue, but I'm not overly optimistic about any responses there. Certainly nothing favorable, anyway.</p>\n<p>It's getting close to that time to begin thinking about birthday gifts for the spouse. Sometimes I'm just not really in a gift giving mood, and this seems to be one of those times. I do, however, think I know what I'm going to get, so that's positive.</p>\n<h3 id=\"last-week's-links\">Last Week's Links <a class=\"direct-link\" href=\"#last-week's-links\">#</a></h3>\n<p>I think I'm going to start something new here, too, this week. In something of an effort to reduce the number of open tabs that I have on my phone, I'm going to add to a listing of links that I've found of interest.</p>\n<ul>\n<li><a href=\"https://tiddlywiki.com/\">TiddlyWiki</a> an older single file wiki based, server less, personal knowledge base application. I haven't used this in forever, it's good to see it's still kicking though.</li>\n<li><a href=\"https://www.linode.com/docs/guides/how-to-install-and-configure-hubzilla/\">How to install and configure hubzilla</a> I like the idea of Hubzilla, and I also like the idea of running my own fediverse something or other. I already have plenty of them, though, and don't need to <em>collect them all</em> in this case.</li>\n<li><a href=\"https://news.itsfoss.com/ente-auth/\">Ente Auth</a> I really need to get away from Google Authenticator, since it kinda stinks. You'd think that Google would at least provide some kind of <em>search</em> for theirs, but.... That's asking quite a lot. Ente seems pretty cool, they've also got a photos replacement.</li>\n<li><a href=\"https://cara.app/home\">Cara</a> Something of an Instagram replacement that has had really good growth over the last few weeks from what I see. They have really strong safeguards and stances on AI.</li>\n</ul>\n",
      "date_published": "2024-06-09T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/half-a-quartet/",
      "url": "https://shanewrogers.lol/posts/half-a-quartet/",
      "title": "Half a quartet",
      "content_html": "<p>Today we had a short conference with one of the music/band/orchestra teachers in the school district. One of the really cool things that our district provides (well, free it isn't...but it's available) is for incoming junior high students the opportunity to try out a variety of band and orchestra instruments over the course of four days, to see what they like.</p>\n<p>All of our kids have participated at this point, the current kiddo just finished his stint up. He went into it grudgingly, steadfast in his thinking that he just wanted to play the violin and nothing else. We did find out, through the whole camp experience, that he is not able to play brass - kiddo was just not able to buzz his lips. That's perfectly acceptable.</p>\n<p>Two of the instrument styles, both I suppose would be woodwinds, he actually played very well. Clarinet and flute. Totally hilarious, especially when considering that he really, <strong>really</strong>, did not want to go those days because he would just not be able to do anything at all with them. Ha.</p>\n<p>Even when all was said and done, what was his top choice? Well, still the violin. Totally cool. That said, his second choice was actually the flute. The actually also recommended that he try to choose the bass, he checked all the &quot;hell yeahs!&quot; on that one. Both the teacher that he worked with on bass, and  the assistant, were former bass players and were very excited to see how well he performed. Fortunately, those skills do translate well to the violin.</p>\n<p>All in all, we should now have half of a string quartet in our home now.</p>\n",
      "date_published": "2024-06-07T15:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/still-wheely-tired/",
      "url": "https://shanewrogers.lol/posts/still-wheely-tired/",
      "title": "Still wheely tired",
      "content_html": "<p>Last evening I had the opportunity to update one of our Oracle applications. Something that I've gone through a handful of times now and have been able to fairly well document. It's kind of a flaky system, in that it requires some toggles and buttons being pressed in a very specific order. A rather unorthodox and strange order in our opinion. But, I've got it down to a science now.</p>\n<p>Today was uneventful. So excellent.</p>\n<p>On the home news side, hopefully tomorrow we will get our second vehicle back after an accident with one of the wheels and a curb. Though it's kind of bittersweet, since it'll be a large bill. Definitely not looking forward to this.</p>\n<p>Yeah, I'm still tired and this whole vehicle situation doesn't help.</p>\n",
      "date_published": "2024-06-06T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/the-mobile-posting-process/",
      "url": "https://shanewrogers.lol/posts/the-mobile-posting-process/",
      "title": "The mobile posting process",
      "content_html": "<p>All of the following is more for myself and future reference than anything. (Though, who am I kidding, this whole blog thing is all personal future reference, isn't it?)</p>\n<p>I figure that I've been blogging this way for a month or better at this point, so it might be worthwhile to get down what my current process is for getting a post up. I'll even include some nifty screenshots. All from mobile, even!</p>\n<h3 id=\"the-process\">The process <a class=\"direct-link\" href=\"#the-process\">#</a></h3>\n<p>Currently my site is statically generated by way of eleventy, hosted on GitHub pages, using porkbun as DNS.</p>\n<p>My writing is done using Zettel Notes on Android, using Markdown and it connects to my GitHub repository to push and pull as needed. The push triggers a GitHub action to update the static pages.</p>\n<h3 id=\"the-flow\">The flow <a class=\"direct-link\" href=\"#the-flow\">#</a></h3>\n<p>Here is where I start things off, using Zettel Notes I open my &quot;local&quot; storage on my phone via the App Directory.</p>\n<p><img src=\"https://cdn.some.pics/swrogers/666086db7dca8.png\" alt=\"Zettel Notes screenshot on Android. Shows a portion of the side menu.\"></p>\n<p>I've got a handful of templates and half started junk in here - I really should clean this out. The main item of interest is the <code>blog-template-default.md</code> file here, though.</p>\n<p>I open that file up and copy the contents...<br>\n<img src=\"https://cdn.some.pics/swrogers/6660872d78e5f.png\" alt=\"Screenshot of the Zettel Notes app on Android. Shows the main &quot;App Folder&quot; directory listing where I keep my blog drafts and templates.\"></p>\n<p>...into a new entry within the Blog drafts directory. Ive got Zettel set up to automatically name the new note entries with the date as I like, I just have to add the rest of the file name and the extension.</p>\n<p>To the rest of the yaml front matter I will add the title, change the date (the only thing I have yet to figure out if is easily automated in Zettel or not) and the tags.</p>\n<p><img src=\"https://cdn.some.pics/swrogers/6660878ee41f6.png\" alt=\"Screenshot of the Zettel Notes application on Android. Shows the text of the yaml front matter that I use for my default blog posts.\"></p>\n<p>After I edit the file, I then manually copy the note into the posts directory of the Lol Blog section/repository and refresh the listing. This initiates the needed push to start the publishing process.</p>\n<p>Any images that I use, I have just been uploading to my omg.lol pictures area and copying the markdown links. It works.</p>\n<p>It's all kind of clunky, manual, somewhat kludgy, but it works for me.</p>\n",
      "date_published": "2024-06-05T15:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/i-am-so-ready/",
      "url": "https://shanewrogers.lol/posts/i-am-so-ready/",
      "title": "I am so ready",
      "content_html": "<p>I'm thinking this is just gonna be a short little snippet of an update.</p>\n<p>There is this part of me that wants to just take a couple of weeks and just &quot;go&quot;. No real destination, no real plans. Just get in the car and drive.</p>\n<p>Realistically, I'd rather get on the bike and ride, but that's kind of challenging when one no longer has a bike to get onto. To qualify, when I refer to a bike, I'm not talking about the peddle powered version.</p>\n<p>Just me. Just on my own.</p>\n<p>I'm so tired.</p>\n",
      "date_published": "2024-06-04T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/a-bit-of-personal-history/",
      "url": "https://shanewrogers.lol/posts/a-bit-of-personal-history/",
      "title": "A bit of personal history",
      "content_html": "<p>I was not raised in a family that provided a lot of what I'll call <em>emotional attachment</em>. My parents probably loved each other, at one point, but if they did I never saw proof of that. Quite the opposite, actually. My parents divorced early in my life.</p>\n<p>I can remember only twice in my life - I'm currently nearly 50 years old at this point - that I witnessed my father cry. The first time I was probably still in the fourth grade (I'm wildly guessing here at timeframes) and it was early morning before school. I'm sitting at the dining room table (we actually had one of those, both the dining room and the table, quite the concept) eating breakfast and the question is put to me: &quot;Would you rather stay with your Mom or your Dad?&quot;.</p>\n<p>For the love of pete, what a question to drop on a young kid.</p>\n<p>What would you expect the response to be? If the kid leaves, then he has to change everything: schools, friends, homes, the whole bag.</p>\n<p>Of course the kid is going to opt stay with the Mom.</p>\n<p>Which I did, at that time.</p>\n<p>That was the first time witnessing the tears.</p>\n<p>My Mom was, quite likely, bi-polar. I think she even said that at one point that she'd been diagnosed, but I'm not positive. Some days were great, some not so great.</p>\n<p>I can remember a lot of volitility. Dishes, utensils, pots, pans, all being thrown out of the kitchen and at the wall in the hall.</p>\n<p>There was a time when I snuck into the kitchen one afternoon and grabbed a freshly baked chocolate chip cookie. Oh, I can tell you right now that I <strong>never</strong> did that again. I had a wooden mixing spoon broken across my backside for that one. I would have to say, I don't believe that punishment fit that crime.</p>\n<p>Then there was the time when my Mom was supposed to give me swats with a flyswatter. For some reason, she just barely tapped my bare bottom with said swatter. I don't know what I had done to deserve (or not, such as the case may have been) that one.</p>\n<p>I didn't spend much time with my Mother. I did wind up staying with my Dad. I know that they both loved me, but neither of them were very good at showing said love.</p>\n<p>Did I yearn for their attention? No. I can't say that I did.</p>\n<p>Has that history made my current life and years difficult? Oh, I think that's safe to say. I can't let people get close. I'm not one for really showing affection. I am emphatic and I do understand when others are going through difficulties, but I'm not really equipped to help necessarily.</p>\n",
      "date_published": "2024-06-03T19:48:25+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/yeah-i-am-a-sucker/",
      "url": "https://shanewrogers.lol/posts/yeah-i-am-a-sucker/",
      "title": "Yeah I am a sucker",
      "content_html": "<p>I kept telling myself that I wasn't going to go through with it, that I've already spent enough money on games - specifically my Steam backlog - but they just keep pulling me back in.</p>\n<p>Silly sales. Gah, dang it.</p>\n<p>It's half off now, so naturally I've got to make one <strong>last, final</strong> splurge. At least I've only bought one copy of this title. Ha!</p>\n<p><img src=\"https://cdn.some.pics/swrogers/665cdd1298727.jpg\" alt=\"Diablo IV being installed onto my Steam Deck in desktop mode.\"></p>\n<p>Now, all I've got to do is wait for the thing to download and install. Only 11.6 Gigs down, another 75 Gigs to go. It's disgusting. 😑</p>\n",
      "date_published": "2024-06-02T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/the-steam-deck-age/",
      "url": "https://shanewrogers.lol/posts/the-steam-deck-age/",
      "title": "The Steam Deck Age",
      "content_html": "<p>Just because the May challenge is over doesn't mean that I can't still try to keep some writing going.</p>\n<p>As I had stated earlier, I've had the opportunity to move my workspace into a downstairs location, and I think I kind of like how things are situated now. It's a good feeling to have a nice clean start, without quite so much clutter. I had even brought another box down, but said to myself: &quot;Self, do I really need to bring all this crap down here? No. No I do not.&quot; At which point, I promptly packed that box back and trotted it right back upstairs.</p>\n<p>Probably one of the nicest bonuses to having this setup down here is that I can dock my SteamDeck and play it without feeling too guilty about not being around the family. I don't get a whole lot of time to game these days, so I haven't really been able to take advantage of having my Deck. Now, maybe that can change.</p>\n<p><img src=\"https://cdn.some.pics/swrogers/665b8cc3b09c1.jpg\" alt=\"Cropped image of my work area, with the Steamdeck docked.\"></p>\n<p>All right, with that I think it's getting to be about time to get some dinner prepped. It's spaghetti squash with homemade alfredo night, with a side of asparagus.</p>\n<p>Have a good night all!</p>\n",
      "date_published": "2024-06-01T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/what-a-month/",
      "url": "https://shanewrogers.lol/posts/what-a-month/",
      "title": "What a month",
      "content_html": "<p>Whoa, it has <strong>been a week</strong> this day. I'm glad that it's almost over. Not only is this day, erm week, almost over, but so is the month. Which also brings us to the end of the Weblog Publishing Month challenge.</p>\n<p>And I do believe that I accomplished the challenge.</p>\n<p>So what made today a challenge? Largely that we will most like have to have the wheel replaced on our vehicle. Naturally, the vehicle has the premium package so yeah, won't be cheap. Somebody hit a road divider turning into a parking lot and bent the inside of the wheel, popping the bead on the tire. So, not looking forward to that damage.</p>\n<p>Another item, which was actually positive, is that the Uber sectional super rearrangeable couch that we purchased showed up (mostly) today. Like, a week early. So we weren't prepared. But, it worked out because more people were home to help get things sorted out!</p>\n<p>Overall, I have to say that it's been a great month. I had hoped to do something different, but I think writing about my life worked out. I think that I should be able to continue this.</p>\n<p>Thank you for those that are reading.</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-06-01T01:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/the-newish-environment/",
      "url": "https://shanewrogers.lol/posts/the-newish-environment/",
      "title": "The newish environment",
      "content_html": "<p>The first half of my day has gone pretty well so far, considering the work area move so I can keep an eye on the grand. Well, it does make it easier to keep an eye on her, but that was of course not the full reason for the move.  We still hope to have the extra room usable for the eldest soon.</p>\n<p>I do admit that it's nice to have a cleaner desk to work with. I still need to bring my side table and printer down, as well as get my Openmedia Vault box set back up. I miss my qemu box.</p>\n<p>Thus far today, I've managed to stay firm in my determination to keep junk food out of my face. So that's a solid win. Not feeling any hunger, which is to be expected with my experience.</p>\n<p>This month is nearing its end, but I think I'm going to continue to attempt to get something down every day. It's been easier than I expected, and I keep basically doing this for myself and none other.</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-30T19:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/no-more-bag-habits/",
      "url": "https://shanewrogers.lol/posts/no-more-bag-habits/",
      "title": "No more bag habits",
      "content_html": "<p>Bad habits. I seem to have fallen back into some of them. Most of which seem to revolve around food, which I can only blame myself really. I've been doing a keto lifestyle since August of 2019, about five years at the time of this, and it could be said that I'm still keto.</p>\n<p>I generally stay under twenty net carbs a day. No sugar. None of what works normally be considered a part of the regular American diet. It was a change that needed to be made if I wanted to live to see my kids grow up and not find myself in an early grave. By all measures the change has been a glowing success.</p>\n<p>Lately though, and by <em>lately</em> I should probably qualify that with about the last year or so, I've been really, really bad about continuing to log what does go into my body. I have been really bad about junk food. I've probably already talked about what I consider junk food, it's not really what my fellow neighbors would consider junk. But, high calorie crap that I absolutely, positively, do not need. If I do partake, I've got to ensure it's accounted for. I don't always do that, so shame on me.</p>\n<p>This morning, I weighed nearly 194 pounds. Still down from 330 plus, but in my eyes, I see that getting far too close to the double century mark for my liking. This guy has got to get back into only eating when he's hungry. That's my bad habit now.</p>\n<p>I never really &quot;ate my feelings&quot;. I always ate out of boredom or habit. It didn't take long to drop breakfast. Then lunch eventually fell as well. I need, I have the desire, to feel that hunger once again.</p>\n<p>As they say: <strong>Keep On Keto On</strong></p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-29T20:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/some-close-shaves/",
      "url": "https://shanewrogers.lol/posts/some-close-shaves/",
      "title": "Some close shaves",
      "content_html": "<p>Good grief have I been cutting it close these past couple of days! I wound up taking the day off with a migraine and sore throat. Plus the salt in the wound that is the pink eye, which is being treated successfully.</p>\n<p>I also got the opportunity to watch the grand today, for whatever that was worth as she wasn't feeling the best either, what with it being a new environment and not having her dad at home. It's going to take a bit for her to get used to us, but kids are very adaptable.</p>\n<p>Still wasn't able to make any progress on their future room, though. Not sure how well tomorrow will go in that regard either. It does make me feel kinda horrible.</p>\n<p>Ah well, on to the latest episode of <em>Dark Matter</em>.</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-28T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/an-office-no-more/",
      "url": "https://shanewrogers.lol/posts/an-office-no-more/",
      "title": "An office no more",
      "content_html": "<p>The long weekend is nearly at an end. I didn't get nearly as much done as I wanted. Color me all kinds of surprised. Did manage to get the lawn mowed and the AC fan unit hosed off, so there is that.</p>\n<p>What I had really wanted to do, get the office/extra room cleared out for the eldest and the grand, didn't happen quite as planned. We need to get room cleared out in some other places first. Namely the master bedroom. My workspace is once again going to be the corner of the bedroom. I don't actually mind, I think it's more than worth it to have our eldest and his kiddo in a better situation. It's going to make things interesting around here for awhile, no doubt about it.</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-27T22:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/other-peoples-pets/",
      "url": "https://shanewrogers.lol/posts/other-peoples-pets/",
      "title": "Other Peoples Pets",
      "content_html": "<p>Well, it's after 1500 so I guess that is should probably work on getting <em>something</em> written up.</p>\n<p>It's also a long weekend here, normally that would be a good thing, but once again I just struggle to enjoy all the free time. What doesn't help this go round is that I get to play the bad guy in the house. Some people in the home want an animal, specifically a dog. I don't have anything against dogs, so long as they aren't mine.</p>\n<p>I've come to the conclusion that I'm not a pet person. I much prefer other people's pets. I know that if we get a dog, the person that winds up taking care of it 80 percent of the time or more, will be the person writing this entry. I don't want a dog. This makes me feel like an asshole. It is what it is.</p>\n<p>I have a hard enough time keeping care of the cat and two bearded dragons that are in the home. Our walls are scratched and destroyed - at some point in time I'd like to get those taken care of. The yard looks like ass right now, I don't want it to get worse nor do I relish the thought of scooping poop. We tried having a dog already. He ate part of the couch, some books, a couple of apple trees, a peach tree, a cherry tree and a fig tree. Yeah. I don't want a dog.</p>\n<p>I'd almost consider going back into the office to work before that.</p>\n<p>Well, that turned into a thing.</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-26T20:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/so-so-tired-today/",
      "url": "https://shanewrogers.lol/posts/so-so-tired-today/",
      "title": "So so tired today",
      "content_html": "<p>It's been a day of feeling absolutely miserable. Took a couple of benadryl may night, with the hope being that I might be able to some decent sleep to go along with being stopped up with a sore throat.</p>\n<p>Yeah, that didn't work too well. While I was basically falling asleep at 22:00 last night, I also managed to forget to put the recycling and trash out for the morning. At least I was able to get them out this morning. The problem with benadryl is that it takes forever to wear out of my system.</p>\n<p>So even right now, at 1700 the next day, I feel like I could go to bed.</p>\n<p>Sigh.</p>\n<p>At least the grand daughter wasn't too bad today! She doesn't really know us, but we've been working on that and I think that we are making progress.</p>\n<p>Anyhow, here's a photo I took of our backyard swing while I was pushing our six year old on it. Enjoy. 😃</p>\n<p><img src=\"https://cdn.some.pics/swrogers/66510ce975b2b.jpg\" alt=\"Picture of green grass with an empty swing set seat hanging on the left side.\"></p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-24T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/one-more-day-down/",
      "url": "https://shanewrogers.lol/posts/one-more-day-down/",
      "title": "One more day down",
      "content_html": "<p>It's certainly been a day.</p>\n<p>And night, honestly. Late last night our eldest came home with his little one. I will say that it wasn't entirely unexpected, and that we as a family are glad to have them here. We are grateful that we are <em>able</em> to have them here. This weekend will be a bit of work, as I have kinda taken over the extra room and made an office out of it, which will have to be swapped back over to make room for the two of them.</p>\n<p>We've also got a couple of us in the home who aren't exactly feeling all that well. One probably should have come home early with an ear infection/headache/head cold. Myself, I'm halfway stopped up with a scratchy throat and can't sleep worth a darn. It's been a pretty not so fun time overall here in the household.</p>\n<p>The twins have the last day of school tomorrow, assuming that they are both able to go. Next year they will be finishing up middle school.</p>\n<p>Right now, I'm just sitting here, listening to the quiet that is octonaughts. Who are also asking for peace and quiet. It's kinda meta.</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-23T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/a-somewhat-productive-day/",
      "url": "https://shanewrogers.lol/posts/a-somewhat-productive-day/",
      "title": "A somewhat productive day",
      "content_html": "<p>If I were to be honest - and really why wouldn't I be so - today has been something of a productive day. I don't feel like I have a whole lot of <em>actual product</em> that came out of today, but I do feel that I made some learning progress today for work.</p>\n<p>That, my friends, is certainly positive. I'm learning some working details of our new ticketing/asset/configuration item/project system. We're moving from the atlassian product, so it's something along those lines. I don't mind jira, but it'll be nice to not have different login system and be able to use our single sign on. Plus, while I will be a department admin, I don't have to admin the whole thing.</p>\n<p>Today was also the last day of school for the kindergartner and the fifth grader. It's bittersweet all around.</p>\n<p>Yeah, it's a short update day.</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-22T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/end-of-an-era/",
      "url": "https://shanewrogers.lol/posts/end-of-an-era/",
      "title": "End of an era",
      "content_html": "<p>Today was the recognition ceremony for our fifth grader. This is certainly a special class, one that we feel honored to have gotten to be involved with. Our fellow parents are amazing, our son's peer group is just flat out phenomenal, we couldn't ask for anything better.</p>\n<p>This class has marked a couple of milestones. First, the school principal started out with this group in kindergarten. She's been a wonderful person - an advocate above all who believes in all the students. Sadly for this school, she is leaving for another district.</p>\n<p>Second, our young man has had a gifted IEP for a number of years now (recall what I said about the principal being an advocate?), and he was the first gifted student for his particular gifted facilitator. She, too, has been a joy to work with. We have had nothing but positive memories for this school and the people there.</p>\n<p>Fortunately, we still have one more kiddo to take through this journey. He is getting to go through this school's beginning of a Montessori program. So far, it's been good for him. We would have loved to have had more of them go through this type of learning system, but at least one is able to.</p>\n<p>When we first moved here, I admit to having doubts about this area and this school - but no longer.</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-21T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/no-no-no-anything-but-that/",
      "url": "https://shanewrogers.lol/posts/no-no-no-anything-but-that/",
      "title": "No no no anything but that",
      "content_html": "<p>As the saying goes, &quot;oh for crying out loud!&quot; Not only have I/we not all been feeling too well, but last night my right eye began bothering me. It felt really dry, not super itchy or anything, just dry and a little hazy at times.</p>\n<p>I get up and look into the mirror.</p>\n<p>Whoa, that's certainly a red, rather angry looking eye I've got there.</p>\n<p>Now, being a parent of five kiddos, there really is only one thing that goes through my head at this point, and I can't quite figure out how in the world I would have come down with <em>pink eye</em>.</p>\n<p>Sigh.</p>\n<p>Fortunately, we do have five kiddos (well, mostly four, though the first is back under the roof with his own as well now) in the house. Plus, we don't like to throw medication away. Or anything really, but that's another story. So I guess it's eye drops for me.</p>\n<p>How I've managed to go all my life without getting this before I'll never know. It's right up there with <em>how in the world did I get it this time?</em></p>\n<p>So annoying.</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-21T20:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/just-another-day/",
      "url": "https://shanewrogers.lol/posts/just-another-day/",
      "title": "Just another day",
      "content_html": "<p>The 20th of the month, and the first time that I've actually sat down at a computer to write a post in, oh, what seems like forever at this point. I've remembered to <code>git pull --rebase</code> so - hopefully - there won't be any errors thrown by git. What I've not done is to come up with some kind of theme for todays entry.</p>\n<p>The morning was pretty much blown, not only was there no real sleep to have been had (stopped up nasal situation, creating a wonderfully sore throat), but then there was the need to get the two oldest and the youngest kiddos in for their annual &quot;well child&quot; check. Always a good time. At least our family doctor is easy to talk to and we generally really like her. Would definitely recommend her as a local doc anytime I see people ask about who to go to in any of the local groups. The only thing that I (we...) don't care so much for is the fact that her practice was sucked up into the local hospital conglomerate a handful of years ago. Ugh.</p>\n<h3 id=\"just-chillaxing-here\">Just chillaxing here <a class=\"direct-link\" href=\"#just-chillaxing-here\">#</a></h3>\n<p>So, I'm just sitting here putting off one of the more dull parts of my duties. Instead of which, I'm listening to my eldest twin talk his way through an attempted understanding of building a binary input system that outputs an analog number using simple logic gates. Not only has he basically taught this to himself (with a small amount of input from myself), but he has more or less sucessfully reversed engineered a simple prebuilt machine and added a third bit. Listening to him explain the process, and be super excited about his progress, is enough to make this geeky Dad very, very proud.</p>\n<p>I've also been kind of halfway <em>futzing</em> (that's a technical term there) around with creating a process to pull in a weeks worth of <code>raindrop.io</code> links into distinct data directories within this blog. I've got a pretty simple solution that will pull in the previous weeks worth of items, create any necessary <code>YYYY/MM</code> directory, then write a <code>response.json</code> file containing the items. I guess I'd probably rather create <em>week number</em> directories as opposed to month directories though - that would make more sense in that process. The idea being that I could have a weekly post of all the links that I wanted to save and share for that previous week. I also do use the paid <a href=\"http://raindrop.io\">raindrop.io</a> account, so I think I could maybe link to the cache - not sure on that, though. At least for me, I could.</p>\n<p>This past few days I've also been trying to get more familier with the <a href=\"https://nyxt.atlas.engineer/\">Nyxt</a> web browser. It's kind of an <em>on again, off again</em> deal with me. Some of my browsing I do over an X tunnel, and nyxt just seems a little bit faster than firefox. Plus, it's <code>lisp</code> based and I'm still in that phase of learning new things.</p>\n<p>With that, I think we shall call it an end.</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-20T20:27:56+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/a-title-should-go-here/",
      "url": "https://shanewrogers.lol/posts/a-title-should-go-here/",
      "title": "A title should go here",
      "content_html": "<p>It's Sunday, which thankfully means that the weekend is nearly, blessedly, over. One of these days I'll figure out what it is about the weekend or time off that I don't care for. Sigh.</p>\n<p>Managed to get the dishwasher unloaded and reloaded this morning. Sometimes I still feel very much like that butter robot. Only I get to do more than just &quot;pass the butter&quot;, I also get to fetch fresh paper towel rolls from storage! Aren't I lucky.</p>\n<p>I know that people don't take me for granted, but good grief sometimes it really does feel that way. Are there things in my life that I would haved changed, given the chance? Sure, I don't think that there is anybody out there that would say otherwise. I try to stay upbeat and somewhat optimistic, but it can be a challenge. Especially when you live with somebody who has depression. Anyhow.</p>\n<p>I was going to write something here related to what I've stated above, but I'm not too sure that I want to get into some of these items just at this time. At least not in public. While I don't share these posts within my <em>close friend group</em>, neither is this site exactly hidden. I think I'll just leave it at that for a bit. Talk about vague posting, I guess.</p>\n<p>Now for an attempt at something a little less depressing I guess. While I really, really have been enjoying Zettel Notes, I would like a way to more easily share pics on this site. Without the need to host the images myself. Yeah, that kinda limits me with workflow simplicity. I've got the pixelfed account, so there is that, but then omg.lol also has a pretty simple image host as well. Both just take a little extra steps. But this should work, I guess.</p>\n<p><img src=\"https://cdn.some.pics/swrogers/664a23faee93d.jpg\" alt=\"Cropped picture of my IronFlask coffee mug.\"></p>\n<p>I guess that should do for today.</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-19T15:00:00+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/a-chore-no-more/",
      "url": "https://shanewrogers.lol/posts/a-chore-no-more/",
      "title": "A chore no more",
      "content_html": "<p>Ah, welcome to the weekend!</p>\n<p>Finally was able to sleep in a bit this morning, all of until 8am. Still feels like sleeping half the morning away, though, especially when one is used to getting up at 6am.</p>\n<p>For a Saturday it's been kinda productive, managed to get the lawn mowed for the first time in over a week. It's funny, when I was a kid and had to mow two yards and a large back lot I was never a fan of the chore. It could have had something to do with needing to deal with a black walnut tree....if you know, you know. Ugh. Now, though, it's a good time to unwind with some music and enjoy the process.</p>\n<p>Certainly it's not something that I'd consider a chore. My yard doesn't look the best in the neighborhood, but at least it's far from the worst. I try to take at least a little bit of pride in how the home looks. It doesn't hurt that the neighbors also have really nice lawns.</p>\n<p>I've got other things around the home that I'd like to do - one of which being permanent holiday lighting with some programmable LEDs. Maybe I can tackle that project this Summer.</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-18T15:00:00+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/a-perfectly-cromulent-day/",
      "url": "https://shanewrogers.lol/posts/a-perfectly-cromulent-day/",
      "title": "A perfectly cromulent day",
      "content_html": "<p>I feel like I should have more to write about today.</p>\n<p>I feel like I could (should?) have been more productive today.</p>\n<p>Let us count what all I've accomplished to get done this fine, fine Friday the seventeenth.</p>\n<ul>\n<li>One of our major SaaS applications is going to be upgraded at the end of the month, so that needed to be added to the calendar.</li>\n<li>A group request that I'd made a couple of days ago was just fulfilled, so I was able to make a couple of updates in prep for a background process. Which can't be finished until a separate sync occurs.</li>\n<li>I brought an item to another groups attention, so that the requestor can be thought how to help themselves.</li>\n<li>I've started learning a new service management/issue tracker/asset management/knowledge base system of which I am one of the main admins for our group. This should be fun.</li>\n<li>Trying to pick up some Laravel. I don't know why or for what purpose, seeing as I actually prefer clojure for fun and....well, not really profit seeing as how it's a hobby.</li>\n</ul>\n<p>Yeah, that's about the gist of what I've done today. I guess I did upgrade one of my Kimsufi boxes and portainer container. It's been a moderately full day, and for that I'm completely okay!</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-17T20:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/not-so-messy-this-time/",
      "url": "https://shanewrogers.lol/posts/not-so-messy-this-time/",
      "title": "Not so messy this time",
      "content_html": "<p>It's the afternoon and I'm sitting in the car, waiting for the two youngest to get released from school. I can't complain about how the day has gone, it's been pretty good and relatively productive. I'm just glad that the little one was able to go and stay at school all day! I love that my kids, generally, enjoy school.</p>\n<p>Part of my job role involves application upgrades for some decently large vendors, Oracle and Salesforce come to mind. These upgrades can be a tad kludgy. An understatement to say the least. I've been through a handful of one upgrade in particular that I have been able to get documented fairly well, and I believe that I now have it down to, if not a science then at least an art. Art is still allowed to be messy - and this thing is no exception. I think my favorite part of this last patch cycle was that Oracle has evidently stopped providing (what appears to be) either a second copy of their jdk, or they've streamlined it into a non-versioned directory. Which I suppose is nice. At least it was easy enough to sort out.</p>\n<p>We've got some other projects in the hopper at work, and it feels good to be a part of them. It almost feels like progress.</p>\n<p>Ah, the kids are picked up. Some garlic olives have been snacked on (it is weird how ones tastes change when away from carbohydrates for so long). I'm sure I could ramble on more, but I think I'm good here.</p>\n<p>Thanks for reading, if you are. If you're not, then that's okay too.</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-16T20:00:00+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/catch-up-to-the-lifestyle/",
      "url": "https://shanewrogers.lol/posts/catch-up-to-the-lifestyle/",
      "title": "Catch up to the lifestyle",
      "content_html": "<p>We seem to be nearing the midway point of the month. I am just getting back to work from a week of &quot;vacation&quot;, then two days of having a sick kiddo at home. Okay, so three days, really, but today has been more of a &quot;letting the kiddo keep his temp normal&quot; kinda day. Not so much sick, as he is stopped up. At least the cough is more or less done.</p>\n<p>As is the way of things, after taking a week off of work today has basically been spent playing catch-up. At least it hasn't been as bad as it's been in the past. Just a couple of quick answers that needed to be sent out. I'm so glad this is a slower time of year. I've generally taken two weeks off at a time, but figured I'd change things up this go round. Of course, what with the sick kiddo I was beginning to wonder if I might have wound up taking this week off as sick leave too.</p>\n<h3 id=\"the-lifestyle\">The lifestyle <a class=\"direct-link\" href=\"#the-lifestyle\">#</a></h3>\n<p>How about an update on my keto life? My weight has been steadily creeping up over that 190 plus mark over the past few months. Certainly not where I want to be, no matter what other people in my life think. While I do agree that sub 170 is not a good look on me, I continue to struggle with making my way down below 190. I still have my goal at 182, preferably.</p>\n<p>I do consider myself lucky (accomplished?) in that I still wear the same sized jeans and clothes, so I haven't had to change or modify the wardrobe again. Thankfully. That's one of my major fears, that whole idea of relapse, once I were to allow myself to get comfortable with a weight. When that happens, then I stop logging all food, I start snacking more, I start thinking that eating this little bit of junk is going to be okay.</p>\n<p>Then it's just a completely blown day and I wanna retreat within myself. I need to be able to string together a few good days.</p>\n<p>I need this win, again.</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-15T18:00:00+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/just-for-me/",
      "url": "https://shanewrogers.lol/posts/just-for-me/",
      "title": "Just for me",
      "content_html": "<p>Two weeks in, so far so good?</p>\n<p>One thing that is certainly a bonus when participating in a weblog writing challenge is that one may just happen upon some other interesting writers or posts. Which is, I suppose, one of the reasons the challenge even exists. There have been multiple reasons - excuses really - for why I've never done much writing for myself, the least of which being my internal thought that <em>I have nothing of interest for anyone to read</em>.</p>\n<p>Ah, but really though, is that the sole reason to write? No. I should write for myself, no matter how mundane I think the entry of the day will be. Have I been taking care of a child with a racking cough, who rends at my heart because there just isn't much that I can do for him? Yep, so I should write about that. Was I finally able to get some yardwork done because the incessant rain finally stopped? Yep, note it down.</p>\n<p>Why shouldn't I go on and just use a blog as a daily journal. It takes zero effort at this point and it's for my own good.</p>\n<p>For those that might be interested, including future me, <a href=\"https://brandons-journal.com/post/shame-and-blogging-redux\">here is the post that sparked</a> this entry.</p>\n<p>It's still early, so there may be more.</p>\n<h3 id=\"awards-and-stuff\">Awards and stuff <a class=\"direct-link\" href=\"#awards-and-stuff\">#</a></h3>\n<p>As parents we love to brag on our children. With five excellent young kiddos, I have no limit to the amount of praise that can be levied. Today has been no exception. We just returned from the fifth grader's surprise award presentation, where he received an Unsung Hero award from a local group. They choose two young students each year to honor, and we were pleasantly surprised when we found out he was chosen.</p>\n<p>Our kids are absolutely amazing and I look forward to seeing what they are able to accomplish.</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-14T15:00:00+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/not-so-triskaidekaphobic/",
      "url": "https://shanewrogers.lol/posts/not-so-triskaidekaphobic/",
      "title": "Not So Triskaidekaphobic",
      "content_html": "<p>Lucky number thirteen!</p>\n<p>I wasn't too certain that I was going to make this one, if I were to be completely honest. It's been a day full of watching a sick kiddo and trying to keep myself in check as well. To say that it has not been a great day would be an understatement at the least.</p>\n<p>We've had a couple of really long nights, as our youngest has been making his way into our room (which is not so different from the normal) and coughing up a storm (which is different from the norm). Hopefully he'll be able to get this thing beat soon.</p>\n<p>I will say that I'm lucky in that my job is very flexible in allowing us to e to care for family and self. I know that not everyone is so fortunate. For that, I am thankful.</p>\n<p>As an aside, I have finally been able to watch <strong>Dune Part Two</strong>, which was excellent. I had really wanted to see it in a theater but was never able to make it. The first <strong>Dune</strong> was actually the he first movie I saw in the theater after the world had began to open back up. Some might say post COVID, but I think that we all know we are still current COVID. Sigh.</p>\n<p>These entries have been good for just getting my mind settled and thawed out for the day. While nowhere near what I had intended to write about, I hope to be able to continue on this path. Whether anyone reads them or not, matters not to me.</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-13T23:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/nothing-to-see-here/",
      "url": "https://shanewrogers.lol/posts/nothing-to-see-here/",
      "title": "Nothing to see here",
      "content_html": "<p>Today is the twelfth of May. The last day of my vacation, yet another vacation where absolutely nothing was accomplished. I'd feel bad, but I generally don't get much done on these things. Who wants to work on their vacations. Normally I'd take a pair of weeks off, which would at least enable me to sorta almost get something done during the second week. But not this time.</p>\n<p>I'm sitting here at someone's home, of whom I have no idea who they are. Well, I guess it's a home, more a ranch. It's a really nice place. But, even then it's one of those deals where I don't know anyone here and really don't have much of a connection with anyone. All I can say and think is, <em>man, I couldn't even fathom owning this much land or this kind of property</em>.</p>\n<p>Thankfully we aren't going to be here long.</p>\n<h3 id=\"four-hours-later\">Four Hours Later <a class=\"direct-link\" href=\"#four-hours-later\">#</a></h3>\n<p>Give or take. It's after dinner, so it's time to catch up on some entertainment. Today it's <strong>Dead Boy Detectives</strong>. I seem to recall something about a possible spin off of these characters with an episode of <strong>Doom Patrol</strong>, but I could be wrong.</p>\n<p>So far it's pretty good.</p>\n<p>In other news, <em>Happy Mother's Day</em> to those that celebrate.</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-12T20:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/junk-food-for-thought/",
      "url": "https://shanewrogers.lol/posts/junk-food-for-thought/",
      "title": "Junk Food For Thought",
      "content_html": "<p>It's the eleventh of May. Saturday. A day to do not a whole lot. Same as tomorrow I guess.</p>\n<p>I've been trying for most of the day to come up with some kind of theme for todays post. I guess it's been staring me in the face for the day as well, if only I could open the proverbial eyes. It has actually been making its path through my hands, in front of my face and down the old gullet multiple times today.</p>\n<p>It's kind of funny, what is one person's junk food is not the same as every body else's junk food. What was junk food for me me years ago is completely off limits to me now, nor do I crave those items now. Thankfully. Today, my junk food is stuff like cheese, natural peanut butter, macadamia nuts. All high calorie stuff.</p>\n<p>When we first started keto, I thought that must difficult things to give to would be all the baked goods: cookies, biscuits, cakes, etc. I mentally gamed it, though, and was able to conquer those cravings. My first hump was getting past 220 and into the so-called <em>one-derland</em>. Now, that I've been past there, into the 170s, my new plateau is trying to get back below 180. I've continued to be in the 190s for longer than I like.</p>\n<p>I really need to get back into that track, stop snacking, get away from the peanut butter and dairy, start tracking everything that goes on my plate once again.</p>\n<p>I've started not feeling my best. I need to get there once again.</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-11T20:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/sponges-and-splashes/",
      "url": "https://shanewrogers.lol/posts/sponges-and-splashes/",
      "title": "Sponges and Splashes",
      "content_html": "<p>My original idea for this month, the challenge of posting a &quot;simple&quot; blog post each day, was to have myself read the &quot;Writing to Learn&quot; book and then give my thoughts on what I had read. This far, I have only succeeded at half of that challenge, having not really made much progress in the book.</p>\n<p>I do say that I'm not really all that surprised. I did take this week off of work, so did my spouse. Therefore I just don't really have much in the way of a desire to sit, read and contemplate. What o have been able to do, though, in stealing away a few bits of time here and there to write, has been of good use. It's been not quite cathartic, but very close, to get words out of my head and onto the screen.</p>\n<p>This morning was field day for the fifth grader. We signed up to assist the teachers with attempting to keep the students under some kind of control. Basically just ensuring that they didn't maim each other. I had myself stationed at what I'll refer to as the <em>sponge fighting</em> location. One of the handful of water areas that are set up. The idea here being that the kids pair up and toss a sopping wet sponge back and forth. If you can't catch the sponge, then you wring it out over your head. It's all good fun. It all more or less kind of devolves into &quot;let's just throw wet sponges at each other!&quot;</p>\n<p>We go back shortly to help out with the Montessori primary group - the kindergartners. It should be a lot of fun. Our six year old is very excited to have us there with him.</p>\n<p>Tonight is another performance, as well. The twins have the last major show for honor choir, which the class has been working towards for some time now. After that, then then of school. It's crazy, how quickly this year has gone by.</p>\n<p>It will soon be midsummer. Then it'll be turkey day. Then new years. Then...</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-10T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/another-day-another-waste/",
      "url": "https://shanewrogers.lol/posts/another-day-another-waste/",
      "title": "Another day another waste",
      "content_html": "<p>I think that I've come to where I would much rather be working. Work is enjoyable, vacations are nothing but just waiting to to back to work. It's not so much a dread for the end of the vacation, but just knowing that I never am able to accomplish what I would like to do during the time away from work.</p>\n<p>Not that I'm disparaging the vacation. I'm equal opportunity when it comes to not being a fan of not working, I'm not really big on weekends either. Granted I'd probably to absolutely insane if I did nothing but work. One has to have some time off.</p>\n<p>Where I work, we get plenty of paid leave to earn. Eight hours per every Eighty hour work period, up to a maximum of 304 hours. Of which I am routinely butted up against. Plus, a discretionary holiday. I really should take more time for myself, I'm told multiple times by multiple people that I should.</p>\n<p>But, alas.</p>\n<p>The current question then becomes, do I feel that anything has been accomplished during this break. There was some yardwork done. The car was washed, by hand, even! I may have gotten the yard mowed once. It just always feels like there is something that needs to be done.</p>\n<p>Meh.</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-09T17:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/the-eighth-day-is-an-early-day/",
      "url": "https://shanewrogers.lol/posts/the-eighth-day-is-an-early-day/",
      "title": "The Eighth Day is an Early Day",
      "content_html": "<p>It's the eighth day of the month. I got to drop the older two boys off for zero hour honor choir a little early this morning, 6:50AM instead of 7:00AM. One wouldn't think that 10 minutes would make much of a difference, but it certainly can. We did get there in time, so yay. Of course, for me just being some place <em>on time</em> actually means that <em>I'm late</em>. Now, if I could only get my spouse to adhere to that philosophy. 😂</p>\n<p>This morning, and tomorrow morning, will both be basically the same. The twins have a music performance on Friday that is the big finale for the year. Tonight we also have a band concert for one of them. Like I said the other day, it's gonna be a full week. It <em>has been</em> a full week.</p>\n<h3 id=\"mobile-editing\">Mobile editing <a class=\"direct-link\" href=\"#mobile-editing\">#</a></h3>\n<p>I think I may have finally found a decent markdown editor that can sync with my git blog repo: <a href=\"https://play.google.com/store/apps/details?id=org.eu.thedoc.zettelnotes\">Zettel Notes</a>. Well, sure, there have been others that can sync and work, but I think I really prefer this one for some reason. Probably because it can actually move files around when requested as opposed to copying them.</p>\n<p>I think the only thing that I would like to be able to do from mobile (apart from easier photo uploads, but someday maybe) would be running the eleventy test server. Other than that, I'm pretty content with what's available now.</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-08T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/and-on-the-seventh-day/",
      "url": "https://shanewrogers.lol/posts/and-on-the-seventh-day/",
      "title": "And on the seventh day",
      "content_html": "<p>Aye, and on the seventh day yet another post has appeared! We are coming up on the end of another school year for our kids, another year that continues to speed on past us. The next few weeks are going to be very full of events. Along with the full schedules, comes special types of stress.</p>\n<p>Stress. Along with most people, I would imagine, I am not a fan. Some people stress eat, thankfully I am not one of those. I eat out of boredom. At least this is something that I am aware of. I've been trying to eat better for a handful of years now, some would say successfully. My wife and myself opted to go the ketogenic journey and I have kept a out 145 pounds off my frame for some time now. Three thirty plus to one eighty five, give or take.</p>\n<p>Okay, so where am I going in all of this rambling? As I get older, as I watch my kids grow into greater ages, I made a decision that I wanted to see them get older. I knew that if I had continued on in the direction that I was going, that I'd be in a grave within very little time. I have no doubt that I have avoided diabetes and at least taken one foot off of the banana peel, so to speak. Not to mention feeling much better and, hopefully, modeling a healthier behavior for my children.</p>\n<p>No rest for myself on this day, though. The second day of my vacation and I've done little to nothing that I would like to get done. Ah, but then who really wants to do pre-spring cleaning on their vacations.</p>\n<p>Read the rest of my <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts.</p>\n",
      "date_published": "2024-05-07T18:00:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/a-day-of-waxing-philosophically/",
      "url": "https://shanewrogers.lol/posts/a-day-of-waxing-philosophically/",
      "title": "A day of waxing philosophically",
      "content_html": "<p>It's day the next around these parts. For whatever that means, right? I've not made nearly the progress on my book that I'd like to, so today's entry will be another one of those &quot;day in the life of&quot; ordeals. I might even be able to make this interesting, but I wouldn't let odds down.</p>\n<p>This year I turn 47. Not quite the same as when one turns 40, though let's be honest here, I don't think my 40th was anything all that spectacular. Nor is it quite the same as turning 50, I'm guessing. As I get older and watch my kids get older, I can't help but think that it really wasn't all that much long ago that I was their age, almost in their shoes, going through similar phases. I've tried to do my absolute best buy my kids. My Dad, who I love, has probably told me that he loves me only a handful of times. I know he does, but I've tried to reverse that trend with my boys.</p>\n<p>I think back to some of the points in my life, I try to correlate how old my kiddo's are, to how old I was, to how old my Dad was (or, would have been at that time). I always wonder what would have been going through his mind. It's just strange, trying to put myself into his place. There are differences between the two of us, there is no doubt there. As parents, we try to ensure that our children have access to things that we never had - or, in my case things that I never knew that I should have or would have wanted. Things as simple as high school yearbooks.</p>\n<p>I didn't go to a large high school, nor did I have an over abundance of friends, nor did I ever think that I would want to ever reminisce about those years of my life. Of course, growing up I think I must have thought that yearbooks just magically showed up at school on yearbook signing day. It never would have occurred to me that there was an (at times) significant cost involved. My kids may not realize it now, but they'll be thankful for those, at least, in the future.</p>\n<p>Yes, we love our kids and want the best for them. Though, what parent does not.</p>\n<p>Anyway, with that I think we shall close out this day.</p>\n<p>Read the rest of my <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts.</p>\n",
      "date_published": "2024-05-06T20:00:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/it&amp;#39;s-the-fifth-day/",
      "url": "https://shanewrogers.lol/posts/it&amp;#39;s-the-fifth-day/",
      "title": "It&#39;s the fifth day",
      "content_html": "<p>This is the fifth day of the challenge! Yesterday was an attempt to post something using the GitJournal app, which sort of worked, but didn't work quite as smoothly as one would have liked. It failed to save the new file in the appropriate folder, though I'm fairly certain I saved it where it needed. Then when trying to move it, it does a copy instead.</p>\n<p>Which plays havoc with the push to git and the workflow run. Sigh.</p>\n<p>So, in my attempt to both come up with a post today <em>and</em> perhaps a decent mobile way to post, today is just straight into the github web site and add a new post. Is it preferable? Absolutely not.</p>\n<p>In other news today, I was able to get the yard mowed before it rained. I've got this feeling that for the next month or so it's basically going to be &quot;mow whenever you flippin' can&quot;. Otherwise, my old battery operated Snapper just - literally - isn't going to cut it.</p>\n<p>Well, off to the store. Tonight is homemade tomato soup and grilled cheese with smoked gouda. Perhaps a tasty antipasto salad as well.</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-05T20:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/day-four-nothing-more/",
      "url": "https://shanewrogers.lol/posts/day-four-nothing-more/",
      "title": "Day Four, Nothing More",
      "content_html": "<p>Here we are at day for during this monthly challenge. The next couple of days are going to be the first two that present as very difficult for me - will I be able to get something posted during the weekend, while the home is filled with family and kids and I would rather <em>not</em> be dealing with a computer.</p>\n<p>So in that case, I am not using a computer or laptop for the post. Instead I'm seeing how well the <a href=\"https://gitjournal.io/\">GitJournal</a> app works on my phone. I don't really have any other content management system set up here, so this really needs to work.</p>\n<p>Maybe this would be a good excuse to set up a Ghost CMS for the front end. Probably not, though.</p>\n<p>I've done no reading today, so that's a negative. I did check out the Samurai Jack series from the local library, I'm looking forward to giving that a watch!</p>\n<p>With that....till next time.</p>\n<p>Check out the other <a href=\"/tags/weblogpomo2024\">#Weblogpomo2024</a> posts.</p>\n",
      "date_published": "2024-05-04T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/here-we-go-day-three/",
      "url": "https://shanewrogers.lol/posts/here-we-go-day-three/",
      "title": "Here we go day three",
      "content_html": "<p>It's day three of Weblog Posting Month 2024!</p>\n<p>Whew!</p>\n<p>I'll be honest, I was beginning to wonder if I was going to make it today. Today has been challenging, to say the least, so I will be putting off today's reading of the &quot;Writing to Learn&quot; book.</p>\n<p>&quot;Why is that?&quot; - I hear absolutely noone asking. Well, I'll tell you anyhow. I do much of my blog posting through <code>emacs</code> using <code>org-mode</code> capture templates. My current <code>emacs</code> configuration is a semi modified <a href=\"https://github.com/doomemacs/doomemacs\">doom emacs</a> build which has worked very well for me in the past and continues to do so in the present. Generally. I don't know if I had some kind of hardware issue (which is possible, as my config is hosted on a local NAS with used drives) due to perhaps a recent storm, but my org capture templates were just not working at all. Even after a <code>doom doctor</code>, <code>doom purge</code>, <code>doom build</code> cycle...nothing worked.</p>\n<p>Which necessitated a <em>nuclear option</em> of a fresh git checkout of doom and starting over. It's not really a complete do over, though, since I still have my private/personal doom init files that live in a different directory.</p>\n<p>All in all, after about an hour and ten minutes of waiting for the build process to finish (ugh...) we are back to par. Yippee.</p>\n<h3 id=\"the-actual-challenge\">The actual challenge <a class=\"direct-link\" href=\"#the-actual-challenge\">#</a></h3>\n<p>Everything stated, I have actually read a bit of the next chapter, and all of the above was initiated because I wanted to take a handful of notes. One item in particular, about clear writing being evidence of clear thinking. Something of which I really need to strive to do - think clearly. With that, and just a little bit of focus, perhaps I can write clearly.</p>\n<p>Read my other <a href=\"/tags/weblogpomo2024\">#WeblogPoMo2024</a> posts.</p>\n",
      "date_published": "2024-05-03T19:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/another-day-another-chapter.-day-two./",
      "url": "https://shanewrogers.lol/posts/another-day-another-chapter.-day-two./",
      "title": "Another Day, Another Chapter. Day Two.",
      "content_html": "<p>The second day brings with it a second chapter of the <a href=\"https://www.harpercollins.com/products/writing-to-learn-william-zinsser?variant=42347013505058\">Writing To Learn</a> book. To be completely fair, I had read about half of this yesterday and have finished it up this morning. To be even more fair, it will be highly probable that I'll read chapter 3 and add more to this post today as well. Let us find out what has been digested this go round, shall we?</p>\n<h3 id=\"gustavus-adolphus-college\">Gustavus Adolphus College <a class=\"direct-link\" href=\"#gustavus-adolphus-college\">#</a></h3>\n<p>Right out of the gate I learned something. While even the author, Zinsser, did believe that everybody should be able to write - he did literally write the book on the subject - the idea of <em>Writing Across the Curriculum</em> came from the small Midwestern College of <a href=\"https://en.wikipedia.org/wiki/Gustavus_Adolphus_College\">Gustavus Adolphus</a>. Or, at least as well as I can tell according to the text. Even at that point in history (jeeze, only 1985) the professors had a need and a want to move the responsibility of teaching students to write away from the &quot;English&quot; Department. Which makes complete sense to me. We write - or should write - about more than just, well, previously written materials (books, plays, what have you). Noted within this chapter are numerous other great sources of written material - from beautiful mathematic proofs, to how the periodic table of the elements are arranged and why.</p>\n<h3 id=\"a-puzzle-of-the-humanities\">A puzzle of the humanities <a class=\"direct-link\" href=\"#a-puzzle-of-the-humanities\">#</a></h3>\n<p>An interesting point was brought up during my reading today. If one's mind likes to work though puzzles, finding solutions to whatever has been presented to you, then perhaps no matter what the subject matter is it could be possible to find an intriguing route to write about said solution. As an example, the author has noted multiple times that they did not care for chemistry in school. Maybe if some of the work had been phrased the way that <a href=\"https://en.wikipedia.org/wiki/Dmitri_Mendeleev\">D I Mendeleev</a> had worked out the <em>Periodic Law</em> and creating a version of the <em>Period Table of the Elements</em>, then that challenge would have had a more positive effect on him. If there is some way to find a human element to whatever subject matter is being studied or written about, that seems to help a great deal.</p>\n<h3 id=\"a-feeling-of-rambling\">A feeling of rambling <a class=\"direct-link\" href=\"#a-feeling-of-rambling\">#</a></h3>\n<p>I'm doing it again - I feel like I'm just kind of rambling on. I should tighten this stuff up. Meh.</p>\n<p>Let us finish up with a couple of quotes from the chapter that have kind of stuck with me:</p>\n<blockquote>\n<p>Students should be learning a strong and unpretentious prose that will carry their thoughts about the world they live in.</p>\n</blockquote>\n<p>and</p>\n<blockquote>\n<p>...every subject is interesting if an avenue into it can be found that has humanity and that an ordinary person can follow.</p>\n</blockquote>\n<p>These ring well with me. I'm no journalist, no professional writer for sure. But I have read a wide variety of subjects, books, magazines, articles...those that leave the best impression are of the style that don't belittle or &quot;talk down&quot; to the reader. I find it sad that today we are losing a large amount of written work that may never be. Amazing magazines that have stopped printing. Journals that are no longer around. Yes, I am aware of the irony that any readers of this material are doing so on a media that involves a screen. It's easier, but only in so many ways.</p>\n<p>The challenge is finding it.</p>\n<p>Read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts.</p>\n",
      "date_published": "2024-05-02T14:00:56+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/writing-to-learn-weblog-posting-month-2024/",
      "url": "https://shanewrogers.lol/posts/writing-to-learn-weblog-posting-month-2024/",
      "title": "Writing to learn - Weblog Posting Month 2024",
      "content_html": "<p>Well it's finally here: my first entry into Annie's <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">Weblog PoMo 2024</a>. As with most things that I do when it comes to writing, I haven't really planned this out. Does that mean that I'm most likely going to fail at it? That is a definite possibility. But I'm willing to at least give it a shot for myself.</p>\n<p>Of course, there is nothing like getting an <a href=\"https://echofeed.app/\">Echofeed</a> set up for it to help with some accountability - up to and including having the <a href=\"https://beep.town/@echofeedamplify\">Amplify Bot</a> boost your stuff.</p>\n<p>With that out of the way, let's get the ball rolling on <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a>!</p>\n<h3 id=\"writing-to-learn\">Writing to learn <a class=\"direct-link\" href=\"#writing-to-learn\">#</a></h3>\n<p>Or something like that. Writing to learn, writing to keep yourself accountable, whatever the reason it's a good skill to have. It's not necessarily something that one actually appreciates when they are younger. I graduated high school in 1995 and was fortunate enough to have had a couple of college level courses that we were able to take during our senior year - including an English course that included at least one paper. It was a great start on my college and university stint.</p>\n<p>When I did eventually enroll and find myself in college, part of our curriculum was a <a href=\"https://en.wikipedia.org/wiki/Writing_across_the_curriculum\">Writing to learn</a> selection of courses - I believe that we needed required to take two or three of these. The idea - at the time at least - was something that I can't say I was too overly fond of. I was going to be a Computer Science major and didn't feel that I needed to &quot;Write to Learn&quot;. Of course, I did though.</p>\n<p>It wouldn't be until much, <strong>much</strong> later that I would find the source of this sound reasoning: <a href=\"https://www.harpercollins.com/products/writing-to-learn-william-zinsser?variant=42347013505058\">William Zinsser's Book</a>. At least, I assume this to be the source. My plan, my goal, is to actually read this book. I don't think it to be too much to ask. I've already got one chapter down and I find that I really like the flow and the style. So, part of what I write about this month is going to include some of my thoughts on the book.</p>\n<p>This isn't going to be some great article series, no doubt about that. But I do hope that I'm able to improve a bit on my writing, maybe it can even become a habit to write more. I don't think I could hope to be able to write <em>better</em>, I find that I'm pretty well stuck in my ways on that account.</p>\n<p>I will end this entry with a bit of an anecdote. Not long after I moved to Lawrence, I found myself sitting at a local restaurant eating a meal. Behind me sat a couple of who I will assume to be professors from the university and they were having a conversation. The subject of students not knowing how to write papers came up, which was kind of a surprise to me. This was quite some time ago, but from what I can recall I do remember thinking to myself how sad and disturbing that was. How could students in this (that?) day and age make it through high school and into college or university and not know how to write?</p>\n<p>I can only imagine that now, it's a problem that has not gotten any better. Writing is becoming a lost art it seems.</p>\n",
      "date_published": "2024-05-01T16:19:52+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/things-i&amp;#39;m-learning/",
      "url": "https://shanewrogers.lol/posts/things-i&amp;#39;m-learning/",
      "title": "Things I&#39;m Learning",
      "content_html": "<p>For those of you who follow my pixelfed feed, you may have seen the following image</p>\n<iframe title=\"Pixelfed Post Embed\" src=\"https://pixelfed.social/p/swrogers/690632497756857978/embed?caption=false&likes=false&layout=compact\" class=\"pixelfed__embed\" style=\"max-width: 100%; border: 0\" width=\"400\" allowfullscreen=\"allowfullscreen\"></iframe><script async defer src=\"https://pixelfed.social/embed.js\"></script>\n<p>While it's only tangentially related to what I do at work, it's something that is actively encouraged for us to do - continue to learn. I figure since I am around Oracle Databases all the time, I should probably widen my breadth of knowledge a bit.</p>\n<p>Who knows, I might even be able to add to my repertoire.</p>\n<h3 id=\"possible-future-notes-to-self\">Possible future notes to self <a class=\"direct-link\" href=\"#possible-future-notes-to-self\">#</a></h3>\n<p>I'm wondering how feasible it might be to have echofeed (perhaps) cross post from pixelfed into this github pages hosted site. I know I could do an rss feed pull. Of course, then I'd need some way to ensure that doubled (or more...) posts aren't sent out via echofeed to the mastodon account. I'm sure that other people have solved this issue, though. Heh.</p>\n",
      "date_published": "2024-04-30T15:26:37+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/weblog-posting-month-2024/",
      "url": "https://shanewrogers.lol/posts/weblog-posting-month-2024/",
      "title": "Weblog Posting Month 2024",
      "content_html": "<p>I think I'm going to try to do something that will be very difficult for me. I've decided to join the group in a <em>post every day during the month of May</em> challenge that has been dubbed <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">#WeblogPoMo2024</a>.</p>\n<p>I shall be using the same tag here, <a href=\"/tags/weblogpomo2024\">as well</a> for sake of categorization. I guess it's likely  that I'll even start using the echo feed account that I've been paying for.</p>\n<p>We'll see how this goes. I was able to do the &quot;post a photo every day for 30 days&quot; thing over on microblog to get that badge, which wasn't super easy for me either.</p>\n",
      "date_published": "2024-04-29T21:29:26+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/and-now-for-something-different/",
      "url": "https://shanewrogers.lol/posts/and-now-for-something-different/",
      "title": "And Now For Something Different",
      "content_html": "<p>Ah and now for something (not so?) completely different! For those of you who have been following along at home - which, I suppose, would really just be me, myself and I - I've made some changes to the site.</p>\n<p>No longer is the static site based on Eleventy Duo. Welcome, instead, to <a href=\"https://github.com/google/eleventy-high-performance-blog\">eleventy high performance blog</a>. Being a tinkerer does at times really, really suck. Never being happy or content with the way things are on the old blog.</p>\n<p>The change actually went a lot smoother than I was anticipating it going. I cloned the new template to a clean directory. Made the changes that I needed to make to it (at least, started them - I'm sure more will come). Renamed the remote origin and added a new remote origin. Then, over in my now old and stale github repo I renamed the 'main' branch, added a new 'to migrate' branch, then went back to the new template and did the ol' something of a force push to the new branch on my static site repo.</p>\n<p>Once that was done, I had to rename the local and remote repos back to main and set the new default branch.</p>\n<p>Thankfully, things still just worked after that! Had to make a single change to the emacs org capture template to ensure the directory for the posts was good...now, I think we're golden.</p>\n<p>Or at least a decent shade of pale yellow.</p>\n",
      "date_published": "2024-04-29T20:29:44+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/just-a-handful-of-notes-please/",
      "url": "https://shanewrogers.lol/posts/just-a-handful-of-notes-please/",
      "title": "Just a handful of notes please",
      "content_html": "<p>We shall go ahead and tag this one into the <a href=\"/tags/rambling\">rambling</a> series, why not? Kind of a small update of a few things that have happened over the course of the last couple of days I suppose.</p>\n<h2 id=\"i'm-really-bad-a-blogging\">I'm really bad a blogging <a class=\"direct-link\" href=\"#i'm-really-bad-a-blogging\">#</a></h2>\n<p>Point taken, I'm not really good at sitting down and getting something on digital paper every single day. Granted, I'm not good at sitting down and getting something put on actual real paper, either. At least I'm equal opportunity when it comes to writing. Which I find a little sad, since it is something that I enjoy doing. I'm trying, though.</p>\n<p>The end of last week was really good, though. Our twins performed in one of the local plays and three of the performances were last Thursday, Friday and Saturday. I (well, my spouse and I both) are beyond proud of them (again, all of our kids, actually) for doing things that I could never have even thought of doing when I was their age. &quot;What, get up on stage and act?! No thank you.&quot; I'm very, very introverted. The thought of doing a play (or musical!) would petrify me. The musical they did as well, earlier in the year, so yeah!</p>\n<p>They did exceedingly well. I can not brag on my kids enough.</p>\n<h2 id=\"i'm-also-bad-at-reading-self-help-books\">I'm also bad at reading self help books <a class=\"direct-link\" href=\"#i'm-also-bad-at-reading-self-help-books\">#</a></h2>\n<p>Yeah, not that I have a whole <strong>lot</strong> of self help books, but I have picked up a couple of them that really interested me. I'd found a hardback copy of <em>William Zinsser's Writing to Learn</em>, which just seemed very cool and might perhaps help out with this personal site of mine. Guess how much of it I've read? A couple of pages. But enough I know that I think I'll really like the style. Ha.</p>\n<p>Next, I finally got my copy of <em>Brain Hacks</em>, by <em>Lara Honos-Webb</em>, which seems like it could help with some organizational skills that frankly any of us could use. It was actually recommended to one of the previously mentioned twins above that he should read it for one of his projects. So he is. I don't know that he's gotten much out of it - but hopefully more than I have, as I've read an astounding two pages in it. Sigh.</p>\n<h2 id=\"i'm-better-at-reading-for-enjoyment\">I'm better at reading for enjoyment <a class=\"direct-link\" href=\"#i'm-better-at-reading-for-enjoyment\">#</a></h2>\n<p>I will admit, that I do actually enjoy reading and am continuing to work my way through <em>The Expanse</em> novels. Currently reading <em>Nemesis Games</em> in what spare time I can steal. I'm also reading <em>The Dark Elf Trilogy</em> to at least one of the twins, we just got into the second book the other week. This is the second go through of this series for me.</p>\n<h2 id=\"other-news%3F\">Other news? <a class=\"direct-link\" href=\"#other-news%3F\">#</a></h2>\n<p>I always feel like I should put something down about the current state of this site. I don't know why. I'm happy with it, but not really super happy with it. I guess it's a great medium to just be able to get words down. I don't really care too much for the theme or the look of the site, but then I don't have the time to put into making it any better. I'd like to do more with webmentions and other indieweb stuff - but then I also don't do a whole lot with social media, period. It's tough.</p>\n<p>I like to write, I'll continue to write, whether or not people read really doesn't concern me.</p>\n<p>We'll leave it at that.</p>\n",
      "date_published": "2024-04-22T21:04:04+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/not-another-new-server/",
      "url": "https://shanewrogers.lol/posts/not-another-new-server/",
      "title": "Not another new server",
      "content_html": "<h2 id=\"another-fediverse-server%3F!\">Another Fediverse Server?! <a class=\"direct-link\" href=\"#another-fediverse-server%3F!\">#</a></h2>\n<p>No, I don't have <em>yet another fediverse server instance</em> stood up.</p>\n<p>Not for some lack of trying, mind you, I just don't have the energy to put into working through all the nits and nats that are involved with ruby. I shudder to think. I've never really been a huge fan of that whole ecosystem.</p>\n<p>It's not as bad as the JavaScript world, but it's not fun to navigate for me either.</p>\n<p>I was wanting to get a <a href=\"https://diasporafoundation.org/\">Diaspora</a> instance set up on a digital ocean droplet, but decided against it. Then, to follow along in some other rabbit hole, I signed up on Yet Another ActivityPub Instance, in the form of <a href=\"https://akkomane.social/@shane\">Akkomane Social</a>. It seems nice, thus far.</p>\n<p>In other news, yeah - it's been a week.</p>\n<p>It's also only Wednesday.</p>\n",
      "date_published": "2024-04-17T21:17:08+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/my-eleventy-inspirations/",
      "url": "https://shanewrogers.lol/posts/my-eleventy-inspirations/",
      "title": "My Eleventy Inspirations",
      "content_html": "<h2 id=\"where-i've-drawn-inspiration-from\">Where I've drawn inspiration from <a class=\"direct-link\" href=\"#where-i've-drawn-inspiration-from\">#</a></h2>\n<p>I figure that this is as good a time as any to make some sort of attempt at getting down on &quot;paper&quot; those sites that I've looked at and drawn some sort of inspiration from in the creation of my site. Not that my site is anything special, but it'll be good for the hypothetical <em>future me</em> to be able to go back and see where things have come from.</p>\n<p>Granted, it's possible that a lot of these are also noted under my Eleventy <a href=\"http://Raindrop.io\">Raindrop.io</a> collection, but, you know - content and stuff.</p>\n<p>This page will probably be something of a living page for a bit.</p>\n<style>\nul { list-style-position: outside; }\n</style>\n<ul>\n<li>\n<p><a href=\"https://github.com/yinkakun/eleventy-duo\">The Site Theme.</a></p>\n<p>It's clean and I like it.</p>\n</li>\n<li>\n<p><a href=\"https://ttntm.me/blog/creating-a-reading-list-with-eleventy-and-omnivore/\">Creating a Reading List</a></p>\n<p>Was very useful in some of the ideas of my drops page and similar. I also really like some of the other ideas that present themselves throughout the site in general - such as the main homepage landing area.</p>\n</li>\n<li>\n<p><a href=\"https://www.simoncox.com/shorts/2024-03-17-11ty-collection-tag-links/\">11ty collections tag links</a></p>\n<p>Some implementation info on collections.</p>\n</li>\n<li>\n<p><a href=\"https://nicolas-hoizey.com/articles/2023/02/08/a-bookmarklet-to-create-a-new-link-content-markdown-on-github/\">A bookmarklet to create a new link content Markdown on GitHub</a></p>\n<p>Used for the bookmarklet to add a new link entry.</p>\n</li>\n<li>\n<p><a href=\"https://another.rodeo/linkroll/\">11ty Linkrolls</a></p>\n<p>Used in conjunction with the above to roll my own link roll page. (See what I did there?)</p>\n</li>\n<li>\n<p><a href=\"https://www.raymondcamden.com/2022/03/08/including-rss-content-in-your-eleventy-site\">Including RSS Content</a><br>\n<a href=\"https://www.raymondcamden.com/2022/04/03/including-rss-content-in-your-eleventy-site-part-2\">...and part 2</a></p>\n<p>Using rss-parser and some other details with pulling rss data into a site. Plus, Raymond has an amazingly large amount of <a href=\"https://www.raymondcamden.com/tags/eleventy\">eleventy tagged</a> content on his site!</p>\n</li>\n</ul>\n<h3 id=\"now-for-stuff-that-i'd-like-to-consider-for-future-reference%3A\">Now for stuff that I'd like to consider for future reference: <a class=\"direct-link\" href=\"#now-for-stuff-that-i'd-like-to-consider-for-future-reference%3A\">#</a></h3>\n<ul>\n<li>\n<p><a href=\"https://github.com/lwojcik/eleventy-template-multiplicity/tree/main\">Multiplicity Theme</a></p>\n<p>This I really wouldn't mind including as an RSS reader/source.</p>\n</li>\n<li>\n<p><a href=\"https://rknight.me/blog/using-eleventy-to-gobble-up-everything-i-do-online/\">Using Eleventy to Gobble Up Everything I Do Online</a></p>\n<p>The author of this page also is the creator of the <a href=\"https://github.com/rknightuk/echo\">Echo service</a> (both for self host and hosted), and I am considering using that to enable posting on other social platforms as well. That said, this site is a great resource for pulling in other sources of data into Eleventy.</p>\n</li>\n<li>\n<p><a href=\"https://coryd.dev/\">Cory Dransfeldt's Blog</a></p>\n<p>Just lots of good content here, including <a href=\"https://coryd.dev/posts/2024/automatic-mastodon-post-embeds/\">embedding mastodon posts.</a></p>\n</li>\n<li>\n<p><a href=\"https://darn.es/mastodon-post-web-component/\">mastodon-post web component</a></p>\n<p>From David Darnes, this component used within the previous link. I do have a branch of my site that uses this, but I'm not put it into production yet. I'm up in the air about it.</p>\n</li>\n<li>\n<p><a href=\"https://github.com/nhoizey/github-action-feed-to-mastodon\">Github Action Feed to Mastodon</a></p>\n<p>Sends json sourced feed into a Mastodon instance. This is also referenced from the previous set of links, though I don't believe it's a requirement on its own. This could - possibly? - be superceded by Echo.</p>\n</li>\n<li>\n<p><a href=\"https://11tybundle.dev/firehose/\">11tybundle.dev firehose</a></p>\n<p>Anything and everything 11ty.</p>\n</li>\n<li>\n<p><a href=\"https://sia.codes/tags/eleventy/\">Sia dot Codes Eleventy Items</a></p>\n<p>Another popular and excellent source of information on the eleventy's.</p>\n</li>\n<li>\n<p><a href=\"https://11ty.rocks/community/\">11ty Rocks! Community Feed</a></p>\n<p>Some good entries from around the horn here, plus some other valuable posts as well of their own.</p>\n</li>\n<li>\n<p><a href=\"https://blog.lukaszwojcik.net/eleventy-custom-markup-alongside-item-contents/\">Eleventy: custom markup alongside item contents</a></p>\n<p>Nifty use of markdown and customization.</p>\n</li>\n</ul>\n",
      "date_published": "2024-04-11T18:10:44+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/another-day-down/",
      "url": "https://shanewrogers.lol/posts/another-day-down/",
      "title": "Another Day Down",
      "content_html": "<h2 id=\"yeah-it's-my-rambling-series%2C-so-what%3F\">Yeah It's My Rambling Series, So What? <a class=\"direct-link\" href=\"#yeah-it's-my-rambling-series%2C-so-what%3F\">#</a></h2>\n<p>If it's one thing that I've noticed of late, it's that I must really enjoy rambling about nothing in particular. I suppose that's fine, of course, because it's good practice for any <em>actual</em> writing that might come from this site.</p>\n<p>Of course, I think that we all know there we never be any <em>actual, real</em> writing on this site. Who am I fooling, anyway?</p>\n<h2 id=\"last-time-on...\">Last Time On... <a class=\"direct-link\" href=\"#last-time-on...\">#</a></h2>\n<p>When last we joined in the great adventures of <em>nobody in particular</em> we had the washer and dryer in place. Not running or working, mind you. Because life is a fickle little something or other. I don't know who was in charge, or what they were smoking, or even what was running through their mind when it was decided by the powers that be that it was all &quot;A Okay&quot; to ship a meager six foot dryer power cord along with a pre-stacked washer and dryer unit.</p>\n<p>Especially when the electrical connection is at the upper back (we'll call it the upper right corner, looking at the thing from the back side) of the over six foot tall unit. Can you guess where I'm going here? Our laundry room is set up to accommodate side by side units. As I would wager most peoples' places are. Normally, this is not a problem. The power cord they ship (which, we have to purchase, naturally) didn't reach the dryer plug outlet on the wall by, oh, six inches. Not that it matters how short it was - it just flat out didn't reach.</p>\n<p>Of course nobody in town has a replacement dryer cord that we could pick up the same day. So, as we've already read, we got one from amazon. A nice, ten footer. It reached no problem. All said and done, installed, working great! Finally, clean clothes!</p>\n<h2 id=\"state-of-my-blog\">State Of My Blog <a class=\"direct-link\" href=\"#state-of-my-blog\">#</a></h2>\n<p>I've made some changes on the linkages up top, as well as the intro paragraph on the homearea page. I even have a newly opened branch where I've got David Darnes <a href=\"https://github.com/daviddarnes/mastodon-post/tree/main\">mastodon-post</a> Web Component up and running (with a nod towards <a href=\"https://coryd.dev/posts/2024/automatic-mastodon-post-embeds/\">Cory Dransfeldt's</a> set up as well). It needs some love and I'm not sure it'll ever go live, I don't know. I'd want to perchance get a shortcode template set up to make it simpler for my needs.</p>\n<p>With that, we'll call that an entry. I think I'm doing a little better, I might even expand my writing to more than waxing about this silly site that I'm making.</p>\n",
      "date_published": "2024-04-10T17:30:14+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/sometimes-one-wonders/",
      "url": "https://shanewrogers.lol/posts/sometimes-one-wonders/",
      "title": "Sometimes one wonders",
      "content_html": "<h2 id=\"for-crying-out-loud\">For Crying Out Loud <a class=\"direct-link\" href=\"#for-crying-out-loud\">#</a></h2>\n<p>I'm sure that I'm not alone in this wondering, when sometimes it seems as though all the cards, all the world - heck <em>all the cards in all the world</em> just seem to be lined up against you. These past couple of weeks have been a grand example of that for this household.</p>\n<p>We had purchased a certain brand (<em>cough</em> Samsung <em>cough</em>) washer and dryer. Said brand evidently makes really crappy dryer drums that like to crack and break and basically vomit all over themselves. They don't admit this, of course, and they aren't taking care of the problem. So we bought another brand in a single stacked unit. Because ours is a household that is very OCD about having things be the same. Plus, the stacked unit has the controls in the middle for the short people in the home. Plus we now have a little extra storage room in the washer and dryer room.</p>\n<p>The first couple of guys who delivered the unit weren't the brightest bulbs in the garden. They either didn't know how to unhook the old units, or didn't know that &quot;Yes, Alice, there is going to be a little water that leaks out of the old hose&quot;. So they wouldn't finish the install, leaving the new unit in our garage.</p>\n<p>Fast forward to today, we get the old units removed and the new unit in place. Yes! Oh, what's this? The power cord goes from the top far corner of the unit and is about two (2) feet too stinking short?! No!! Dammit.</p>\n<h2 id=\"misery-is-a-beast\">Misery is a beast <a class=\"direct-link\" href=\"#misery-is-a-beast\">#</a></h2>\n<p>Yeah. So, we were super stoked to get the new unit. Now we're basically at the point where we don't even wanna see the flipping thing in the home. But there it is, mocking us. Just sitting there, all unplugged. Laughing at us. No place in town sells a 10 foot four prong dryer cord. Now, we wait for the order from our saviour...amazon. Ugh.</p>\n<p>We really were hoping to get some laundry done today.</p>\n<h2 id=\"on-the-bright-side\">On the bright side <a class=\"direct-link\" href=\"#on-the-bright-side\">#</a></h2>\n<p>We did get to see some of the eclipse today! So much better than 2017, when it was terribly cloudy and overcast. This one reminded me of when I was in high school (mid 90s) and we also got to experience an eclipse. Very cool.</p>\n<p>With that - until next time.</p>\n",
      "date_published": "2024-04-08T18:20:28+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/more-updates-and-stuff!/",
      "url": "https://shanewrogers.lol/posts/more-updates-and-stuff!/",
      "title": "More Updates and Stuff!",
      "content_html": "<h2 id=\"more-things-added-around-here\">More things added around here <a class=\"direct-link\" href=\"#more-things-added-around-here\">#</a></h2>\n<p>I've added my <a href=\"/links\">links</a> page now, along with a super nifty bookmarklet that I can use to add new links from the browser. I'm sure that if anybody were to do any kind of digging on the interweb, they'd know where I was able to grab some of the implementation details from. Of course, we all make our own nifty little changes, and I was no different.</p>\n<p>For one, I don't like a bunch of folders and <em>index.html</em> files all over the place - so that had to go.</p>\n<p>One thing that I've noticed, here in the land of emacs, is that my capture session seems to have run into some interesting kinks. Oh, I bet it didn't like the <em>!</em> I used in the filename...what was I thinking!?</p>\n<p>Anyway.</p>\n<h2 id=\"where-was-i%3F\">Where was I? <a class=\"direct-link\" href=\"#where-was-i%3F\">#</a></h2>\n<p>Oh yes - I wanted to kind of explain my thinking on having <em>both</em> <a href=\"/drops\">drops</a> <strong>and</strong> <a href=\"/links\">links</a>. To me, the <em>drops</em> are for pages that I want to ensure never go away. A <em>read it later</em>, if you will. The service I use (<a href=\"https://raindrop.io\">raindrop.io</a>), takes care of that for me since I'm a subscriber. <a href=\"/links\">Links</a>, on the other hand, I don't care if those stick around or not. Plus, those actually get saved as files in the repo, as opposed to the drops, which are ephemeral data from the ether.</p>\n<p>That's my thinking, anyhow.</p>\n<p>All said and done, I think for now I'm more or less finished with the structure of the site. Now, I just need more content - which will come with time. Then I can set up paging with whatever needs it. That, and get some rss feeds finalized, along with cross posting.</p>\n<p>Till next time.</p>\n",
      "date_published": "2024-04-05T20:42:04+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/oh-for-crying-out-loud!/",
      "url": "https://shanewrogers.lol/posts/oh-for-crying-out-loud!/",
      "title": "Oh for crying out loud!",
      "content_html": "<h2 id=\"all-i-can-do-is...\">All I can do is... <a class=\"direct-link\" href=\"#all-i-can-do-is...\">#</a></h2>\n<p>Just sigh. In the realm of household appliances, my luck has not generally been very good. Let's just head straight into our latest little issue. We have (had? still have?) a Samsung Dryer.</p>\n<p>For most of you who are (not?) out there, you may or may not know that Samsung makes a really shoddy piece of junk for a dryer. The drums in them like to crack and the rollers basically destroy themselves. It's a major issue, and they are basically ignoring the problem.</p>\n<p>So we purchased a new set, that is not Samsung. The delivery was this morning, but naturally did not get to go as planned. Something to do with the water shutoff valve not cooperating with the cold water. Yippee.</p>\n<p>I just can't even, right now.</p>\n",
      "date_published": "2024-04-04T17:37:14+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/good-grief-and-all-the-gravy/",
      "url": "https://shanewrogers.lol/posts/good-grief-and-all-the-gravy/",
      "title": "Good grief and all the gravy",
      "content_html": "<h2 id=\"more-site-updates\">More site updates <a class=\"direct-link\" href=\"#more-site-updates\">#</a></h2>\n<p>Now I've added another section to the olde interweb presence: <a href=\"/drops\">Drops</a>.</p>\n<p>&quot;What are drops?&quot; I can hear absolutely nobody asking...well, I'm glad you asked! Basically they're my <em>Read It Later</em> links that I use some other web service to save for me - both the actual link, the data on the page, content and all that jazzy stuff. It's a service that I actually - shock! awe! - pay for.</p>\n<p>I'd like to have all of that data <em>here</em> on this site - well, I guess it'd be in the github repo, but still. As it is, I grab the latest 25 entries and display them on the <a href=\"/drops\">drops</a> page. I suppose at some point in time I'll actually build in some kind of link roll or link blog or whatever, that way I can have the actual history in my site - but for now this is fine.</p>\n<p>It took me way, <strong>way</strong> too stinking long to get the secrets info dealt with for the github action. Too many tangents and too many wrong turns. But things seem to be working now.</p>\n<p>Time for some breakage I think.</p>\n",
      "date_published": "2024-04-03T20:32:52+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/another-day-another-day/",
      "url": "https://shanewrogers.lol/posts/another-day-another-day/",
      "title": "Another day, another day",
      "content_html": "<h2 id=\"another-entry-in-the-daily-stuff\">Another entry in the daily stuff <a class=\"direct-link\" href=\"#another-entry-in-the-daily-stuff\">#</a></h2>\n<p>Let's see what we can do about getting something written on the daily, eh? I don't know if I'll be successful here, but it's important to have some kind of goal I guess. I'll file these under the <a href=\"/tags/journal\" title=\"journal tags\">journal</a> tag (note to self: come back and make that a proper link to the journal tag page) so I can do whatever with them in the future.</p>\n<p>Today it's Saturday. Really, most normal adults/kids/people/pigs/horses/spiders/lizards/whatever would probably love a good weekend day. For some reason, I'm not always a fan. I don't know why, I think it's because I miss working. Not that I'm a workaholic, but I find that I enjoy what I do in my normal life. There's just too much stuff that needs to be done during the weekend to maintain a house and home.</p>\n<p>Not that I don't like that stuff, either. It's nearly lawn mowing season - I absolutely love mowing the lawn! I don't think that 12 year old me would believe that statement, but it's true. It's a time to put the buds in and listen to some nerdcore! (note to self: I should make a section dedicated to what I'm listening to, perhaps pull in my lastfm stuff as a data collection via rss.) It's also about time to make another attempt at getting some fruit trees planted, which is always fun.</p>\n<p>Right now, I'm just sitting here, typing away, listening to the <em>Snoopy Show</em> on AppleTV. Outside, the weather is pretty nice, we've got the rather large bounce house set up outside for the youngest kiddo, it's kinda noisy too. It's funny, you know, the things that we purchase for our kids: the things that we would have killed to have when we were young. A swing set slash jungle gym. A bounce house. Various playground type equipment. Stuff that never gets used.</p>\n<p>Well, I guess that's not completely true. It does get used, some. Just not as much as one would have hoped. Meh.</p>\n<p>Sigh, well, I'm out of coffee. Of course, who needs coffee at three thirty in the afternoon? Stupid rhetorical question, that. I always need coffee.</p>\n<h2 id=\"setup-stuff%2C-emacs-wise\">Setup stuff, emacs wise <a class=\"direct-link\" href=\"#setup-stuff%2C-emacs-wise\">#</a></h2>\n<p>This particular emacs setup, what I'm writing in now, from an older laptop running current Pop_OS, isn't really to my liking. Even though it's running the same doom setup as my work machine, it's not perfect. My work machine, I guess I can't really say that I run emacs from that device since I ssh into a locally hosted kvm box via wsl....meh, there are differences. I wish I could grok <code>guix</code> or <code>nixos</code>, but alas, I'm stil stuck in the realm of linux.</p>\n<p>Where was I? Oh yes, I do have <code>org-capture</code> templates set up that work just fine. I need to get the popup capture buffer to take the whole frame, though. I don't like that it also visits the capture buffer in the originally opened frame as well. It's an annoyance.</p>\n<p>I'm sure there should be more. I think I'm going to wait until I've got more, eh, content, here before I get various rss feeds set up for feeding into some of my social sites. I feel that I should probably &quot;own my social&quot;, too, and I do have at least one I run - but it's certainly a chore. We shall see.</p>\n<p>With that, I'm out.</p>\n",
      "date_published": "2024-03-30T20:16:05+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/about-ready-to-let-things-grow-naturally-now/",
      "url": "https://shanewrogers.lol/posts/about-ready-to-let-things-grow-naturally-now/",
      "title": "About ready to let things grow naturally now",
      "content_html": "<h2 id=\"on-how-this-site-is-gonna-go\">On how this site is gonna go <a class=\"direct-link\" href=\"#on-how-this-site-is-gonna-go\">#</a></h2>\n<p>Yeah, I think at this point I'm about at a spot where I think It's time to just let things grow naturally and have features (insofar as they can be called that...) added naturally. Or, organically, if one would rather refer to that type of growth as such.</p>\n<p>I've got my org capture template setup in my doom emacs config that creates the file with a datestamp and a prompted file name. I've got my swrlol yasnippet that creates the frontmatter for me. It might be nice if I were to take that prompted value for the file name and use it for the title within the frontmatter - I might look into that one.</p>\n<p>I've today added my short stuff slash notes category. I need to add an rss feed just for that - also perhaps give it the ability to take its own tags as well.</p>\n<p>After that and a bit of time, it'll be ready to begin looking into getting things cross posted over to mastodon.</p>\n<p>Then it'll be time to also look into pulling some posts from pixelfed. I'd still rather somebody else host images for me, since that is quite the expense and hassle that I would not like to enter into.</p>\n<p>I am really enjoying eleventy, though. It's pretty nice.</p>\n",
      "date_published": "2024-03-29T21:13:04+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/yes-this-is-a-possible-slug-tacular-title./",
      "url": "https://shanewrogers.lol/posts/yes-this-is-a-possible-slug-tacular-title./",
      "title": "Yes, this is a possible slug-tacular title.",
      "content_html": "<h1 id=\"slugs-and-stuff\">Slugs and stuff <a class=\"direct-link\" href=\"#slugs-and-stuff\">#</a></h1>\n<p>That last post had an issue with the permalink and slug. I thought it might have been related to my simple super uber basic slug code....but then, doesn't eleventy create its own slug with the <code>permalink</code> entry in the frontmatter?</p>\n",
      "date_published": "2024-03-18T21:21:42+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/now-that-we-have-reloaded/",
      "url": "https://shanewrogers.lol/posts/now-that-we-have-reloaded/",
      "title": "Now that we have reloaded",
      "content_html": "<h1 id=\"capture-template---sorta-done\">Capture template - Sorta Done <a class=\"direct-link\" href=\"#capture-template---sorta-done\">#</a></h1>\n<p>Well, it's done enough that I think I'm gonna call it <em>good enough</em> at this point. I'm not particularly happy with the yasnippet yet, in that I can'ts eem to get the <code>tags</code> entry items to space over and have to do that manually. Whatever. It's fine. It's all good.</p>\n<p>I think I need to add a setting into the org capture portion to make sure that the capture window takes up the whole frame, or at least isn't mirrored in another portion of my frame. It's all good, though. That must be the Pete the Cat in me talking. Ha.</p>\n<p>I also had to suppress the emacs warning from yasnippet that complained about changing the buffer - so I may have to either live with what I'll consider a hack, or come up with a better way to insert the ISO creation time stamp for the date frontmatter.</p>\n<p>I'm sure there is more.</p>\n<p>Still plenty of stuff to work on: setting up some data store files to pull in my other feeds, checking into basic webmentions (because I'm super, uber popular....ha)....among other items.</p>\n<p>This slug is acting funny.</p>\n",
      "date_published": "2024-03-18T18:05:18+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/capture-template-done/",
      "url": "https://shanewrogers.lol/posts/capture-template-done/",
      "title": "Capture Template Done?",
      "content_html": "<h1 id=\"step-two%2C-maybe\">Step Two, Maybe <a class=\"direct-link\" href=\"#step-two%2C-maybe\">#</a></h1>\n<p>Capture template might be ready to go, now.</p>\n<p>Created a new markdown post in the proper directory, with a prompt for the file name, then prepends the year-mm-dd to the file name. Opens a nice empty file, ready for the yasnippet.</p>\n<p>I could probably put more into the capture template to do away with the snippet.</p>\n",
      "date_published": "2024-03-18T17:35:37+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/my-final-doom-form/",
      "url": "https://shanewrogers.lol/posts/my-final-doom-form/",
      "title": "My final Doom form",
      "content_html": "<p>For the longest time - well, not really the longest time but there are moments when it seems like it's been forever - I've been attempting to patch together my own Emacs config.</p>\n<p>Having gone from Spacemacs, Purcell, Vanilla, Doom, Prelude, handcrafted, literate, back again through multiple attempts at each of the previous as well as pouring through everybody else's (and their dogs - hello, Corgi!) configs I have finally come to a conclusion.</p>\n<p>I figure that since I basically always wind up trying to reinvent Doom Emacs, that I might as well meet them in the middle and move over to recreating Doom with a complete literate Doom config.</p>\n<p>I've seen a handful of users that have done this, and while getting it bootstrapped was a little interesting, I think it's going to work really well.</p>\n<p>As it's basically an art form, my Emacs config is never done - but I've got it to a point where I'm happy with it.</p>\n<p>I do actually like some of the convenience macros that are provided with the Doom Emacs framework. It makes a really excellent library.</p>\n<p>Will I stay with this? You know, I think that since I generally always found my way back to Doom (even though I don't use evil key bindings), plus with my desire to have &quot;my own thing&quot;....yeah, maybe.</p>\n<p>Just maybe.</p>\n<p>This might be my final form.</p>\n<p>Minus some tweaking.</p>\n<p>One of these days I'll have to get back to doing weekly link dumps.</p>\n<p>This is post 65/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-01-19T03:05:11+00:00"
    }
  ]
}
