{
  "version": "https://jsonfeed.org/version/1",
  "title": "My Corner of the Internet",
  "home_page_url": "https://shanewrogers.lol/",
  "feed_url": "https://shanewrogers.lol/feed/feed.json",
  "description": "Just a place for me to share some stuff.",
  "author": {
    "name": "Shane Rogers",
    "url": ""
  },
  "items": [{
      "id": "https://shanewrogers.lol/posts/it&amp;#39;s-the-fifth-day/",
      "url": "https://shanewrogers.lol/posts/it&amp;#39;s-the-fifth-day/",
      "title": "It&#39;s the fifth day",
      "content_html": "<p>This is the fifth day of the challenge! Yesterday was an attempt to post something using the GitJournal app, which sort of worked, but didn't work quite as smoothly as one would have liked. It failed to save the new file in the appropriate folder, though I'm fairly certain I saved it where it needed. Then when trying to move it, it does a copy instead.</p>\n<p>Which plays havoc with the push to git and the workflow run. Sigh.</p>\n<p>So, in my attempt to both come up with a post today <em>and</em> perhaps a decent mobile way to post, today is just straight into the github web site and add a new post. Is it preferable? Absolutely not.</p>\n<p>In other news today, I was able to get the yard mowed before it rained. I've got this feeling that for the next month or so it's basically going to be &quot;mow whenever you flippin' can&quot;. Otherwise, my old battery operated Snapper just - literally - isn't going to cut it.</p>\n<p>Well, off to the store. Tonight is homemade tomato soup and grilled cheese with smoked gouda. Perhaps a tasty antipasto salad as well.</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-05T20:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/day-four-nothing-more/",
      "url": "https://shanewrogers.lol/posts/day-four-nothing-more/",
      "title": "Day Four, Nothing More",
      "content_html": "<p>Here we are at day for during this monthly challenge. The next couple of days are going to be the first two that present as very difficult for me - will I be able to get something posted during the weekend, while the home is filled with family and kids and I would rather <em>not</em> be dealing with a computer.</p>\n<p>So in that case, I am not using a computer or laptop for the post. Instead I'm seeing how well the <a href=\"https://gitjournal.io/\">GitJournal</a> app works on my phone. I don't really have any other content management system set up here, so this really needs to work.</p>\n<p>Maybe this would be a good excuse to set up a Ghost CMS for the front end. Probably not, though.</p>\n<p>I've done no reading today, so that's a negative. I did check out the Samurai Jack series from the local library, I'm looking forward to giving that a watch!</p>\n<p>With that....till next time.</p>\n<p>Check out the other <a href=\"/tags/weblogpomo2024\">#Weblogpomo2024</a> posts.</p>\n",
      "date_published": "2024-05-04T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/here-we-go-day-three/",
      "url": "https://shanewrogers.lol/posts/here-we-go-day-three/",
      "title": "Here we go day three",
      "content_html": "<p>It's day three of Weblog Posting Month 2024!</p>\n<p>Whew!</p>\n<p>I'll be honest, I was beginning to wonder if I was going to make it today. Today has been challenging, to say the least, so I will be putting off today's reading of the &quot;Writing to Learn&quot; book.</p>\n<p>&quot;Why is that?&quot; - I hear absolutely noone asking. Well, I'll tell you anyhow. I do much of my blog posting through <code>emacs</code> using <code>org-mode</code> capture templates. My current <code>emacs</code> configuration is a semi modified <a href=\"https://github.com/doomemacs/doomemacs\">doom emacs</a> build which has worked very well for me in the past and continues to do so in the present. Generally. I don't know if I had some kind of hardware issue (which is possible, as my config is hosted on a local NAS with used drives) due to perhaps a recent storm, but my org capture templates were just not working at all. Even after a <code>doom doctor</code>, <code>doom purge</code>, <code>doom build</code> cycle...nothing worked.</p>\n<p>Which necessitated a <em>nuclear option</em> of a fresh git checkout of doom and starting over. It's not really a complete do over, though, since I still have my private/personal doom init files that live in a different directory.</p>\n<p>All in all, after about an hour and ten minutes of waiting for the build process to finish (ugh...) we are back to par. Yippee.</p>\n<h3 id=\"the-actual-challenge\">The actual challenge <a class=\"direct-link\" href=\"#the-actual-challenge\">#</a></h3>\n<p>Everything stated, I have actually read a bit of the next chapter, and all of the above was initiated because I wanted to take a handful of notes. One item in particular, about clear writing being evidence of clear thinking. Something of which I really need to strive to do - think clearly. With that, and just a little bit of focus, perhaps I can write clearly.</p>\n<p>Read my other <a href=\"/tags/weblogpomo2024\">#WeblogPoMo2024</a> posts.</p>\n",
      "date_published": "2024-05-03T19:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/another-day-another-chapter.-day-two./",
      "url": "https://shanewrogers.lol/posts/another-day-another-chapter.-day-two./",
      "title": "Another Day, Another Chapter. Day Two.",
      "content_html": "<p>The second day brings with it a second chapter of the <a href=\"https://www.harpercollins.com/products/writing-to-learn-william-zinsser?variant=42347013505058\">Writing To Learn</a> book. To be completely fair, I had read about half of this yesterday and have finished it up this morning. To be even more fair, it will be highly probable that I'll read chapter 3 and add more to this post today as well. Let us find out what has been digested this go round, shall we?</p>\n<h3 id=\"gustavus-adolphus-college\">Gustavus Adolphus College <a class=\"direct-link\" href=\"#gustavus-adolphus-college\">#</a></h3>\n<p>Right out of the gate I learned something. While even the author, Zinsser, did believe that everybody should be able to write - he did literally write the book on the subject - the idea of <em>Writing Across the Curriculum</em> came from the small Midwestern College of <a href=\"https://en.wikipedia.org/wiki/Gustavus_Adolphus_College\">Gustavus Adolphus</a>. Or, at least as well as I can tell according to the text. Even at that point in history (jeeze, only 1985) the professors had a need and a want to move the responsibility of teaching students to write away from the &quot;English&quot; Department. Which makes complete sense to me. We write - or should write - about more than just, well, previously written materials (books, plays, what have you). Noted within this chapter are numerous other great sources of written material - from beautiful mathematic proofs, to how the periodic table of the elements are arranged and why.</p>\n<h3 id=\"a-puzzle-of-the-humanities\">A puzzle of the humanities <a class=\"direct-link\" href=\"#a-puzzle-of-the-humanities\">#</a></h3>\n<p>An interesting point was brought up during my reading today. If one's mind likes to work though puzzles, finding solutions to whatever has been presented to you, then perhaps no matter what the subject matter is it could be possible to find an intriguing route to write about said solution. As an example, the author has noted multiple times that they did not care for chemistry in school. Maybe if some of the work had been phrased the way that <a href=\"https://en.wikipedia.org/wiki/Dmitri_Mendeleev\">D I Mendeleev</a> had worked out the <em>Periodic Law</em> and creating a version of the <em>Period Table of the Elements</em>, then that challenge would have had a more positive effect on him. If there is some way to find a human element to whatever subject matter is being studied or written about, that seems to help a great deal.</p>\n<h3 id=\"a-feeling-of-rambling\">A feeling of rambling <a class=\"direct-link\" href=\"#a-feeling-of-rambling\">#</a></h3>\n<p>I'm doing it again - I feel like I'm just kind of rambling on. I should tighten this stuff up. Meh.</p>\n<p>Let us finish up with a couple of quotes from the chapter that have kind of stuck with me:</p>\n<blockquote>\n<p>Students should be learning a strong and unpretentious prose that will carry their thoughts about the world they live in.</p>\n</blockquote>\n<p>and</p>\n<blockquote>\n<p>...every subject is interesting if an avenue into it can be found that has humanity and that an ordinary person can follow.</p>\n</blockquote>\n<p>These ring well with me. I'm no journalist, no professional writer for sure. But I have read a wide variety of subjects, books, magazines, articles...those that leave the best impression are of the style that don't belittle or &quot;talk down&quot; to the reader. I find it sad that today we are losing a large amount of written work that may never be. Amazing magazines that have stopped printing. Journals that are no longer around. Yes, I am aware of the irony that any readers of this material are doing so on a media that involves a screen. It's easier, but only in so many ways.</p>\n<p>The challenge is finding it.</p>\n<p>Read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts.</p>\n",
      "date_published": "2024-05-02T14:00:56+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/writing-to-learn-weblog-posting-month-2024/",
      "url": "https://shanewrogers.lol/posts/writing-to-learn-weblog-posting-month-2024/",
      "title": "Writing to learn - Weblog Posting Month 2024",
      "content_html": "<p>Well it's finally here: my first entry into Annie's <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">Weblog PoMo 2024</a>. As with most things that I do when it comes to writing, I haven't really planned this out. Does that mean that I'm most likely going to fail at it? That is a definite possibility. But I'm willing to at least give it a shot for myself.</p>\n<p>Of course, there is nothing like getting an <a href=\"https://echofeed.app/\">Echofeed</a> set up for it to help with some accountability - up to and including having the <a href=\"https://beep.town/@echofeedamplify\">Amplify Bot</a> boost your stuff.</p>\n<p>With that out of the way, let's get the ball rolling on <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a>!</p>\n<h3 id=\"writing-to-learn\">Writing to learn <a class=\"direct-link\" href=\"#writing-to-learn\">#</a></h3>\n<p>Or something like that. Writing to learn, writing to keep yourself accountable, whatever the reason it's a good skill to have. It's not necessarily something that one actually appreciates when they are younger. I graduated high school in 1995 and was fortunate enough to have had a couple of college level courses that we were able to take during our senior year - including an English course that included at least one paper. It was a great start on my college and university stint.</p>\n<p>When I did eventually enroll and find myself in college, part of our curriculum was a <a href=\"https://en.wikipedia.org/wiki/Writing_across_the_curriculum\">Writing to learn</a> selection of courses - I believe that we needed required to take two or three of these. The idea - at the time at least - was something that I can't say I was too overly fond of. I was going to be a Computer Science major and didn't feel that I needed to &quot;Write to Learn&quot;. Of course, I did though.</p>\n<p>It wouldn't be until much, <strong>much</strong> later that I would find the source of this sound reasoning: <a href=\"https://www.harpercollins.com/products/writing-to-learn-william-zinsser?variant=42347013505058\">William Zinsser's Book</a>. At least, I assume this to be the source. My plan, my goal, is to actually read this book. I don't think it to be too much to ask. I've already got one chapter down and I find that I really like the flow and the style. So, part of what I write about this month is going to include some of my thoughts on the book.</p>\n<p>This isn't going to be some great article series, no doubt about that. But I do hope that I'm able to improve a bit on my writing, maybe it can even become a habit to write more. I don't think I could hope to be able to write <em>better</em>, I find that I'm pretty well stuck in my ways on that account.</p>\n<p>I will end this entry with a bit of an anecdote. Not long after I moved to Lawrence, I found myself sitting at a local restaurant eating a meal. Behind me sat a couple of who I will assume to be professors from the university and they were having a conversation. The subject of students not knowing how to write papers came up, which was kind of a surprise to me. This was quite some time ago, but from what I can recall I do remember thinking to myself how sad and disturbing that was. How could students in this (that?) day and age make it through high school and into college or university and not know how to write?</p>\n<p>I can only imagine that now, it's a problem that has not gotten any better. Writing is becoming a lost art it seems.</p>\n",
      "date_published": "2024-05-01T16:19:52+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/things-i&amp;#39;m-learning/",
      "url": "https://shanewrogers.lol/posts/things-i&amp;#39;m-learning/",
      "title": "Things I&#39;m Learning",
      "content_html": "<p>For those of you who follow my pixelfed feed, you may have seen the following image</p>\n<iframe title=\"Pixelfed Post Embed\" src=\"https://pixelfed.social/p/swrogers/690632497756857978/embed?caption=false&likes=false&layout=compact\" class=\"pixelfed__embed\" style=\"max-width: 100%; border: 0\" width=\"400\" allowfullscreen=\"allowfullscreen\"></iframe><script async defer src=\"https://pixelfed.social/embed.js\"></script>\n<p>While it's only tangentially related to what I do at work, it's something that is actively encouraged for us to do - continue to learn. I figure since I am around Oracle Databases all the time, I should probably widen my breadth of knowledge a bit.</p>\n<p>Who knows, I might even be able to add to my repertoire.</p>\n<h3 id=\"possible-future-notes-to-self\">Possible future notes to self <a class=\"direct-link\" href=\"#possible-future-notes-to-self\">#</a></h3>\n<p>I'm wondering how feasible it might be to have echofeed (perhaps) cross post from pixelfed into this github pages hosted site. I know I could do an rss feed pull. Of course, then I'd need some way to ensure that doubled (or more...) posts aren't sent out via echofeed to the mastodon account. I'm sure that other people have solved this issue, though. Heh.</p>\n",
      "date_published": "2024-04-30T15:26:37+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/weblog-posting-month-2024/",
      "url": "https://shanewrogers.lol/posts/weblog-posting-month-2024/",
      "title": "Weblog Posting Month 2024",
      "content_html": "<p>I think I'm going to try to do something that will be very difficult for me. I've decided to join the group in a <em>post every day during the month of May</em> challenge that has been dubbed <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">#WeblogPoMo2024</a>.</p>\n<p>I shall be using the same tag here, <a href=\"/tags/weblogpomo2024\">as well</a> for sake of categorization. I guess it's likely  that I'll even start using the echo feed account that I've been paying for.</p>\n<p>We'll see how this goes. I was able to do the &quot;post a photo every day for 30 days&quot; thing over on microblog to get that badge, which wasn't super easy for me either.</p>\n",
      "date_published": "2024-04-29T21:29:26+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/and-now-for-something-different/",
      "url": "https://shanewrogers.lol/posts/and-now-for-something-different/",
      "title": "And Now For Something Different",
      "content_html": "<p>Ah and now for something (not so?) completely different! For those of you who have been following along at home - which, I suppose, would really just be me, myself and I - I've made some changes to the site.</p>\n<p>No longer is the static site based on Eleventy Duo. Welcome, instead, to <a href=\"https://github.com/google/eleventy-high-performance-blog\">eleventy high performance blog</a>. Being a tinkerer does at times really, really suck. Never being happy or content with the way things are on the old blog.</p>\n<p>The change actually went a lot smoother than I was anticipating it going. I cloned the new template to a clean directory. Made the changes that I needed to make to it (at least, started them - I'm sure more will come). Renamed the remote origin and added a new remote origin. Then, over in my now old and stale github repo I renamed the 'main' branch, added a new 'to migrate' branch, then went back to the new template and did the ol' something of a force push to the new branch on my static site repo.</p>\n<p>Once that was done, I had to rename the local and remote repos back to main and set the new default branch.</p>\n<p>Thankfully, things still just worked after that! Had to make a single change to the emacs org capture template to ensure the directory for the posts was good...now, I think we're golden.</p>\n<p>Or at least a decent shade of pale yellow.</p>\n",
      "date_published": "2024-04-29T20:29:44+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/just-a-handful-of-notes-please/",
      "url": "https://shanewrogers.lol/posts/just-a-handful-of-notes-please/",
      "title": "Just a handful of notes please",
      "content_html": "<p>We shall go ahead and tag this one into the <a href=\"/tags/rambling\">rambling</a> series, why not? Kind of a small update of a few things that have happened over the course of the last couple of days I suppose.</p>\n<h2 id=\"i'm-really-bad-a-blogging\">I'm really bad a blogging <a class=\"direct-link\" href=\"#i'm-really-bad-a-blogging\">#</a></h2>\n<p>Point taken, I'm not really good at sitting down and getting something on digital paper every single day. Granted, I'm not good at sitting down and getting something put on actual real paper, either. At least I'm equal opportunity when it comes to writing. Which I find a little sad, since it is something that I enjoy doing. I'm trying, though.</p>\n<p>The end of last week was really good, though. Our twins performed in one of the local plays and three of the performances were last Thursday, Friday and Saturday. I (well, my spouse and I both) are beyond proud of them (again, all of our kids, actually) for doing things that I could never have even thought of doing when I was their age. &quot;What, get up on stage and act?! No thank you.&quot; I'm very, very introverted. The thought of doing a play (or musical!) would petrify me. The musical they did as well, earlier in the year, so yeah!</p>\n<p>They did exceedingly well. I can not brag on my kids enough.</p>\n<h2 id=\"i'm-also-bad-at-reading-self-help-books\">I'm also bad at reading self help books <a class=\"direct-link\" href=\"#i'm-also-bad-at-reading-self-help-books\">#</a></h2>\n<p>Yeah, not that I have a whole <strong>lot</strong> of self help books, but I have picked up a couple of them that really interested me. I'd found a hardback copy of <em>William Zinsser's Writing to Learn</em>, which just seemed very cool and might perhaps help out with this personal site of mine. Guess how much of it I've read? A couple of pages. But enough I know that I think I'll really like the style. Ha.</p>\n<p>Next, I finally got my copy of <em>Brain Hacks</em>, by <em>Lara Honos-Webb</em>, which seems like it could help with some organizational skills that frankly any of us could use. It was actually recommended to one of the previously mentioned twins above that he should read it for one of his projects. So he is. I don't know that he's gotten much out of it - but hopefully more than I have, as I've read an astounding two pages in it. Sigh.</p>\n<h2 id=\"i'm-better-at-reading-for-enjoyment\">I'm better at reading for enjoyment <a class=\"direct-link\" href=\"#i'm-better-at-reading-for-enjoyment\">#</a></h2>\n<p>I will admit, that I do actually enjoy reading and am continuing to work my way through <em>The Expanse</em> novels. Currently reading <em>Nemesis Games</em> in what spare time I can steal. I'm also reading <em>The Dark Elf Trilogy</em> to at least one of the twins, we just got into the second book the other week. This is the second go through of this series for me.</p>\n<h2 id=\"other-news%3F\">Other news? <a class=\"direct-link\" href=\"#other-news%3F\">#</a></h2>\n<p>I always feel like I should put something down about the current state of this site. I don't know why. I'm happy with it, but not really super happy with it. I guess it's a great medium to just be able to get words down. I don't really care too much for the theme or the look of the site, but then I don't have the time to put into making it any better. I'd like to do more with webmentions and other indieweb stuff - but then I also don't do a whole lot with social media, period. It's tough.</p>\n<p>I like to write, I'll continue to write, whether or not people read really doesn't concern me.</p>\n<p>We'll leave it at that.</p>\n",
      "date_published": "2024-04-22T21:04:04+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/not-another-new-server/",
      "url": "https://shanewrogers.lol/posts/not-another-new-server/",
      "title": "Not another new server",
      "content_html": "<h2 id=\"another-fediverse-server%3F!\">Another Fediverse Server?! <a class=\"direct-link\" href=\"#another-fediverse-server%3F!\">#</a></h2>\n<p>No, I don't have <em>yet another fediverse server instance</em> stood up.</p>\n<p>Not for some lack of trying, mind you, I just don't have the energy to put into working through all the nits and nats that are involved with ruby. I shudder to think. I've never really been a huge fan of that whole ecosystem.</p>\n<p>It's not as bad as the JavaScript world, but it's not fun to navigate for me either.</p>\n<p>I was wanting to get a <a href=\"https://diasporafoundation.org/\">Diaspora</a> instance set up on a digital ocean droplet, but decided against it. Then, to follow along in some other rabbit hole, I signed up on Yet Another ActivityPub Instance, in the form of <a href=\"https://akkomane.social/@shane\">Akkomane Social</a>. It seems nice, thus far.</p>\n<p>In other news, yeah - it's been a week.</p>\n<p>It's also only Wednesday.</p>\n",
      "date_published": "2024-04-17T21:17:08+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/my-eleventy-inspirations/",
      "url": "https://shanewrogers.lol/posts/my-eleventy-inspirations/",
      "title": "My Eleventy Inspirations",
      "content_html": "<h2 id=\"where-i've-drawn-inspiration-from\">Where I've drawn inspiration from <a class=\"direct-link\" href=\"#where-i've-drawn-inspiration-from\">#</a></h2>\n<p>I figure that this is as good a time as any to make some sort of attempt at getting down on &quot;paper&quot; those sites that I've looked at and drawn some sort of inspiration from in the creation of my site. Not that my site is anything special, but it'll be good for the hypothetical <em>future me</em> to be able to go back and see where things have come from.</p>\n<p>Granted, it's possible that a lot of these are also noted under my Eleventy <a href=\"http://Raindrop.io\">Raindrop.io</a> collection, but, you know - content and stuff.</p>\n<p>This page will probably be something of a living page for a bit.</p>\n<style>\nul { list-style-position: outside; }\n</style>\n<ul>\n<li>\n<p><a href=\"https://github.com/yinkakun/eleventy-duo\">The Site Theme.</a></p>\n<p>It's clean and I like it.</p>\n</li>\n<li>\n<p><a href=\"https://ttntm.me/blog/creating-a-reading-list-with-eleventy-and-omnivore/\">Creating a Reading List</a></p>\n<p>Was very useful in some of the ideas of my drops page and similar. I also really like some of the other ideas that present themselves throughout the site in general - such as the main homepage landing area.</p>\n</li>\n<li>\n<p><a href=\"https://www.simoncox.com/shorts/2024-03-17-11ty-collection-tag-links/\">11ty collections tag links</a></p>\n<p>Some implementation info on collections.</p>\n</li>\n<li>\n<p><a href=\"https://nicolas-hoizey.com/articles/2023/02/08/a-bookmarklet-to-create-a-new-link-content-markdown-on-github/\">A bookmarklet to create a new link content Markdown on GitHub</a></p>\n<p>Used for the bookmarklet to add a new link entry.</p>\n</li>\n<li>\n<p><a href=\"https://another.rodeo/linkroll/\">11ty Linkrolls</a></p>\n<p>Used in conjunction with the above to roll my own link roll page. (See what I did there?)</p>\n</li>\n<li>\n<p><a href=\"https://www.raymondcamden.com/2022/03/08/including-rss-content-in-your-eleventy-site\">Including RSS Content</a><br>\n<a href=\"https://www.raymondcamden.com/2022/04/03/including-rss-content-in-your-eleventy-site-part-2\">...and part 2</a></p>\n<p>Using rss-parser and some other details with pulling rss data into a site. Plus, Raymond has an amazingly large amount of <a href=\"https://www.raymondcamden.com/tags/eleventy\">eleventy tagged</a> content on his site!</p>\n</li>\n</ul>\n<h3 id=\"now-for-stuff-that-i'd-like-to-consider-for-future-reference%3A\">Now for stuff that I'd like to consider for future reference: <a class=\"direct-link\" href=\"#now-for-stuff-that-i'd-like-to-consider-for-future-reference%3A\">#</a></h3>\n<ul>\n<li>\n<p><a href=\"https://github.com/lwojcik/eleventy-template-multiplicity/tree/main\">Multiplicity Theme</a></p>\n<p>This I really wouldn't mind including as an RSS reader/source.</p>\n</li>\n<li>\n<p><a href=\"https://rknight.me/blog/using-eleventy-to-gobble-up-everything-i-do-online/\">Using Eleventy to Gobble Up Everything I Do Online</a></p>\n<p>The author of this page also is the creator of the <a href=\"https://github.com/rknightuk/echo\">Echo service</a> (both for self host and hosted), and I am considering using that to enable posting on other social platforms as well. That said, this site is a great resource for pulling in other sources of data into Eleventy.</p>\n</li>\n<li>\n<p><a href=\"https://coryd.dev/\">Cory Dransfeldt's Blog</a></p>\n<p>Just lots of good content here, including <a href=\"https://coryd.dev/posts/2024/automatic-mastodon-post-embeds/\">embedding mastodon posts.</a></p>\n</li>\n<li>\n<p><a href=\"https://darn.es/mastodon-post-web-component/\">mastodon-post web component</a></p>\n<p>From David Darnes, this component used within the previous link. I do have a branch of my site that uses this, but I'm not put it into production yet. I'm up in the air about it.</p>\n</li>\n<li>\n<p><a href=\"https://github.com/nhoizey/github-action-feed-to-mastodon\">Github Action Feed to Mastodon</a></p>\n<p>Sends json sourced feed into a Mastodon instance. This is also referenced from the previous set of links, though I don't believe it's a requirement on its own. This could - possibly? - be superceded by Echo.</p>\n</li>\n<li>\n<p><a href=\"https://11tybundle.dev/firehose/\">11tybundle.dev firehose</a></p>\n<p>Anything and everything 11ty.</p>\n</li>\n<li>\n<p><a href=\"https://sia.codes/tags/eleventy/\">Sia dot Codes Eleventy Items</a></p>\n<p>Another popular and excellent source of information on the eleventy's.</p>\n</li>\n<li>\n<p><a href=\"https://11ty.rocks/community/\">11ty Rocks! Community Feed</a></p>\n<p>Some good entries from around the horn here, plus some other valuable posts as well of their own.</p>\n</li>\n<li>\n<p><a href=\"https://blog.lukaszwojcik.net/eleventy-custom-markup-alongside-item-contents/\">Eleventy: custom markup alongside item contents</a></p>\n<p>Nifty use of markdown and customization.</p>\n</li>\n</ul>\n",
      "date_published": "2024-04-11T18:10:44+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/another-day-down/",
      "url": "https://shanewrogers.lol/posts/another-day-down/",
      "title": "Another Day Down",
      "content_html": "<h2 id=\"yeah-it's-my-rambling-series%2C-so-what%3F\">Yeah It's My Rambling Series, So What? <a class=\"direct-link\" href=\"#yeah-it's-my-rambling-series%2C-so-what%3F\">#</a></h2>\n<p>If it's one thing that I've noticed of late, it's that I must really enjoy rambling about nothing in particular. I suppose that's fine, of course, because it's good practice for any <em>actual</em> writing that might come from this site.</p>\n<p>Of course, I think that we all know there we never be any <em>actual, real</em> writing on this site. Who am I fooling, anyway?</p>\n<h2 id=\"last-time-on...\">Last Time On... <a class=\"direct-link\" href=\"#last-time-on...\">#</a></h2>\n<p>When last we joined in the great adventures of <em>nobody in particular</em> we had the washer and dryer in place. Not running or working, mind you. Because life is a fickle little something or other. I don't know who was in charge, or what they were smoking, or even what was running through their mind when it was decided by the powers that be that it was all &quot;A Okay&quot; to ship a meager six foot dryer power cord along with a pre-stacked washer and dryer unit.</p>\n<p>Especially when the electrical connection is at the upper back (we'll call it the upper right corner, looking at the thing from the back side) of the over six foot tall unit. Can you guess where I'm going here? Our laundry room is set up to accommodate side by side units. As I would wager most peoples' places are. Normally, this is not a problem. The power cord they ship (which, we have to purchase, naturally) didn't reach the dryer plug outlet on the wall by, oh, six inches. Not that it matters how short it was - it just flat out didn't reach.</p>\n<p>Of course nobody in town has a replacement dryer cord that we could pick up the same day. So, as we've already read, we got one from amazon. A nice, ten footer. It reached no problem. All said and done, installed, working great! Finally, clean clothes!</p>\n<h2 id=\"state-of-my-blog\">State Of My Blog <a class=\"direct-link\" href=\"#state-of-my-blog\">#</a></h2>\n<p>I've made some changes on the linkages up top, as well as the intro paragraph on the homearea page. I even have a newly opened branch where I've got David Darnes <a href=\"https://github.com/daviddarnes/mastodon-post/tree/main\">mastodon-post</a> Web Component up and running (with a nod towards <a href=\"https://coryd.dev/posts/2024/automatic-mastodon-post-embeds/\">Cory Dransfeldt's</a> set up as well). It needs some love and I'm not sure it'll ever go live, I don't know. I'd want to perchance get a shortcode template set up to make it simpler for my needs.</p>\n<p>With that, we'll call that an entry. I think I'm doing a little better, I might even expand my writing to more than waxing about this silly site that I'm making.</p>\n",
      "date_published": "2024-04-10T17:30:14+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/sometimes-one-wonders/",
      "url": "https://shanewrogers.lol/posts/sometimes-one-wonders/",
      "title": "Sometimes one wonders",
      "content_html": "<h2 id=\"for-crying-out-loud\">For Crying Out Loud <a class=\"direct-link\" href=\"#for-crying-out-loud\">#</a></h2>\n<p>I'm sure that I'm not alone in this wondering, when sometimes it seems as though all the cards, all the world - heck <em>all the cards in all the world</em> just seem to be lined up against you. These past couple of weeks have been a grand example of that for this household.</p>\n<p>We had purchased a certain brand (<em>cough</em> Samsung <em>cough</em>) washer and dryer. Said brand evidently makes really crappy dryer drums that like to crack and break and basically vomit all over themselves. They don't admit this, of course, and they aren't taking care of the problem. So we bought another brand in a single stacked unit. Because ours is a household that is very OCD about having things be the same. Plus, the stacked unit has the controls in the middle for the short people in the home. Plus we now have a little extra storage room in the washer and dryer room.</p>\n<p>The first couple of guys who delivered the unit weren't the brightest bulbs in the garden. They either didn't know how to unhook the old units, or didn't know that &quot;Yes, Alice, there is going to be a little water that leaks out of the old hose&quot;. So they wouldn't finish the install, leaving the new unit in our garage.</p>\n<p>Fast forward to today, we get the old units removed and the new unit in place. Yes! Oh, what's this? The power cord goes from the top far corner of the unit and is about two (2) feet too stinking short?! No!! Dammit.</p>\n<h2 id=\"misery-is-a-beast\">Misery is a beast <a class=\"direct-link\" href=\"#misery-is-a-beast\">#</a></h2>\n<p>Yeah. So, we were super stoked to get the new unit. Now we're basically at the point where we don't even wanna see the flipping thing in the home. But there it is, mocking us. Just sitting there, all unplugged. Laughing at us. No place in town sells a 10 foot four prong dryer cord. Now, we wait for the order from our saviour...amazon. Ugh.</p>\n<p>We really were hoping to get some laundry done today.</p>\n<h2 id=\"on-the-bright-side\">On the bright side <a class=\"direct-link\" href=\"#on-the-bright-side\">#</a></h2>\n<p>We did get to see some of the eclipse today! So much better than 2017, when it was terribly cloudy and overcast. This one reminded me of when I was in high school (mid 90s) and we also got to experience an eclipse. Very cool.</p>\n<p>With that - until next time.</p>\n",
      "date_published": "2024-04-08T18:20:28+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/more-updates-and-stuff!/",
      "url": "https://shanewrogers.lol/posts/more-updates-and-stuff!/",
      "title": "More Updates and Stuff!",
      "content_html": "<h2 id=\"more-things-added-around-here\">More things added around here <a class=\"direct-link\" href=\"#more-things-added-around-here\">#</a></h2>\n<p>I've added my <a href=\"/links\">links</a> page now, along with a super nifty bookmarklet that I can use to add new links from the browser. I'm sure that if anybody were to do any kind of digging on the interweb, they'd know where I was able to grab some of the implementation details from. Of course, we all make our own nifty little changes, and I was no different.</p>\n<p>For one, I don't like a bunch of folders and <em>index.html</em> files all over the place - so that had to go.</p>\n<p>One thing that I've noticed, here in the land of emacs, is that my capture session seems to have run into some interesting kinks. Oh, I bet it didn't like the <em>!</em> I used in the filename...what was I thinking!?</p>\n<p>Anyway.</p>\n<h2 id=\"where-was-i%3F\">Where was I? <a class=\"direct-link\" href=\"#where-was-i%3F\">#</a></h2>\n<p>Oh yes - I wanted to kind of explain my thinking on having <em>both</em> <a href=\"/drops\">drops</a> <strong>and</strong> <a href=\"/links\">links</a>. To me, the <em>drops</em> are for pages that I want to ensure never go away. A <em>read it later</em>, if you will. The service I use (<a href=\"https://raindrop.io\">raindrop.io</a>), takes care of that for me since I'm a subscriber. <a href=\"/links\">Links</a>, on the other hand, I don't care if those stick around or not. Plus, those actually get saved as files in the repo, as opposed to the drops, which are ephemeral data from the ether.</p>\n<p>That's my thinking, anyhow.</p>\n<p>All said and done, I think for now I'm more or less finished with the structure of the site. Now, I just need more content - which will come with time. Then I can set up paging with whatever needs it. That, and get some rss feeds finalized, along with cross posting.</p>\n<p>Till next time.</p>\n",
      "date_published": "2024-04-05T20:42:04+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/oh-for-crying-out-loud!/",
      "url": "https://shanewrogers.lol/posts/oh-for-crying-out-loud!/",
      "title": "Oh for crying out loud!",
      "content_html": "<h2 id=\"all-i-can-do-is...\">All I can do is... <a class=\"direct-link\" href=\"#all-i-can-do-is...\">#</a></h2>\n<p>Just sigh. In the realm of household appliances, my luck has not generally been very good. Let's just head straight into our latest little issue. We have (had? still have?) a Samsung Dryer.</p>\n<p>For most of you who are (not?) out there, you may or may not know that Samsung makes a really shoddy piece of junk for a dryer. The drums in them like to crack and the rollers basically destroy themselves. It's a major issue, and they are basically ignoring the problem.</p>\n<p>So we purchased a new set, that is not Samsung. The delivery was this morning, but naturally did not get to go as planned. Something to do with the water shutoff valve not cooperating with the cold water. Yippee.</p>\n<p>I just can't even, right now.</p>\n",
      "date_published": "2024-04-04T17:37:14+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/good-grief-and-all-the-gravy/",
      "url": "https://shanewrogers.lol/posts/good-grief-and-all-the-gravy/",
      "title": "Good grief and all the gravy",
      "content_html": "<h2 id=\"more-site-updates\">More site updates <a class=\"direct-link\" href=\"#more-site-updates\">#</a></h2>\n<p>Now I've added another section to the olde interweb presence: <a href=\"/drops\">Drops</a>.</p>\n<p>&quot;What are drops?&quot; I can hear absolutely nobody asking...well, I'm glad you asked! Basically they're my <em>Read It Later</em> links that I use some other web service to save for me - both the actual link, the data on the page, content and all that jazzy stuff. It's a service that I actually - shock! awe! - pay for.</p>\n<p>I'd like to have all of that data <em>here</em> on this site - well, I guess it'd be in the github repo, but still. As it is, I grab the latest 25 entries and display them on the <a href=\"/drops\">drops</a> page. I suppose at some point in time I'll actually build in some kind of link roll or link blog or whatever, that way I can have the actual history in my site - but for now this is fine.</p>\n<p>It took me way, <strong>way</strong> too stinking long to get the secrets info dealt with for the github action. Too many tangents and too many wrong turns. But things seem to be working now.</p>\n<p>Time for some breakage I think.</p>\n",
      "date_published": "2024-04-03T20:32:52+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/another-day-another-day/",
      "url": "https://shanewrogers.lol/posts/another-day-another-day/",
      "title": "Another day, another day",
      "content_html": "<h2 id=\"another-entry-in-the-daily-stuff\">Another entry in the daily stuff <a class=\"direct-link\" href=\"#another-entry-in-the-daily-stuff\">#</a></h2>\n<p>Let's see what we can do about getting something written on the daily, eh? I don't know if I'll be successful here, but it's important to have some kind of goal I guess. I'll file these under the <a href=\"/tags/journal\" title=\"journal tags\">journal</a> tag (note to self: come back and make that a proper link to the journal tag page) so I can do whatever with them in the future.</p>\n<p>Today it's Saturday. Really, most normal adults/kids/people/pigs/horses/spiders/lizards/whatever would probably love a good weekend day. For some reason, I'm not always a fan. I don't know why, I think it's because I miss working. Not that I'm a workaholic, but I find that I enjoy what I do in my normal life. There's just too much stuff that needs to be done during the weekend to maintain a house and home.</p>\n<p>Not that I don't like that stuff, either. It's nearly lawn mowing season - I absolutely love mowing the lawn! I don't think that 12 year old me would believe that statement, but it's true. It's a time to put the buds in and listen to some nerdcore! (note to self: I should make a section dedicated to what I'm listening to, perhaps pull in my lastfm stuff as a data collection via rss.) It's also about time to make another attempt at getting some fruit trees planted, which is always fun.</p>\n<p>Right now, I'm just sitting here, typing away, listening to the <em>Snoopy Show</em> on AppleTV. Outside, the weather is pretty nice, we've got the rather large bounce house set up outside for the youngest kiddo, it's kinda noisy too. It's funny, you know, the things that we purchase for our kids: the things that we would have killed to have when we were young. A swing set slash jungle gym. A bounce house. Various playground type equipment. Stuff that never gets used.</p>\n<p>Well, I guess that's not completely true. It does get used, some. Just not as much as one would have hoped. Meh.</p>\n<p>Sigh, well, I'm out of coffee. Of course, who needs coffee at three thirty in the afternoon? Stupid rhetorical question, that. I always need coffee.</p>\n<h2 id=\"setup-stuff%2C-emacs-wise\">Setup stuff, emacs wise <a class=\"direct-link\" href=\"#setup-stuff%2C-emacs-wise\">#</a></h2>\n<p>This particular emacs setup, what I'm writing in now, from an older laptop running current Pop_OS, isn't really to my liking. Even though it's running the same doom setup as my work machine, it's not perfect. My work machine, I guess I can't really say that I run emacs from that device since I ssh into a locally hosted kvm box via wsl....meh, there are differences. I wish I could grok <code>guix</code> or <code>nixos</code>, but alas, I'm stil stuck in the realm of linux.</p>\n<p>Where was I? Oh yes, I do have <code>org-capture</code> templates set up that work just fine. I need to get the popup capture buffer to take the whole frame, though. I don't like that it also visits the capture buffer in the originally opened frame as well. It's an annoyance.</p>\n<p>I'm sure there should be more. I think I'm going to wait until I've got more, eh, content, here before I get various rss feeds set up for feeding into some of my social sites. I feel that I should probably &quot;own my social&quot;, too, and I do have at least one I run - but it's certainly a chore. We shall see.</p>\n<p>With that, I'm out.</p>\n",
      "date_published": "2024-03-30T20:16:05+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/about-ready-to-let-things-grow-naturally-now/",
      "url": "https://shanewrogers.lol/posts/about-ready-to-let-things-grow-naturally-now/",
      "title": "About ready to let things grow naturally now",
      "content_html": "<h2 id=\"on-how-this-site-is-gonna-go\">On how this site is gonna go <a class=\"direct-link\" href=\"#on-how-this-site-is-gonna-go\">#</a></h2>\n<p>Yeah, I think at this point I'm about at a spot where I think It's time to just let things grow naturally and have features (insofar as they can be called that...) added naturally. Or, organically, if one would rather refer to that type of growth as such.</p>\n<p>I've got my org capture template setup in my doom emacs config that creates the file with a datestamp and a prompted file name. I've got my swrlol yasnippet that creates the frontmatter for me. It might be nice if I were to take that prompted value for the file name and use it for the title within the frontmatter - I might look into that one.</p>\n<p>I've today added my short stuff slash notes category. I need to add an rss feed just for that - also perhaps give it the ability to take its own tags as well.</p>\n<p>After that and a bit of time, it'll be ready to begin looking into getting things cross posted over to mastodon.</p>\n<p>Then it'll be time to also look into pulling some posts from pixelfed. I'd still rather somebody else host images for me, since that is quite the expense and hassle that I would not like to enter into.</p>\n<p>I am really enjoying eleventy, though. It's pretty nice.</p>\n",
      "date_published": "2024-03-29T21:13:04+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/yes-this-is-a-possible-slug-tacular-title./",
      "url": "https://shanewrogers.lol/posts/yes-this-is-a-possible-slug-tacular-title./",
      "title": "Yes, this is a possible slug-tacular title.",
      "content_html": "<h1 id=\"slugs-and-stuff\">Slugs and stuff <a class=\"direct-link\" href=\"#slugs-and-stuff\">#</a></h1>\n<p>That last post had an issue with the permalink and slug. I thought it might have been related to my simple super uber basic slug code....but then, doesn't eleventy create its own slug with the <code>permalink</code> entry in the frontmatter?</p>\n",
      "date_published": "2024-03-18T21:21:42+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/now-that-we-have-reloaded/",
      "url": "https://shanewrogers.lol/posts/now-that-we-have-reloaded/",
      "title": "Now that we have reloaded",
      "content_html": "<h1 id=\"capture-template---sorta-done\">Capture template - Sorta Done <a class=\"direct-link\" href=\"#capture-template---sorta-done\">#</a></h1>\n<p>Well, it's done enough that I think I'm gonna call it <em>good enough</em> at this point. I'm not particularly happy with the yasnippet yet, in that I can'ts eem to get the <code>tags</code> entry items to space over and have to do that manually. Whatever. It's fine. It's all good.</p>\n<p>I think I need to add a setting into the org capture portion to make sure that the capture window takes up the whole frame, or at least isn't mirrored in another portion of my frame. It's all good, though. That must be the Pete the Cat in me talking. Ha.</p>\n<p>I also had to suppress the emacs warning from yasnippet that complained about changing the buffer - so I may have to either live with what I'll consider a hack, or come up with a better way to insert the ISO creation time stamp for the date frontmatter.</p>\n<p>I'm sure there is more.</p>\n<p>Still plenty of stuff to work on: setting up some data store files to pull in my other feeds, checking into basic webmentions (because I'm super, uber popular....ha)....among other items.</p>\n<p>This slug is acting funny.</p>\n",
      "date_published": "2024-03-18T18:05:18+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/capture-template-done/",
      "url": "https://shanewrogers.lol/posts/capture-template-done/",
      "title": "Capture Template Done?",
      "content_html": "<h1 id=\"step-two%2C-maybe\">Step Two, Maybe <a class=\"direct-link\" href=\"#step-two%2C-maybe\">#</a></h1>\n<p>Capture template might be ready to go, now.</p>\n<p>Created a new markdown post in the proper directory, with a prompt for the file name, then prepends the year-mm-dd to the file name. Opens a nice empty file, ready for the yasnippet.</p>\n<p>I could probably put more into the capture template to do away with the snippet.</p>\n",
      "date_published": "2024-03-18T17:35:37+00:00"
    }
  ]
}
