{
  "version": "https://jsonfeed.org/version/1",
  "title": "My Corner of the Internet feed for household",
  "home_page_url": "https://shanewrogers.lol/",
  "feed_url": "https://shanewrogers.lol/feed/feed.json",
  "description": "Just a place for me to share some stuff.",
  "author": {
    "name": "Shane Rogers",
    "url": ""
  },
  "items": [{
      "id": "https://shanewrogers.lol/posts/sometimes-one-wonders/",
      "url": "https://shanewrogers.lol/posts/sometimes-one-wonders/",
      "title": "Sometimes one wonders",
      "content_html": "<h2 id=\"for-crying-out-loud\">For Crying Out Loud <a class=\"direct-link\" href=\"#for-crying-out-loud\">#</a></h2>\n<p>I'm sure that I'm not alone in this wondering, when sometimes it seems as though all the cards, all the world - heck <em>all the cards in all the world</em> just seem to be lined up against you. These past couple of weeks have been a grand example of that for this household.</p>\n<p>We had purchased a certain brand (<em>cough</em> Samsung <em>cough</em>) washer and dryer. Said brand evidently makes really crappy dryer drums that like to crack and break and basically vomit all over themselves. They don't admit this, of course, and they aren't taking care of the problem. So we bought another brand in a single stacked unit. Because ours is a household that is very OCD about having things be the same. Plus, the stacked unit has the controls in the middle for the short people in the home. Plus we now have a little extra storage room in the washer and dryer room.</p>\n<p>The first couple of guys who delivered the unit weren't the brightest bulbs in the garden. They either didn't know how to unhook the old units, or didn't know that &quot;Yes, Alice, there is going to be a little water that leaks out of the old hose&quot;. So they wouldn't finish the install, leaving the new unit in our garage.</p>\n<p>Fast forward to today, we get the old units removed and the new unit in place. Yes! Oh, what's this? The power cord goes from the top far corner of the unit and is about two (2) feet too stinking short?! No!! Dammit.</p>\n<h2 id=\"misery-is-a-beast\">Misery is a beast <a class=\"direct-link\" href=\"#misery-is-a-beast\">#</a></h2>\n<p>Yeah. So, we were super stoked to get the new unit. Now we're basically at the point where we don't even wanna see the flipping thing in the home. But there it is, mocking us. Just sitting there, all unplugged. Laughing at us. No place in town sells a 10 foot four prong dryer cord. Now, we wait for the order from our saviour...amazon. Ugh.</p>\n<p>We really were hoping to get some laundry done today.</p>\n<h2 id=\"on-the-bright-side\">On the bright side <a class=\"direct-link\" href=\"#on-the-bright-side\">#</a></h2>\n<p>We did get to see some of the eclipse today! So much better than 2017, when it was terribly cloudy and overcast. This one reminded me of when I was in high school (mid 90s) and we also got to experience an eclipse. Very cool.</p>\n<p>With that - until next time.</p>\n",
      "date_published": "2024-04-08T18:20:28+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/oh-for-crying-out-loud!/",
      "url": "https://shanewrogers.lol/posts/oh-for-crying-out-loud!/",
      "title": "Oh for crying out loud!",
      "content_html": "<h2 id=\"all-i-can-do-is...\">All I can do is... <a class=\"direct-link\" href=\"#all-i-can-do-is...\">#</a></h2>\n<p>Just sigh. In the realm of household appliances, my luck has not generally been very good. Let's just head straight into our latest little issue. We have (had? still have?) a Samsung Dryer.</p>\n<p>For most of you who are (not?) out there, you may or may not know that Samsung makes a really shoddy piece of junk for a dryer. The drums in them like to crack and the rollers basically destroy themselves. It's a major issue, and they are basically ignoring the problem.</p>\n<p>So we purchased a new set, that is not Samsung. The delivery was this morning, but naturally did not get to go as planned. Something to do with the water shutoff valve not cooperating with the cold water. Yippee.</p>\n<p>I just can't even, right now.</p>\n",
      "date_published": "2024-04-04T17:37:14+00:00"
    }
  ]
}
