{
  "version": "https://jsonfeed.org/version/1",
  "title": "My Corner of the Internet feed for journal",
  "home_page_url": "https://shanewrogers.lol/",
  "feed_url": "https://shanewrogers.lol/feed/feed.json",
  "description": "Just a place for me to share some stuff.",
  "author": {
    "name": "Shane Rogers",
    "url": ""
  },
  "items": [{
      "id": "https://shanewrogers.lol/posts/at-the-desk-on-voting-eve-or-50-days-down/",
      "url": "https://shanewrogers.lol/posts/at-the-desk-on-voting-eve-or-50-days-down/",
      "title": "At The Desk on Voting Eve - Or 50 days down",
      "content_html": "<p>Here I sit, doing something that has become - for lack of a better word - unusual.</p>\n<p>I normally do my posting, updating, whatever you may, from my phone. So for me to be sitting at my desk, hands on a keyboard, eyes firmly entrenched on the monitor to my left, typing away at this Emacs (FTW!) window, it's rather not normal.</p>\n<p>Over time, I've just kind of gotten used to writing in this journal from my mobile device. It's easy, if not quick, and it <em>just works</em>. I guess.</p>\n<p>I would love to be one of those persons who could throw out tens of hundreds of words at a time, in a coherent and easy to follow manner, on any number of wonderful themes. But I'm not.</p>\n<p>I write about what's going on in my life, usually something that's centered around my kiddos or my job. Most usually something that probably isn't even interesting to myself. But I still try to find the time to do this.</p>\n<p>It does, perhaps, in its own way, help me to keep my sanity in some kind of check.</p>\n<p>So I sit here today, writing at my desk.</p>\n<p>Yeah, I'm using Emacs (not, I guess, in a <em>by the way</em> fashion of the <em>Archlinux</em> variety - which I do not actually use). Of the Doom Emacs variety. I've tried to go the <em>roll your own</em> route, but I've come to the conclusion that I'm always just trying to come up with my own Doom-spin-from-scratch...so might as well flippin' use Doom.</p>\n<p>But I don't use evil. Because I'm not evil-leaning. If you wanna use vim keybindings, then you do you. No harm no foul, doesn't hurt me either way. I can get by in vim, I think that anyone who works in a Unix environment should at least know their way around.</p>\n<p>Oh...yeah, tomorrow is <strong>the day</strong>. I'm so ready for this crap to be over, but I am realistic to know that tomorrow is really only the beginning of the ending. Either it's all gonna burn down (again) or it's gonna be a controlled burn. Either way. I know that I'll vote for the side of sanity, because I care about where I would like things to go and I care about the country that I leave my kids to.</p>\n<p>Living in a Red State, I'd normally say that my actual vote doesn't really count, but, it's kind of (almost) starting to actually count. Give it time, maybe it will. There is still local stuff, which is uber important as well.</p>\n<p>Then, well - and I kind of <em>almost</em> hate myself for admitting this fact - there is a small tiny part of me that hopes the side of chaos and insanity wins. <strong>Why the ever loving F would I want that?!</strong> Because I really despise the morons and idiots who <em>think</em> that the great orange gibbon gives a flying flip about them. Maybe they should get their just desserts. But, I don't really, <strong>really</strong>, hope that happens. Certainly not enough to vote that way.</p>\n<p>That would make a great story, though, perhaps.</p>\n<p>Though, I guess it's probably already been written a few times.</p>\n<p>This is post 50/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n<p>Whoa! I'm halfway through the challenge! Woot.</p>\n",
      "date_published": "2024-11-04T21:20:33+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/another-halloween-down/",
      "url": "https://shanewrogers.lol/posts/another-halloween-down/",
      "title": "Another Halloween Down",
      "content_html": "<p>I think I'm slowing down.</p>\n<p>I'm moderately certain that I am slowing down.</p>\n<p>Not that I want to make this post be anything more than a &quot;Hey, guys! I'm <em>almost</em> halfway finished with my 100 days challenge!&quot; But yeah, that may be dang near what this turns into.</p>\n<p>Today is November 1. (Which reminds me, I need to update the front matter to this post.) Which would make yesterday Halloween. Yep.</p>\n<p>We took the two youngest kiddos out trick or treating last night, along with  a couple of the older ones friends. We had a pretty good time. What were we all dressed as, I hear absolutely nobody asking....well, I'll be glad to say!</p>\n<p>We had Thing 1 and Thing 2, a Minecraft Ender Dragon and the final kid didn't really have a costume unless you counted their standard daily &quot;skater grunge punk&quot; as a costume... meh why not!</p>\n<p>The wife dressed up as a good looking broken doll, while I was some dapper looking gentleman from old time-y whenever and wherever. It was fun.</p>\n<p>The older two did also dress up, though one went out with his friend to trick or treat, while the other started out at the community garden before heading downtown. The first was a cool looking anime school character while the other was some kind of dark leather bound bird demon or something.</p>\n<p>I'm glad that's over, though. More or less.</p>\n<p>Now it's all about getting ready for the holidays.</p>\n<p>I'm just kinda sad that I never made it to the World's of Fun Haunts.</p>\n<p>This is post 49/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-11-01T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/another-week-down/",
      "url": "https://shanewrogers.lol/posts/another-week-down/",
      "title": "Another week down",
      "content_html": "<p>What all is going on this week?</p>\n<p>Not a whole heck of a lot, although I do suppose that there will be a holiday of some sort thrown into the mix, in one way or another.</p>\n<p>We've got most of the costume situation sorted out, at least for those that want them.</p>\n<p>The major question is whether or not the last one is going to arrive in time. I do believe that things are going to be very close.</p>\n<p>Last week was pretty good over all. One contract at work was finally taken care of, which is one giant weight off of my shoulders.</p>\n<p>I've also recently (re)learned, after having forgotten, that Oracle is no longer supporting their graphical catalog manager from the BI tools packages. They are, however, continuing development of the command line client.</p>\n<p>Which, I suppose, is actually not a bad thing as I can script that bad boy to get my reports.</p>\n<p>This upcoming week should be good, one kiddo will be heading to an orchestra event. Leaving at 6:45 in the morning. Yippee.</p>\n<p>Should be a good week!</p>\n<p>This is post 48/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-10-26T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/such-a-strange-week/",
      "url": "https://shanewrogers.lol/posts/such-a-strange-week/",
      "title": "Such a strange week",
      "content_html": "<p>It has been such a long, unusually strange week.</p>\n<p>Let us take yesterday, as an example: it was a Friday, but it didn't feel like a Friday. Nor did it feel like a Saturday. Or a Sunday. I don't know what day of thee week it felt like, it just seemed off.</p>\n<p>I would imagine that having odd number of kiddos home probably had something to do with it. Parent teacher conferences make for a short week of school. The majority of them only had a three day week. The one oddity being the kiddo in advanced math having to take his class on Thursday at the high school. Then they were all home on Friday, which is super exciting.</p>\n<p>Insofar as work goes for me, I assisted with a presentation and facilitation of a question and answer session for the new ticketing tool that we've been on for a month or so.</p>\n<p>That actually went pretty well.</p>\n<p>Documentation has been added to for the department. I think that is one of my favorite things to do, if I'm being honest. I try to keep good instructions for not only future me, but for my users as well. We've got a pretty decent wiki application for that. Of course I still wind up just exporting stuff out to PDF, but it is what it is.</p>\n<p>I have jumped back into trying to learn Angular once again. The previous attempt was back in 2020 and I almost made it all the way through the course that I was taking. I've got a handful of them, two of them are pretty highly recommended. I would say that I'd like to get some kind of webdev position, but I think realistically I love what I do far too much to go that route.</p>\n<p>Of course, I also like to dabble in Clojure, so yeah.</p>\n<p>I feel that I'm kind of akin to the hyperactive pet who sees one shiny thing after another and just can't keep his mind on one thing at a time. I get bored easily I suppose.</p>\n<p>Then I'm also currently staring at a hard copy of <em>Django 5 By Example</em>. Ugh. I've liked django since before they went through the magic removal stuff. Way, way back in the day at this point. I'd even built a blog that contained a reading list that pulled info from a certain well known book selling website to keep my reading list in. I was kind of proud of that.</p>\n<p>Ah well.</p>\n<p>Not much going on today - we'll make a store run and take the little one to birthday party. Should be fun!</p>\n<p>This is post 47/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-10-19T15:51:44+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/week-that-was-and-other-stuff/",
      "url": "https://shanewrogers.lol/posts/week-that-was-and-other-stuff/",
      "title": "Week that was and other stuff",
      "content_html": "<p>Time to play a little bit of catch-up, seeing as I didn't post anything yesterday. Or the day before.</p>\n<p>I shall wait for the collective &quot;aww, shucks, we sure missed reading your stuff!&quot;, because, yeah, it's still basically just for myself. Which is totally cool with me.</p>\n<h3 id=\"last-week\">Last Week <a class=\"direct-link\" href=\"#last-week\">#</a></h3>\n<p>Not a whole heck of a lot going on last week really.</p>\n<p>Picked up the new work laptop so I could replace the one that has basically had the battery and keyboard crap all over itself, so that's been fun. Which, I'm pretty sure that nobody in the history of the world has ever actually said. While I do have backups of everything and don't have much to worry about in that department, getting the new machine all sorted out is just a huge pain in the rear.</p>\n<p>But, it is a great time to look and reflect on the applications that I <em>really</em> need to do my work with. Plus, it's been great to get away from Firefox and move my work browsing over to Vivaldi. So there is that.</p>\n<p>I was able to get WSL2 set up, even exported/imported my old setup image which is amazing.</p>\n<p>We might finally have the Halloween costume situation sorted out for everyone in the house - no small feet these days. Yesterday we made a short trip to one of the regional <em>Spririt Halloween</em> stores, conveniently located near a <em>Costco</em> that we also needed to run into, to gather ideas and make a handful of purchases.</p>\n<p>One of the twins picked up some black raven stuff, about all that we needed to get afterwards was a black overcoat and now some black pants that he won't complain about. Wish us luck there. The overcoat was not very easy to find and we wound up spending a bit more than I'd like - but, we sure do love our kids, right?</p>\n<p>The other twin was going to go with a Knight theme, but decided last minute not to go that route. Now he's going with an anime character. We had to order his costume last night, and the hope now is that it <em>fits him</em> and <em>isn't made super cheaply</em>. So, we'll see there.</p>\n<p>The wife picked up some cool face masks, the favorite at the moment would seem to be a broken doll. I really like the idea.</p>\n<p>For myself, I procured a <em>Phantom of the Opera</em> style mask that I'm hoping is able to complement the rest of the outfit that I've got. I'm not doing a silly cape, though.</p>\n<p>The little one already had his costume purchased - an <em>Ender Dragon</em> from <em>Minecraft</em>.</p>\n<p>The next to youngest (but quite possibly the most mature) of the group, still has yet to really put a finger on what he'll do. We had thought that he and a friend were gonna do some kind of matching costume set, but that seems to have changed. Last year they did <em>Mario and Luigi</em>, the year before was the <em>Sun and Moon</em>. I don't know what they'll do yet.</p>\n<p>I do believe that was basically most of last week (with some smattering of yesterday, alas) which brings us to...</p>\n<h3 id=\"this-week\">This Week <a class=\"direct-link\" href=\"#this-week\">#</a></h3>\n<p>It's a short school week, which is always fun.</p>\n<p>Not.</p>\n<p>Parent teacher conferences are at the end of this week. We've really only got one kiddo who I'm concerned about, but really, all in all I can't complain about our kids.</p>\n<p>The youngest kiddo has Fall Picture Day coming up Tuesday. Which at least kinda makes sense, moreso than the middle school who does picture day on like the third day of school. I, for one, am looking forward to when picture day happens like the week before school starts. It's only a matter of time.</p>\n<p>We've got some other appointments happening this week too, which shouldn't be too trying.</p>\n<p>On the work front, I'll be taking part in a demo/question/answer session for some new tools that I'm also in the middle of learning. Fun times, that.</p>\n<p>We are also still fighting with getting things paid, so that blows chunks all over the road. Sometimes one wonders if the <em>right hand</em> is aware that the <em>left hand</em> exists and is doing things.</p>\n<h3 id=\"link-dump\">Link Dump <a class=\"direct-link\" href=\"#link-dump\">#</a></h3>\n<p>I might even have some links to dump on the post this week.</p>\n<ul>\n<li>\n<p><a href=\"https://htmlforpeople.com/\">HTML for people</a><br>\nI have yet to go through much of this, well, any of it really. But you can't go wrong with a good up to date source for learning HTML. From Blake Watson.</p>\n</li>\n<li>\n<p><a href=\"https://www.kcur.org/arts-life/2024-10-11/were-fighting-that-throwaway-culture-local-kitchenaid-repair-shop-gains-international-following\">A KitchenAid repair shop in Kansas found a global following by ‘fighting that throwaway culture’</a><br>\nThought this was pretty cool, given that it's from the home State.</p>\n</li>\n<li>\n<p><a href=\"https://every.to/p/the-disappearance-of-an-internet-domain\">The Disappearance of an Internet Domain</a><br>\nI have seen a lot of talk about this, given recent politcal happenings. This might be something to keep an eye on. I don't have any dot-io domains, but I do use some dot-io services.</p>\n</li>\n<li>\n<p><a href=\"https://www.thetimes.com/life-style/parenting/article/we-only-learnt-of-our-sons-secret-online-life-after-he-died-at-20-rj3bqfnqn\">We only learnt of our son’s secret online life after he died at 25</a><br>\nI'll admit, this one got me in the feels.</p>\n</li>\n</ul>\n<p>With that, we'll call it a day.</p>\n<p>Until next time.</p>\n<p>This is post 46/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-10-14T14:50:30+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/trying-to-leave-onenote/",
      "url": "https://shanewrogers.lol/posts/trying-to-leave-onenote/",
      "title": "Trying to leave OneNote",
      "content_html": "<p>This particular post is most likely just going to be of interest to future me, though some others may find some information of use.</p>\n<p>As my place of employment is a Microsoft shop, we use a large number of Microsoft applications. Personally, I'm not really a major fan of some of these apps so I like to look for good alternatives.</p>\n<p>Fortunately, I have grown used to being in the WSL environment and Emacs in particular.</p>\n<p>Historically I have been using OneNote to keep track of, um, notes and tidbits and whatever else one might want to put into a notebook. It has worked <em>just fine</em> but I don't like the fact that I don't have a lot of control over the format. I've kind of grown fond of just using text, and have been attempting to integrate Emacs' org-mode into more of my workflow.</p>\n<p>(I would love to say that I'm using org-mode for this blog, but alas, I am not - although it <strong>is</strong> plain markdown.)</p>\n<p>I recently came upon a tool that caught my interest, the <a href=\"https://github.com/alopezrivera/OneNoteExporter\" title=\"OneNoteExporter by alopezrivera\">OneNoteExporter</a> PowerShell script from <strong>alopezrivera</strong>. Easily enough installed into my Windows 11 laptop, it only really required pandoc as an additional requirement.</p>\n<p>Once I had the configuration file tweaked to my liking, I fired the script off. Of note, the powershell script needs to run at the same user level elevation as the currently running OneNote application. Also, a temporary script bypass may need to be run in powershell in order for the process to succeed: <code>Set-ExecutionPolicy ByPass -Scope Process</code></p>\n<p>There were a handful of errors at first, which were similar <a href=\"https://github.com/alopezrivera/OneNoteExporter/issues/11\">to this issue</a>. I was able to make the same edit as suggested and those problems were resolved.</p>\n<p>The next stumbling block that I came upon was the large amount of screenshots and images that I had in my OneNote notebooks. Those were not being exported by the pandoc process. As is normal within the world of the internet, I <a href=\"https://github.com/theohbrothers/ConvertOneNote2MarkDown/issues/183\">was not the first person to have this problem</a>. One thing that I most absolutely <em>did not</em> want to have to do was re-save all of those images in another format, <strong>or</strong> copy and paste the pages themselves into a new page - both of which were suggested as possible solutions. Thankfully, a very simple solution was found by another user <a href=\"https://github.com/theohbrothers/ConvertOneNote2MarkDown/issues/183#issuecomment-2343708831\">in that OneNote needs to download all files and images before syncing</a>.</p>\n<p>With that issue taken care of, everything was golden, right?</p>\n<p>Mostly.</p>\n<p>I still had to go through and add the proper filename extension to all of my fresh org files. Still haven't figured out why that was, but it was easy enough with emacs and wdired mode.</p>\n<p>Now, with my work related notes over in org mode and copied up to the work OneDrive I should be ready to roll.</p>\n<p>I hope.</p>\n<p>This is post 45/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-10-10T15:21:38+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/work-work-work/",
      "url": "https://shanewrogers.lol/posts/work-work-work/",
      "title": "Work work work",
      "content_html": "<p>It feels like it's been a decade since I last made a post here.</p>\n<p>It has not, of course, but just the nature of the beast that is time, has made the days and hours drag on into endless streams of murk.</p>\n<h3 id=\"work-stuff\">Work stuff <a class=\"direct-link\" href=\"#work-stuff\">#</a></h3>\n<p>At work we have been going through a new purchasing and procurement process. Oh my ever loving flying spaghetti monster...talk about making the days flipping drag on. The problem with this is that many weeks ago we had let them know that we were going to need to renew a cloud based service license that we've been using since before I started there, about five years ago.</p>\n<p>Our contract expires on the ninth of this month. We've had a quite from them since before the start of this month, say late September. This was sent to procurement.</p>\n<p>Who it seems have sat on it, as is their way. They did, eventually, let us know that &quot;Hey, can we get you guys to fill out this form?&quot; Oh <strong>FFS</strong>. Sure, I'll fill the form out.</p>\n<p>Couple of days later, &quot;Hey, we need some clarification on such and such.&quot;</p>\n<p>Oh. Em. Gee.</p>\n<p>If we lose access to this freaking tool because they took their sweet arse time, I'm gonna hurl.</p>\n<h3 id=\"more-work-stuff\">More work stuff <a class=\"direct-link\" href=\"#more-work-stuff\">#</a></h3>\n<p>In other work related fun and excitement, I've got a brand spanking new work laptop to get set up.</p>\n<p>I think this is my least favorite activity to do in the whole entirety of existence.</p>\n<p>I feel that I should be working on getting it set up now, but it's a Saturday and I don't work on weekends. I love my job, but not that much.</p>\n<p>Besides it's about time to get dinner ready.</p>\n<h3 id=\"non-work-stuff\">Non work stuff <a class=\"direct-link\" href=\"#non-work-stuff\">#</a></h3>\n<p>Do I have any non work related stuff to share today?</p>\n<p>Oh, I managed to get into the dentist office not <em>once</em>, but <em>twice</em> this week! You should be sooo jealous and envious of me now.</p>\n<p>I've got some other projects in the making, I think, one of which will be a new smaller NAS using a Zima Blade server. I've got the setup I just need to get the storage now.</p>\n<p>I'll be rooting for the Kansas City Royals, too. They've already had a successful season, but it would be amazing to see them win another series and move on.</p>\n<p>All right, until we meet again.</p>\n<p>This is post 44/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-10-05T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/my-tool-selection-stinks/",
      "url": "https://shanewrogers.lol/posts/my-tool-selection-stinks/",
      "title": "My tool selection stinks",
      "content_html": "<p>Yeah, this is one of those &quot;I'm just kinda pissed off days&quot;.</p>\n<p>I despise these days, but I guess at least I know it's a thing - right?</p>\n<p>The so called straw today has been the fact that we have to replace the plate on one of the vehicles. This would not be a problem if the plate were easy to remove.</p>\n<p>But, no, one of the screws is good and rusted in and now stripped out. Went to one of the hardware stores in town and bought the only screw extraction kits they had - some POS that is. Sigh.</p>\n<p>Now I'm waiting on the Dremel to charge up. Yeah, I'm just going to go nuclear on it. Kind of out of options at this point, honestly.</p>\n<p>I just want to know why it is that the State can't just have plates replaced as they go. Seems like an expensive ordeal to me.</p>\n<p>Oh well. I need better tools.</p>\n<h3 id=\"link-dump-sunday\">Link Dump Sunday <a class=\"direct-link\" href=\"#link-dump-sunday\">#</a></h3>\n<ul>\n<li>\n<p><a href=\"https://simonwillison.net/2024/Sep/27/themes-from-djangocon-us-2024/\">Simon Wilson has a writeup of DjangoCon 2024</a><br>\nSome really cool talks and other stuff from the looks of it.</p>\n</li>\n<li>\n<p><a href=\"https://www.citationneeded.news/posse/\">POSSE: Reclaiming social media in a fragmented world</a><br>\nInfo on how Molly White does her own style of POSSE, includes a link to her own source repo.</p>\n</li>\n<li>\n<p><a href=\"https://glenneth.org/a-journey-into-scheme.html\">My Journey into Scheme: Building a Simple Symlink Manager with Guile Scheme</a><br>\nHave yet to read this, but I do like to read about other people's journeys through these types of paths.</p>\n</li>\n</ul>\n<p>We shall call that good for now.</p>\n<p>This is post 43/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-09-29T19:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/my-couch-to-5k-start/",
      "url": "https://shanewrogers.lol/posts/my-couch-to-5k-start/",
      "title": "My couch to 5k start",
      "content_html": "<p>Yesterday I started my first session of the <em>Couch to 5K</em> program.</p>\n<p>I'm not going to say that it was completely brutal, but it was definitely a challenge for myself.</p>\n<p>I've never been a runner. Nor a jogger. Heck I haven't even been much of a walker with the exception of the last year, maybe.</p>\n<p>But for some reason, I've got this crazy idea that I would like to run a 5K.</p>\n<p>Slowly but surely I have been trying to work my body to to being prepped, in some way, for the coming activity. By walking and trying to keep a brisk pace, by going longer and longer distances.</p>\n<p>At this point, I can do right at a three mile walk in about 40 to 45 minutes. My average is just over a 13 minute mile.</p>\n<p>Certainly not an Olympic caliber, but I'm okay with that.</p>\n<p>Yesterday, using one of the many <em>C25k</em> apps out there, was my first stress test. I would say that I succeeded.</p>\n<p>Sure, it was not easy, and yeah I was looking forward to that &quot;You are on run 8 of 8&quot; notification, but I survived.</p>\n<p>I did the complete 3K (I think) trek in 30 minutes, finishing very close to the end of our trail at the conclusion of the program.</p>\n<p>Of course, silly me still wanted to finalize my <em>actual</em> normal walk path, so I continued on for another less than mile.</p>\n<p>That, I admit and know now, was a mistake. According to my Fitbit app, the first two miles were under 13 minutes each.</p>\n<p>The last was at an over 17 minutes pace. Yeah, no good, and I felt it!</p>\n<p>I'm looking forward to doing this again today!</p>\n<p>This is post 42/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-09-27T14:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/one-most-non-excellent-day/",
      "url": "https://shanewrogers.lol/posts/one-most-non-excellent-day/",
      "title": "One most non excellent day",
      "content_html": "<p>Good grief has it been a rough day.</p>\n<p>Had the youngest kid home today, &quot;sick&quot;, from school.</p>\n<p>Naturally, when I got back home from picking one of the twins up from zero hour to take him to school number two, the child was all &quot;I feel much better now, can I do this other thing that I am not allowed to do on days that I'm home sick from school?&quot;</p>\n<p>Of course, that wasn't <em>exactly</em> how he asked, but I'm sure the idea has been transferred.</p>\n<p>That was also not the only thing that was asked for, nor were these questions only asked one time.</p>\n<p>Incessant, constant nagging.</p>\n<p>It really, just kind of grates on the mood and makes one want to just disassociate.</p>\n<p>After all of that, then it's time to get dinner prepped and ready. Something that I generally actually enjoy doing.</p>\n<p>Cooking is fun. Relaxing. Prepping things that people might want to eat.</p>\n<p>Low and behold, today was the attack of the crummy, small, no stinking room in it, kitchen.</p>\n<p>No room in the floor. Nor the countertop. Cat food spilled all over the floor. Cauliflower dropped on the floor.</p>\n<p>There are some days where it just feels like the world is out to get you. I know that's ridiculous.</p>\n<p>But oh my ever loving lord.</p>\n<p>This is post 41/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-09-24T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/some-accomplishments-and-a-challenge/",
      "url": "https://shanewrogers.lol/posts/some-accomplishments-and-a-challenge/",
      "title": "Some accomplishments and a challenge",
      "content_html": "<p>Yesterday was <em>disable access and delete our cloud service desk</em> product day.</p>\n<p>I think. The days just kind of blend together. It went fairly well, I think. I've been able to get a small handful of documentation put together as well.</p>\n<p>There was a lot of stuff that got accomplished yesterday, in fact. Got some quotes, got some import scripts written and ran. I still want to go through and clean these up, maybe get them working with <em>uv</em>. Assuming root isn't required.</p>\n<p>I've got to get some patches on the schedule, which is all good.</p>\n<h3 id=\"october-challenge\">October challenge <a class=\"direct-link\" href=\"#october-challenge\">#</a></h3>\n<p>There aren't a whole lot of things that I do to challenge myself these days. I need to change that, so I'm going to go easy with this one.</p>\n<p>First, I've decided that my Steam library is just too ridiculous. Plus, my wallet.</p>\n<p>I find that I far, far too often get sucked into steam sales and other bundle sales. It's time to try to go a month without making any game purchases.</p>\n<p>Wish me luck.</p>\n<p>This is post 40/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-09-20T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/change-is-for-the-anxious/",
      "url": "https://shanewrogers.lol/posts/change-is-for-the-anxious/",
      "title": "Change is for the anxious",
      "content_html": "<p>Sometimes there are aspects of my job that are really, really, butt pickering and anxiety inducing.</p>\n<p>Today is lining up to be one of those days.</p>\n<p>As I write this, it's after 08:30, as soon as I get back into the (home) office I get to remove a couple of our cloud applications we subscribe to.</p>\n<p>It's a <em>cloud</em> service desk product, a very popular and well known one. We have turned over to a new system as of this week, basically. We will only be continuing with one of their products, for project management, since the new one kinda sucks, in order for people to get used to the change.</p>\n<p>Naturally, this company is unable to provide us with an appropriate quote for just the single product unless we remove, thus deleting, everything that's on their servers. We have their <em>export for our own cloud</em> pulled down, so, we should have everything.</p>\n<p>In theory.</p>\n<p>It is still arse clenching to remove these though.</p>\n<p>This is post 39/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-09-19T13:45:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/dammit-amazon/",
      "url": "https://shanewrogers.lol/posts/dammit-amazon/",
      "title": "Dammit Amazon",
      "content_html": "<p>I think I'll keep it short and sweet today.</p>\n<p>I'm at that point to where I think I really stinking despise Amazon deliveries.</p>\n<p>Was supposed to get a couple of packages today, a movie along with some other useful items.</p>\n<p>We received <em>some</em> of them. One item, though it was packaged decently, has this ridiculous white scratch mark that shouldn't be there and that I shouldn't have to live with. So that'll have to be dealt with - fine.</p>\n<p>One item, a 4K movie, which had been ordered separately but was shipped in the same delivery (theoretically) was not received. But does Amazon have a way to say &quot;one item from this delivery was not received&quot;? Not that I can tell. So, I just say &quot;delivery not received&quot;, with a comment about the item missing.</p>\n<p>I'm done with Amazon.</p>\n<p>At least for now.</p>\n<p>It's hard to avoid them sometimes.</p>\n<p>This is post 38/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-09-13T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/today-was-the-day/",
      "url": "https://shanewrogers.lol/posts/today-was-the-day/",
      "title": "Today was the day",
      "content_html": "<p>Well today was the day.</p>\n<p>We've been working towards getting the new single overall help desk slash inventory slash <em>cough</em>project management<em>cough</em> service set up for our department for a handful of months at this point.</p>\n<p>Things were finally, more or less, set up and turned on this afternoon. The last thing that was holding things up was the email set up and monitor service. This, evidently, required a lot of thought and assistance from central IT, from the vendor we're purchasing the service from, and from the vendor we procure our email service from.</p>\n<p>Even with all of that help, it took hours of working over multiple days.</p>\n<p>But, they've gotten it set up for us. It's great to be the guinea pig.</p>\n<h3 id=\"cross-country\">Cross country <a class=\"direct-link\" href=\"#cross-country\">#</a></h3>\n<p>The twins attended the second cross country meet of the season this week. Both of them were able to run this time and I'm proud as heck of them.</p>\n<p>Just finishing one of these things would be a major challenge for me, and these two both do all right. They have made excellent progress since last year.</p>\n<h3 id=\"entertain-me\">Entertain me <a class=\"direct-link\" href=\"#entertain-me\">#</a></h3>\n<p>It has certainly been a week for receiving movies and books and other entertainment items.</p>\n<p>My copy of the Japanese collectors edition box of <em>Godzilla Minus One</em> arrived early this week. Blu Ray, 4K UHD, it looks <strong>phenomenal</strong>. Plus it comes with <em>Godzilla Minus One Minus Color</em>. I'm beyond excited to have this!</p>\n<p>I also picked up steelbooks of <em>Coraline</em> and <em>The Last Unicorn</em>. Two of my favorites.</p>\n<p>My copy of <em>Dark Nights Metal</em> graphic novel arrived this week as well. I've actually read the series previously, back when I subscribed to DC Universe Unlimited, or whatever it is that the online DC comics platform is called. Very good stuff and I'm looking forward to reading it again.</p>\n<p>In &quot;TV&quot; land, we've been watching <em>The Fall of the House of Usher</em> on Netflix over the past week. Pretty decent stuff, only eight episodes so not a lot of filler. The volume is a little inconsistent at times though.</p>\n<p>All right then, that's what I've got this time, until the next.</p>\n<p>This is post 37/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-09-12T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/call-it-a-weekly-wrapup/",
      "url": "https://shanewrogers.lol/posts/call-it-a-weekly-wrapup/",
      "title": "Call it a weekly wrapup",
      "content_html": "<p>Not much of an interesting week, this one.</p>\n<p>I've been meaning to try to get something down and posted but it's been a week of zero motivation.</p>\n<p>I haven't even mowed the lawn in two weekends at this point. Fortunately I don't think I <em>need</em> to mow yet, but I probably will before the season is out.</p>\n<p>One of the twins was able to participate in the first cross country event this season and he did pretty well! I would like to be able to run with him, but I'm not there yet.</p>\n<p>I still try to take my lunch hour excursions and walk. Generally I can get in just under three miles in about forty minutes. Then a quick shower before logging back in to work.</p>\n<p>My goal still remains to run a 5K. I'm sure I'll get there.</p>\n<p>I had ordered the <em>Run Your Own Mail Server</em> book, by Michael W Lewis, towards the end of the pre-order period and it finally arrived this week! I've run mail servers for myself in the past, generally through systems like <a href=\"https://mailinabox.email/\">mail on a box</a> or <a href=\"https://yunohost.org/\">yunonost</a>. I think even at one point I had set up <a href=\"http://www.qmailtoaster.net/\">qmail toaster</a>.</p>\n<p>But it's nice to know more about the what's and the why's, and it looks like this most excellent book is going to help out in that department. I don't know that I'll set something up from scratch... But that is certainly an itch.</p>\n<p><img src=\"https://cdn.some.pics/swrogers/66de154608ac5.jpg\" alt=\"The book: Run Your Own Mail Server, by Michael W Lucas\"></p>\n<h3 id=\"linkdump\">Linkdump <a class=\"direct-link\" href=\"#linkdump\">#</a></h3>\n<ul>\n<li>\n<p><a href=\"https://www.sigops.org/2024/the-moral-implications-of-being-a-moderately-successful-computer-scientist-and-a-woman/\">The Moral Implications of Being a Moderately Successful Computer Scientist and a Woman</a><br>\nI have not read this one yet, but it's certainly high on my list.</p>\n</li>\n<li>\n<p><a href=\"https://cleoinvestigation.notion.site/Investigating-Cleo-0796ef7ce8464a90ba388cdb68e08eef\">Investigating Cleo</a><br>\nIt's always entertaining to read about who mysterious anonymous posters might be, even if there is no real need or desire to dox anyone. I haven't made it through everything in this, but it's about a user in one of the math boards who always manages to post responses to some very challenging integration problems. Are they a team? Are they using multiple accounts? Who knows.</p>\n</li>\n<li>\n<p><a href=\"https://earthly.dev/blog/golang-http/\">Building a Golang JSON HTTP Server - Earthly Blog</a><br>\nI've been looking more into learning go, so it's nice to have more stuff to learn from.</p>\n</li>\n</ul>\n<p>That's all I've got for now, until time the next all!<br>\nThis is post 36/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-09-08T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/long-weekend-and-no-motivation/",
      "url": "https://shanewrogers.lol/posts/long-weekend-and-no-motivation/",
      "title": "Long weekend and no motivation",
      "content_html": "<p>Happy long weekend all!</p>\n<p>I guess.</p>\n<p>I can't really relax, I have this constant feeling today that I need to be doing something. Anything.</p>\n<p>It's not like I've been lazy today, either. Woke up, made my mug of coffee. Cleaned out the floor of our &quot;soon to be coat&quot; closet. Emptied the dishwasher. Filled the dishwasher. Ran the dishwasher. Took my first sip of coffee.</p>\n<p>Still there are so many things that need to be done. Or, that I feel should be done.</p>\n<p>I should mow the lawn, for example.</p>\n<p>I can't get motivated today.</p>\n<h3 id=\"the-weekend\">The weekend <a class=\"direct-link\" href=\"#the-weekend\">#</a></h3>\n<p>We had a pretty decent weekend I guess.</p>\n<p>Saturday was a birthday party for the daughter of a friend. Our little man enjoys going over there, so it was a good time.</p>\n<p>Sunday was the penultimate day for the local water park to be open this year, so we went out that direction. I didn't go there as I'm not as big a fan, but the wife and the little did go and seemed to enjoy the day.</p>\n<p>Myself and the eldest twin went to the amusement park side. It was really pretty good, not too hot, not too many people. We were able to get in half a dozen rides in - mostly coasters - within a handful of hours.</p>\n<p>Any time you don't have to spend three hours in a single line is a good day.</p>\n<p>Afterwards, we met up and had dinner in the the amusement park so the little guy could ride some stuff too.</p>\n<p>Then the adults got to eat.</p>\n<p>It was a successful trip, all in all.</p>\n<p>We'll be back in a couple of weeks for the halloween haunts they set up. Those are great!</p>\n<h3 id=\"link-dump\">Link dump <a class=\"direct-link\" href=\"#link-dump\">#</a></h3>\n<p>A day late and a dollar short. Refunds can be had at the door.</p>\n<ul>\n<li>\n<p><a href=\"https://fighthealthinsurance.com\">Fight Health Insurance</a><br>\nHave you ever been denied a health insurance claim? This site was built by a user who was sick and tired and wanted to help others. So this was created using an LLM.</p>\n</li>\n<li>\n<p><a href=\"https://sfstandard.com/2024/08/23/holden-karau-fight-health-insurance-appeal-claims-denials/\">'Make your health insurance company cry': One woman’s fight to turn the tables on insurers</a><br>\nAn article on the previous link.</p>\n</li>\n<li>\n<p><a href=\"https://landsat.gsfc.nasa.gov/apps/YourNameInLandsat-main/index.html\">Your name in LANDSAT</a><br>\nThis is just cool. 😎</p>\n</li>\n</ul>\n<p>This is post 35/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-09-02T16:00:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/did-we-not-just-do-that/",
      "url": "https://shanewrogers.lol/posts/did-we-not-just-do-that/",
      "title": "Did we not just do that",
      "content_html": "<p>It's almost like it never ends, you know!</p>\n<p>Received an email notification from <em>Ye Olde Vendor</em> that they were scheduling the next patch for our development environment. Great! But damn...it sure seems like we <em>just</em> went through all this!</p>\n<p>I guess that was in mid to late May. But <em>test</em> didn't get patched until flipping June, not to mention <em>prod</em> not that long ago.</p>\n<p>Ugh. At least they actually keep stuff updated. No new patches available for the gateway product, yet, so we'll keep an eye out there.</p>\n<p>It's been a pretty good week, actually. Got some documentation written and sent out. Got a quote and an order out together for some new laptops to replace out of warranty stuff. Not a bad week.</p>\n<h3 id=\"no-flame-wars-here\">No flame wars here <a class=\"direct-link\" href=\"#no-flame-wars-here\">#</a></h3>\n<p>I figured I'd start a separate header for this one.</p>\n<p>I have always been of the belief that you should use the tool, or tools, that work for you and your situation. If that took us, say, <em>vi</em>, then great! If that took is <em>emacs</em>, then great! Personally, it effects me exactly zero on the iota scale.</p>\n<p>Whatever makes you happy and floats that boat, or scratches that itch, or whatever. Though, I do believe that every body who is going to do any kind of system administration on a Unix style server should at least be able to stumble through vi or vim. If for no other reason than it's almost always available.</p>\n<p>Then even within those two sacred camps you've got people who espouse certain styles of usage. Take emacs, for example. Some people like to use the &quot;starter kits&quot;. Be that purcell, spacemacs, doom, bedrock, etc etc. Some people think you should use vanilla. Some people swear by a literate programming version of their config.</p>\n<p>Those are all awesome! Again, use what works for you. Personally, I'm familiar with vi enough that I'm a little dangerous. I don't have any kind of vi setup, I just know enough to get by. I have used emacs for some time now, my first real usage and &quot;config&quot; was spacemacs. Then I've gone through other kits. I've tried rolling my own, with and without a literate config. I've finally stopped with doom, complete with my own customizations.</p>\n<p>Just use what works. In Whatever way that is.</p>\n<p>That's all I've got on that.</p>\n<p>This is post 34/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-30T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/irrationality-it-is/",
      "url": "https://shanewrogers.lol/posts/irrationality-it-is/",
      "title": "Irrationality it is",
      "content_html": "<p>Sometimes I just don't really know.</p>\n<p>There are days that I just want to give up.</p>\n<p>Throw in the towel.</p>\n<p>Half of today was one of those.</p>\n<p>Things were okay for the most part, but then, the crap just gets flung into my face.</p>\n<p>Then, I turn irrationally angry.</p>\n<p>My mood sours and I become dour.</p>\n<p>I just, don't know.</p>\n<p>I guess I'm glad I've not done anything I won't regret doing.</p>\n<p>Right?</p>\n<p>This is post 33/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-27T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/oceans-of-tiredness/",
      "url": "https://shanewrogers.lol/posts/oceans-of-tiredness/",
      "title": "Oceans of tiredness",
      "content_html": "<p>Just got back from taking the kiddos to the local water and amusement park locale...we are all incredibly tired and wore out.</p>\n<p>It was, supposedly, a heat warning kinda day - but honestly it didn't seem nearly as bad as it has in the past. At the park, I didn't even get in too bad a shape until towards the end, and to be realistic I was actually cold.</p>\n<p>It goes along with water and not having a large amount of body fat these days. Something of a side effect I suppose.</p>\n<p>After spending some time with the kiddos in the wave pool, we headed over to the adjoining amusement park and fed the family. The nearby diner has a decent selection of, well, cheeseburgers or chicken fingers, salad, fruit, fries and onion rings.</p>\n<p>Lots of stuff that the kids like.</p>\n<p>Since we have four &quot;dining meals&quot; to go along with the gold entry passes, it makes things more worth it to eat a couple of meals there.</p>\n<p>But, good grief am I shockingly sore.</p>\n<h3 id=\"link-dump\">Link dump <a class=\"direct-link\" href=\"#link-dump\">#</a></h3>\n<p>I don't know how much I'll have for the weekly link dumpage, but here we go!</p>\n<ul>\n<li>\n<p><a href=\"https://github.com/mayank99/11ty-jsx-deno\">mayank99 11ty jsx and tsx template</a><br>\nI'm not really a huge fan of jsx style templating, but I can certainly appreciate the work that others have put in.</p>\n</li>\n<li>\n<p><a href=\"https://www.evalapply.org/posts/clojure-web-app-from-scratch/index.html\">Aditya Athalye - Clojuring the web application stack: Meditation One</a><br>\nI haven't read all of this one, but I'm looking forward to going through it all. I love clojure, and I like trying to write apps and web apps with it</p>\n</li>\n<li>\n<p><a href=\"https://www.analog.cafe/r/a-functional-lego-camera-kit-lego-zh1-i9j8\">Zung Hoang - LEGO camera that works!</a><br>\nAs an <em>adult fan of LEGO</em>, I love this <strong>a lot</strong>.</p>\n</li>\n</ul>\n<p>All right, I'm gonna call that a night!</p>\n<p>Take care, till next time.</p>\n<p>This is post 32/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-25T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/upgrades-and-accomplishments/",
      "url": "https://shanewrogers.lol/posts/upgrades-and-accomplishments/",
      "title": "Upgrades and accomplishments",
      "content_html": "<p>Some days you just feel like you got at least one thing accomplished.</p>\n<p>Today is one of those days.</p>\n<p>This morning was good, upgraded one of our development applications to the latest vendor patch. The super awesome thing about this being that as of the middle of last week said update was not available....though it probably should have been. Given the name of the patch and all is from <em>last month</em>.</p>\n<p>Sigh.</p>\n<p>Then, I was able to get some simple documentation done for our users. Granted, I think that we all know that it matters not how well said documentation is written, it's not gonna be good enough.</p>\n<p>Additionally, got some requests fired off to another vendor.</p>\n<p>Nifty.</p>\n<p>Tomorrow is another day. The plan for noonish is to upgrade the same application previously mentioned, but in the test environment.</p>\n<p>It is <strong>so nice</strong> actually having both DEV and TEST.</p>\n<p>I'm not anticipating any issues, I think I've got this down to a science.</p>\n<p>Till next time!</p>\n<p>This is post 31/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-21T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/not-a-day-late-nor-a-dollar-short/",
      "url": "https://shanewrogers.lol/posts/not-a-day-late-nor-a-dollar-short/",
      "title": "Not a day late nor a dollar short",
      "content_html": "<p>I would say that I'm a day late with my post, but then than would imply some sort of contract between myself and the reader. I'm pretty sure that we are all aware that there is no such thing here. Ha.</p>\n<p>Last week I did go ahead and get a pre-order in for <a href=\"https://io.mwl.io/@mwl\">Michael W Lucas'</a> new book on <em>Run Your Own Mail Server</em>. The ebook has already been delivered and I'm very much looking forward to flipping through the paperback when it arrives. I had considered picking up the hardback, but that cost is a little more difficult to justify.</p>\n<p>I don't necessarily intend to run my own mail server from scratch, but you never know. I do, however, currently run a mail server via yunonost and have in the past used mail-in-a-box, which is very nice as well.</p>\n<p>They are mostly just toy or hobby servers in my case though.</p>\n<p>Now that the kiddos are in school and it's super quiet during most of the day, I've been more able to take some time to get out and walk during the mid day once again.</p>\n<p>Related to an earlier post of mine, these are not exactly mind clearing excursions, but moreso a way to get active once again.</p>\n<p>Currently my average is right around the fifteen minute minute mile, or just below. I want to get faster, and once I'm super comfortable with my progress I will attempt to jog it.</p>\n<p>All for my goal to, possibly, maybe, run a 5K.</p>\n<p>Today's walk was pretty good, I changed my route up quite a bit and made a much larger circuit. Although it didn't actually make much of a difference in the distance, very negligible.</p>\n<p>Anyhow. That's what I've got, I think I've worked on this entry long enough now. It's been sitting for a couple of days.</p>\n<p>This is post 30/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-19T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/not-so-competitive-for-success/",
      "url": "https://shanewrogers.lol/posts/not-so-competitive-for-success/",
      "title": "Not so competitive for success",
      "content_html": "<p>There are a couple of things that I've recently realized about myself.</p>\n<p>One of them is something that I'm absolutely terrified about.</p>\n<p>Another is just a quirk, an interesting tidbit about me that I hadn't fully recognize before.</p>\n<p>First - in some ways success terrifies me.</p>\n<p>Second - while I'm about the least competitive person that I know, I'm always extremely competitive against (with?) myself.</p>\n<h3 id=\"item-the-first\">Item the first <a class=\"direct-link\" href=\"#item-the-first\">#</a></h3>\n<p>I'm sure that I'm not the only person out there that is terrified of something turning out to be successful. Whatever that something might be.</p>\n<p>Whether it's putting myself out there when looking for employment, for example, I have that fear not of <em>what if I get denied</em> but of <em>what if I get approved?</em></p>\n<p>Then there are social situations. This might, or might not, have just as much to do with being introverted as well, though.</p>\n<p>Let us say that I were to go looking for some kind of connection. Platonic or otherwise, it makes no matter. Frankly, I'm terrible at small talk. I've been told that I'm a competent communicator, but that's not necessarily for me to decide.</p>\n<p>I don't know how to make friends any more. It's tough.</p>\n<h3 id=\"item-the-second\">Item the second <a class=\"direct-link\" href=\"#item-the-second\">#</a></h3>\n<p>I have never been competitive.</p>\n<p>Ever.</p>\n<p>I was basically forced into playing team sports when I was a kid (granted, T-ball was fun - ha). Baseball. Basketball. Football.</p>\n<p>I could actually pitch with either left or right handed. Couldn't do it now to save my life, but it was a thing I was capable of.</p>\n<p>I never liked any of it though.</p>\n<p>Probably didn't help that all of the teams I was on stunk. But that's not relevant.</p>\n<p>I was able to come to the conclusion the other day that the only person I compete with, in any way, is myself.</p>\n<p>And it does not allow me to relax. Ever.</p>\n<p>Take keto, for example. When we started on keto five years ago I dove into the deep end. Got an app and basically <em>gamed the heck out of it</em>. I would try to see just how few carbs I could do compared to all the other users of the app. Routinely I fell into the top tier and could easily go less than 5 to 7 net carbs a day. Logging everything.</p>\n<p>I would go to sleep at night super stoked to get up in morning to see how much weight has fallen off. Quite often it would be a pound or so.</p>\n<p>Was it safe? Not really. But it was my addiction, that self competition.</p>\n<p>Another example would be when I take my noon walks.</p>\n<p>I would imagine that when most people take walks it helps to clear their minds for the time ahead.</p>\n<p>Yeah, that's not how my head works.</p>\n<p>My oh my how I wish it did.</p>\n<p>Nope, I have this constant beat that runs through my mind: <em>one, two, three, four, one, two...</em> On and on and on.</p>\n<p>I have the need to push myself, quicker and quicker. Finish strong! I tell myself.</p>\n<p>I matters not if I've got music in my ears or listening to an NPR podcast. Same story.</p>\n<p>Why can't I just relax?</p>\n<p>This is post 29/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-15T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/smooth-days/",
      "url": "https://shanewrogers.lol/posts/smooth-days/",
      "title": "Smooth days",
      "content_html": "<p>The first day of school for the kiddos is in the bag!</p>\n<p>Everything would seem to have gone nice and smooth, although it's not that much is actually done during the first day.</p>\n<p>I have to consider the fact that all of the kids really enjoy school, which does make things so much easier.</p>\n<p>Granted, the majority of them are teenagers (more or less) so all is not peachy and rosy. Sometimes just getting the older ones up and about can be quite the chore.</p>\n<p>But, I will most certainly take that little inconvenience over having a house full of kids that want nothing to do with school.</p>\n<p>Blessings counted and duly noted.</p>\n<h3 id=\"other-things-that-went-smooth\">Other things that went smooth <a class=\"direct-link\" href=\"#other-things-that-went-smooth\">#</a></h3>\n<p>Today has been kind of a day to dread for me. Two meetings that center around a project that has my anxiety levels beyond maxed out.</p>\n<p>We are moving from one &quot;top tier, best in class&quot; system (brought to you by Atlassian) to another....which isn't quite as user friendly.</p>\n<p>For both service desk (help desk ticketing) and project management.</p>\n<p>The help desk side is fine. Whatever.</p>\n<p>The project side. Could use a bit of <em>TLC</em>.</p>\n<p>It's going to require a bit of a rethink in the way we use the software.</p>\n<p>But, even the contact that we were able to work with today realizes and concedes some of the shortcomings.</p>\n<p>How fantastically refreshing.</p>\n<p>Still, it's not gonna alleviate a lot of the pushback from staff that I'm anticipating.</p>\n<p>Still not looking forward to it.</p>\n<p>This is post 28/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-14T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/the-day-after/",
      "url": "https://shanewrogers.lol/posts/the-day-after/",
      "title": "The Day After",
      "content_html": "<p>Whew, one day post birthday and one more on the books.</p>\n<p>For myself, I consider my birthday to be just another day. I can't say that I really care how the day goes, one way or the other. I would assume, like most other adults my age - it's just another day.</p>\n<p>I'm 47 as of yesterday. It's not a milestone year, just another step in the path.</p>\n<p>I don't feel 47. It's no different to me than, say 42 or 45.</p>\n<p>It's kind of surreal, if I were to say it was anything.</p>\n<p>When you're a kid, you don't really think of middle age. It's just something that you don't really see yourself being.</p>\n<p>Then, all of a sudden, your trying to put things into perspective. I try to place myself into my father's mindset and shoes and whatever when he was my age. How things were back then.</p>\n<p>How things have changed.</p>\n<p>I'm sure there's a word for the way I think, the way I feel.</p>\n<p>Ah well.</p>\n<h3 id=\"b-day-stuff\">B-Day Stuff <a class=\"direct-link\" href=\"#b-day-stuff\">#</a></h3>\n<p>The day before my birthday, we made pizza for the kiddos so the wife and I could get out and have a good dinner. I guess by good, I mean expensive.</p>\n<p>Well, of course it was good. We went out to a local fish house and raw bar. Big plate of broccolini and a delicious Greek salad with some of the sweetest cherry tomatoes we'd ever had. Then a large plate of oysters, shrimp, lobster tail and snow crab. Pretty good.</p>\n<p>Yesterday, we went to Worlds of Fun. Probably not the best idea as it was super busy. Gotta love lines. We were there maybe six hours and my eldest twin and I only rode three things. We've got passes, though, so we'll go back eventually.</p>\n<p>Today, we are just relaxing. New school year shoe purchases and mowing the lawn.</p>\n<p>Tomorrow, while not the first day of school, is close enough that the flurry will commence. I'm a little anxious about it all, the mornings are going to be really hectic around here.</p>\n<h3 id=\"link-dump\">Link dump <a class=\"direct-link\" href=\"#link-dump\">#</a></h3>\n<ul>\n<li><a href=\"https://blog.smithsecurity.biz/hacking-the-scammers\">https://blog.smithsecurity.biz/hacking-the-scammers</a><br>\nDEFCON is going on currently, and I love a good tale. I imagine that most of us have received those stupid &quot;USPS&quot; delivery package text messages. Here, Grant tells the tale of, ahem, someone taking things into their own hands.</li>\n<li><a href=\"https://100go.co\">https://100go.co</a><br>\nI don't really write in Go, but I'd like to. This seems like a decent list of what to avoid, perhaps.</li>\n<li><a href=\"https://wedistribute.org/2024/08/decentralized-social-icons\">https://wedistribute.org/2024/08/decentralized-social-icons</a><br>\nI don't think I could explain it any better than they could: <em>It's like Font Awesome, but for Platforms &amp; Protocols</em></li>\n<li><a href=\"https://sfwriter.com/ws7.htm\">https://sfwriter.com/ws7.htm</a><br>\nI'm more of an Emacs user, but I can certainly appreciate Wordstar. Here is an <strong>awesome</strong> package put together by author Robert J Sawyer.</li>\n</ul>\n<p>With that, I think we're good.</p>\n<p>This is post 27/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-11T20:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/five-years-keto/",
      "url": "https://shanewrogers.lol/posts/five-years-keto/",
      "title": "Five years keto",
      "content_html": "<p>It's funny how some things work out, you know?</p>\n<p>Yesterday was a milestone post for my bloggy journal thing, whatever one wants to refer to this site as, and today is a life changing milestone in that today is the fifth anniversary of the day that I started keto.</p>\n<p>Five years ago we made huge lifestyle changes. We were both sick and tired of being obese and wanted to see our kids grow up and have lives of their own.</p>\n<p>Five years ago we decided that we wanted to model better behavior for our kids, at least as far as nutrition choices were concerned.</p>\n<p>Five years ago I was well on my way to diabetes I'm sure of it. On my way to an early death at least.</p>\n<p>Five years ago I weighed over 330 pounds. I hated how I looked. I hated how I felt. I hated that I couldn't sleep without a CPAP.</p>\n<p>Now, while most of the physical stuff has changed and I'm significantly in a healthier state, I'm still working on my mental health. Though not as actively as I did on my physical body, I'll admit.</p>\n<p>But, at least now I can select from a wider variety of clothing while I do it.</p>\n<p>This is post 26/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-08T19:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/updates-of-life-and-systems/",
      "url": "https://shanewrogers.lol/posts/updates-of-life-and-systems/",
      "title": "Updates of life and systems",
      "content_html": "<p>I suppose this is the first milestone that I've reached for the 100 Days To Offload challenge - post number 25!</p>\n<p>As those who have read many of my previous posts (and, thank you for that!) you may know that I have struggled of late with some aspects of my keto lifestyle. Not so much the keto part, per se, so much as the amount of calories that I haven't been logging and keeping account of.</p>\n<p>In other words, snacking.</p>\n<p>I was standing in the kitchen earlier today, having toasted a slice of &quot;keto friendly&quot; bread (the heel, if you're curious), buttered and cinnamon &quot;sugar&quot; topped....and stared at it.</p>\n<p>I took a bit of a pause at that moment: <em>did I really want to eat this</em>? I've gone from thinking that I could easily do a 24 hour fast (perhaps even going longer for more frequent timing), to this undesirable feeling that I've got to snack.</p>\n<p>It's not even that I feel hungry.</p>\n<p>I used to eat out of boredom, maybe that's what I'm going back to? I need to get back in the game, my head is just a bit on the spacey side.</p>\n<p>I need to be able to look in the mirror again and be proud of what I've accomplished.</p>\n<p>It's a strange feeling.</p>\n<h3 id=\"in-the-world-of-work\">In the world of work <a class=\"direct-link\" href=\"#in-the-world-of-work\">#</a></h3>\n<p>I was able to get one new task taken care of earlier today. While nothing earth shattering, it was an important item that needs to be done and it makes me a little more useful - not a bad thing.</p>\n<p>Now, I'm getting to work late/after &quot;normal&quot; hours to essentially babysit another application upgrade.</p>\n<p>Not that I mind, it should be uneventful. But you never know.</p>\n<p>The main fun with this type of work is that you get to do it while everybody else in the house is home and I'm downstairs in the &quot;dining room&quot;.</p>\n<p>At least all I should have to do is monitor some CPU cycles then re-enable some schedules.</p>\n<p>....and that went off without a hitch.</p>\n<p>Until next time, we shall leave it at that.</p>\n<p>This is post 25/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-07T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/after-the-storm/",
      "url": "https://shanewrogers.lol/posts/after-the-storm/",
      "title": "After the Storm",
      "content_html": "<p>Talk about one heck of a week.</p>\n<p>We had a pretty standard storm come through the area on Wednesday night, with the added benefit of up to 80 mile per hour winds at the head of it. Lots of trees down. Lots of power lines down. We were without power for just under 24 hours here, though some unfortunately people were much longer.</p>\n<p>If it's something that we take for granted, it's electricity. Thankfully our home is decently insulated, so the downstairs remained in the lower mid 70s temperature wise. The upstairs, not so much.</p>\n<p>We were gonna have the kids sleep downstairs the second night, but that was not necessary. The thought had occurred to get a couple of hotel rooms, but we didn't really want to spend the near $300 that would have ran us.</p>\n<p>It was certainly very nice when power was restored.</p>\n<h3 id=\"linkdump\">Linkdump <a class=\"direct-link\" href=\"#linkdump\">#</a></h3>\n<p><a href=\"https://irreal.org/blog/?p=12352\">Getting Disappeared</a><br>\nSome preaching to the choir about getting off of Google (et al) services. I'd love to do this myself as well, and have been looking at some alternative solutions.</p>\n<p><a href=\"https://sarah-savage.com/makefiles-make-life-easier/\">Makefiles make life easier</a><br>\nSarah Savage discusses how she utilizes the ever useful and humble makefile.</p>\n<p><a href=\"https://www.brycewray.com/posts/2023/03/time-move-on-nunjucks/\">Is it time to move on from Nunjucks?</a><br>\nNow that WebC is available, is it time to look towards something besides Nunjucks?</p>\n<p>That's all that I've got for now. Until next time.</p>\n<p>This is post 24/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-04T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/new-years-of-a-different-sort/",
      "url": "https://shanewrogers.lol/posts/new-years-of-a-different-sort/",
      "title": "New years of a different sort",
      "content_html": "<p>The new school season is nearly upon us once again.</p>\n<p>We will have three kiddos back in the same building, at least for a little while, with but two grades between them. Not that they don't always have, or that they won't always have two grades between them. Sometimes we forget that the youngest of these three is the <em>youngest</em> of the three - this kiddo has seemed for some time now to be the more mature of them all. Always a surprise to me and also I must admit that I am not overly certain that I am deserving of such amazing children.</p>\n<p>One of the twins will be spending the first part of some days at another school taking higher level math courses. Similar to what the youngest kiddo was going through last year, when he bussed from the elementary school to the middle school for his math course. I am more scared for the elder twin, though, than I was for the younger brother. Probably has to do with the fact he'll be going into a High School, opposed to a middle school.</p>\n<p>I think that everybody will do fine, but as a parent I think I'm allowed to feel that fear for my kiddo.</p>\n<p>We also find ourselves near the time of open enrollment for insurance.</p>\n<p>This year, I'm definitely looking forward to making some changes there. My wife has recently - this is her third week - started working at the same employer as I. Which means that we'll get to save a not insignificant amount of money on insurance! She will take over her own insurance plan and payment, using the same provider. I will continue to cover the kids and myself. All in, we look to save about $500 a month for coverage.</p>\n<p>It is insane.</p>\n<p>I have slowly been working my way through <a href=\"https://thebookofelsewhere.com/\">the book of elsewhere</a>, taking a bit of a break from The Expanse books. The hope is that I can finish reading this before my hardback copy of the BRZRKR graphic novel arrives, which should arrive early October I think. Plenty of time, right?</p>\n<p>This is post 23/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-29T15:00:10+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/some-recent-binges/",
      "url": "https://shanewrogers.lol/posts/some-recent-binges/",
      "title": "Some recent binges",
      "content_html": "<p>We've been watching a lot of streaming shows over the past couple of days.</p>\n<p>I didn't normally go in for the binge mentality of how things seem to be these days, although I haven't ever been against waiting things out for a few weeks to let the (old school) DVR (or, even older Tivo) build up a few weeks worth of episodes to watch.</p>\n<p>I still prefer to not watch them all at once.</p>\n<p>Still though, it does happen.</p>\n<p>Yesterday we watched the entirety of <a href=\"https://m.imdb.com/title/tt16283824/\">Eric</a> on Netflix. It was a pretty decent tale, with a handful of threads that wove together okay. I think that it could probably have been cut down by an hour/an episode, but all things considered it was enjoyable.</p>\n<p>Today we finished up with Netflix's <a href=\"https://m.imdb.com/title/tt14403178/\">Beef</a>. We had watched the first episode the other day, and worked out way through the rest of them today. I really like all of the A24 stuff that I've seen, and this was not too bad either. Granted, the overall story is just insane enough...but then so was Eric.</p>\n<p>So far as other television stuff, I've got my YouTube TV set to record <em>all the Olympics</em> stuff, so I'll watch some of that in time. I'm more of a Winter fan than Summer, though.</p>\n<p>Of course we're also watching <a href=\"https://m.imdb.com/title/tt11198330/\">House of the Dragon</a> and <a href=\"https://m.imdb.com/title/tt1190634/\">The Boys</a>, as one is aught to do.</p>\n<h3 id=\"link-dump\">Link Dump <a class=\"direct-link\" href=\"#link-dump\">#</a></h3>\n<p>I think I can come up with a small handful of links this week, so let us see what's out there.</p>\n<p><a href=\"https://kansasreflector.com/2024/07/28/spyware-turned-this-kansas-high-school-into-a-red-zone-of-dystopian-surveillance/\">Spyware turned this Kansas high school into a ‘red zone’ of dystopian surveillance</a> We had our own little run in with this particular piece of software last year as well, and I can't really honestly say that I'm a fan. I get it, but I don't care for it.</p>\n<p><a href=\"https://howardism.org/Technical/Emacs/literate-writ-large.html\">Literate Programming Writ Large</a><br>\nHoward Abrams is an excellent resource on literate programming in emacs and org mode, this article continues on with more great information along that line.</p>\n<p>....and that, as they say, is that.</p>\n<p>Until next time my friends.</p>\n<p>This is post 22/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-28T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/successful-updates-et-al/",
      "url": "https://shanewrogers.lol/posts/successful-updates-et-al/",
      "title": "Successful updates et al",
      "content_html": "<p>It's been a pretty successful day thus far.</p>\n<p>Upgraded one of our large test application servers with no issues. Insofar as application patches go, it's one of the easier ones that we've got. Not quite of the &quot;click, click, click&quot; and FIN variety, but very close. It does require a certain amount of babysitting, which is completely and totally obnoxious.</p>\n<p>I did get a start on reading my newest book, though I'm going to admit to not making it all that far yet.</p>\n<p><img src=\"https://cdn.some.pics/swrogers/66a14a69306c3.jpg\" alt=\"Photo of the book, &quot;the book of elsewhere&quot; by the authors Keanu Reeves and China Miéville. Next to the book is my blue coffee canister.\"></p>\n<p>On the personal way of life stuff (isn't that what this whole journal thing is, though?) I'm attempting to get my mindset back into the keto game. That doesn't mean that I haven't continued to remain in the keto lifestyle all this time - I have. What I've not done is be more strict/stringent on logging everything I consume, which leads to laziness and unnecessary snacking.</p>\n<p>My weight is slowly sneaking up past that 190 pound entry, way too close to 200 for my taste. Things are not helped along by the fact that we have too much prepackaged junk in the house, sugar free slash keto &quot;friendly&quot; or not. I shall be getting back on that wagon, full speed.</p>\n<p>This is post 21/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-24T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/problems-solved-and-trilogies-read/",
      "url": "https://shanewrogers.lol/posts/problems-solved-and-trilogies-read/",
      "title": "Problems solved and trilogies read",
      "content_html": "<p>It's been a couple of days since my last update, so obviously there must have been basically nothing going on at all.</p>\n<p>Some progress was made in the work/vendor department though, from Friday and on through the weekend. Mainly in that the patch scheduling foobar was taken care of.</p>\n<p>All that took was opening up to two technical support requests. Sigh.</p>\n<p>One of which was really only commented on by the vendor representative once. <strong>Once.</strong> I'm not gonna count the comment that was entered <em>after</em> the second SR was opened and resolved.</p>\n<p>Once that problem was taken care of, we were off to the races on, well, yet another problem. All of which is somewhat related to every tool being moved to someone else's comput....er...cloud.</p>\n<p>I will give them props, though, because at least this particular cloud took us replacing some old arse java app. So, progress. Yay?</p>\n<p>On the home front side, we've got some appointments tomorrow that will need to get taken care of.</p>\n<p>The lawn, yeah, it didn't get taken care of this weekend nor today. I'm hopeful that I can tackle that tomorrow as well.</p>\n<p>Otherwise my poor, poor battery powered mower will not make it.</p>\n<p>I'm also closing in on a third of the way through reading The Icewind Dale trilogy to my kiddos. Good stuff and it's my second time through this series.</p>\n<p>This is post 20/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-22T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/some-questionable-past-choices/",
      "url": "https://shanewrogers.lol/posts/some-questionable-past-choices/",
      "title": "Some Questionable Past Choices",
      "content_html": "<p>It's crazy the stuff that I have packaged up and toted along with me throughout all of my moves.</p>\n<p>What's even crazier are the items that I <em>didn't</em> bring along with me, for some reason or another.</p>\n<p>Items like video games. Lots of cartridges and disks, cases and manuals.</p>\n<p>Games that I wouldn't mind playing again on my SEGA Genesis/SEGA CD/32X (yeah, I had the SEGA Stack....) or Super NES.</p>\n<p>But.</p>\n<p>There's always a &quot;but&quot;, isn't there?</p>\n<p>Do I actually <em>have</em> any of those here with me? No, of course not.</p>\n<p>I do have my boxed Dreamcast and some high profile games, but not the older stuff.</p>\n<p>Sadly, I'll probably never see those things again, either. Last year I made the couple hour trek back to my childhood home, with the hope that I could bring some stuff back.</p>\n<p>My father (whom I love immensely) had moved an entire home full of <em>stuff</em> into a couple of self built storage buildings.</p>\n<p>I was heart broken. Having seen a couple of the figures that I still could find completely covered in dust and dirt and everything, and some electronics just in tatters...the weather had done them no favors.</p>\n<p>Of the items that I was hoping to find (including multiple unopened, complete on card figures) was a complete in box Neo Geo AES with two sticks, memory cards and six games (I think). I can recall Magician Lord, Baseball Stars, 2020 Baseball, Samurai Showdown, I can't recall the others. I'd purchased the whole package over 20 years ago on eBay for less than $600. Good luck trying to find anything similar these days for twice that. This gutted me.</p>\n<p>Completely.</p>\n<p>These days, as I attempt to go through a boatload of boxes, I just have to ask myself: Why would you bring bits and pieces of this stuff, and not the actual decks that make these things work?!</p>\n<p>Gah!</p>\n<p>This is post 19/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-18T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/vendors-gonna-vendor/",
      "url": "https://shanewrogers.lol/posts/vendors-gonna-vendor/",
      "title": "Vendors Gonna Vendor",
      "content_html": "<p>There are a handful of things that I don't understand.</p>\n<p>For one, why can't certain vendors let their customers know that the product that they depend on for their day to day usage was not actually patched to the current patch level on the scheduled time.</p>\n<p>Not only was the time scheduled, but it was of course scheduled by the vendor, seeing as how the customer is basically at the mercy of said vendor.</p>\n<p>Not only did the customer (us) have to check to ensure that the product was patched, but then the customer (us, again) has to contact <em>big vendor</em> support to ask why it wasn't patched.</p>\n<p>Why can't they just pop some kind of email notification that says it was either successful or not?</p>\n<p>Then if not - what the plan of action is?</p>\n<p>Yeah. We asked this question on Monday.</p>\n<p>I was out sick on Tuesday.</p>\n<p>The <strong>only</strong> response we've had thus far was an incorrect notice that none of our instances have been patched at all.</p>\n<p>We have three instances: one each for development, testing and production.</p>\n<p>Our development instance had already been patched, as scheduled, so I got to let the vendor know that...um, no, I don't believe that's correct please don't re-patch.</p>\n<p>Sigh.</p>\n<p>Anyhow - now the vendor has let us know that it's time to board the patching train because they've scheduled the production instance for updating next week, when we haven't had a chance to do <em>any</em> testing in the test instance. Which is less of a playground than dev.</p>\n<p>It's beyond infuriating.</p>\n<p>Welcome to the cloud.</p>\n<p>This is post 18/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-17T17:22:01+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/sunday-stuff-and-link-dumpage/",
      "url": "https://shanewrogers.lol/posts/sunday-stuff-and-link-dumpage/",
      "title": "Sunday stuff and link dumpage",
      "content_html": "<p>It's Sunday. Whatever that means.</p>\n<p>The end of the weekend and the beginning of a new week.</p>\n<p>Currently we're just taking in the time to watch the youngest play in a local indoor jungle gym. It's a friends birthday party for the little.</p>\n<p>So far as Sundays go, it's actually been a moderately busy one.</p>\n<p>The boys and I got haircuts. We went to the store.</p>\n<p>Spent some time at the local splash pad. Definitely a decent way for the little to cool off, but still.... really hot.</p>\n<p>Drove around town for a bit, mainly due to having forgotten when the party started. Ha.</p>\n<p>Now, it's all about figuring dinner out. Although I think we'll let the older kiddos fend for themselves with leftovers and pasta.</p>\n<h3 id=\"link-dump\">Link Dump <a class=\"direct-link\" href=\"#link-dump\">#</a></h3>\n<p>I've been a bit lapse on this listing, but then I'm just not too certain that what I've always got is worth it.</p>\n<p><a href=\"https://spectrum.ieee.org/shipt\">https://spectrum.ieee.org/shipt</a><br>\nShipt's pay algorithm screwing people over. The gig workers weren't gonna have it, so they took things into their own hands to crack open that black box.</p>\n<p><a href=\"https://www.axios.com/2024/07/08/johns-hopkins-bloomberg-donation\">https://www.axios.com/2024/07/08/johns-hopkins-bloomberg-donation</a><br>\nJohn's Hopkins medical school to be free for most students. This is just amazing. An excellent example of the good that can be done via philanthropy.</p>\n<p><a href=\"https://micro.webology.dev/2024/07/12/duckdb-may-be.html\">https://micro.webology.dev/2024/07/12/duckdb-may-be.html</a><br>\nJeff Triplett has a neat example using DuckDB to pull metadata from YouTube.</p>\n<p><a href=\"https://whynothugo.nl/journal/2024/06/13/ssh-as-a-sudo-replacement/\">https://whynothugo.nl/journal/2024/06/13/ssh-as-a-sudo-replacement/</a><br>\nSSH as a replacement for sudo. This is an interesting idea, certainly with a few hoops. I wonder about setting this up...?</p>\n<p><a href=\"https://help.vivaldi.com/desktop/tools/import-and-export-browser-data/\">https://help.vivaldi.com/desktop/tools/import-and-export-browser-data/</a><br>\nMainly for my future use, lots of imports and exports for Vivaldi.</p>\n<p>This is post 17/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-14T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/it-is-mesh-at-least/",
      "url": "https://shanewrogers.lol/posts/it-is-mesh-at-least/",
      "title": "It is mesh at least",
      "content_html": "<p>Sometimes I wonder how in the world I managed to write a new post every day during the previous challenge that I subjected myself to.</p>\n<p>This week has thus far been fairly non eventful. Boredom is a good thing sometimes.</p>\n<p>Last week I made a purchase that I almost regret doing. Even though it's an item that gets daily use, and I'm in it probably eight plus hours a day, which kind of makes it a necessity, I'm not a hundred percent happy with it.</p>\n<p>Obviously it's some kind of work from home item. It's the <a href=\"https://www.staples.com/union-scale-flexfit-hyken-ergonomic-mesh-swivel-task-chair-black-un59460/product_990119?cid=EM:ordconfrm::sku&amp;\">Hyken Mesh Chair</a> from Staples. The one thing that I'm not happy with is the &quot;headrest&quot;.</p>\n<p>Note the quotes there.</p>\n<p>As it's not super adjustable, this headrest comes all the way up to in between my shoulder blades.</p>\n<p>Unless I crouch down.</p>\n<p>Which I am not going to do.</p>\n<p>Fortunately I can remove it, which I'll probably do.</p>\n<p>Other than that, it's an okay chair for those who don't have or can't afford to get the kick arse Herman Miller Aeron. Sigh.</p>\n<p>Ah well, back to the grind!</p>\n<p>This is post 16/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-11T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/first-day-back/",
      "url": "https://shanewrogers.lol/posts/first-day-back/",
      "title": "First Day Back",
      "content_html": "<p>First day back is now in the bag!</p>\n<p>Not nearly as bad as those times when I take two weeks off (FSM knows that those both make me want to never take another vacation <strong>and</strong> never go back to work again) but there was still a bit of cleanup and catch up to do.</p>\n<p>Some of the cleanup involves coming back in to work post fiscal year end, when it's not necessarily been completely opened back up. Not a huge deal, but still needs to be taken care of.</p>\n<p>There is also the metric arse ton of email to sift through. Although I'll be honest and say that I do continue to keep my work email synching through my phone and delete most of the crap that doesn't pertain to me.</p>\n<p>Sue me. I don't like surprises.</p>\n<p>What was best today, though, was not one but <em>TWO</em> Monday morning meetings.</p>\n<p>Back to back.</p>\n<p>Right up there with Friday afternoon meetings with my favorites.</p>\n<p>Fortunately these are extremely rare for me and Mondays are generally pretty tame.</p>\n<p>Well, I'm thinking it's getting close to dinner time and I haven't yet figured out what to feed the kids - I probably ought to take that under consideration.</p>\n<p>Until next time.</p>\n<p>This is post 15/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-08T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/post-fourth-post-vacation/",
      "url": "https://shanewrogers.lol/posts/post-fourth-post-vacation/",
      "title": "Post-Fourth Post-Vacation",
      "content_html": "<p>Does Sunday count as a vacation day, ergo being the last day of a vacation?</p>\n<p>I can't say that I've ever actually counted the weekends in my vacation, but I suppose they do.</p>\n<p>Tomorrow is return to work day. We'll put &quot;return&quot; in quotes, seeing as I work from home and it's not like we actually left home over the last week.</p>\n<p>There were no plans set out for the week, so nothing was accomplished. But on the other hand, seeing as there were no plans to do anything I can't be disappointed that nothing got done!</p>\n<p>Win win for everybody on that one.</p>\n<p>The family did get out for the Fourth of July (non) event that was held in town. There was music (not that great), craft booths (not that great), food trucks (probably decent, but not our kind of nutrition), and a drone show.</p>\n<p>Oh, and a kids play area. Which was fun for the young one.</p>\n<p>We went for less than an hour and walked around to see what was what. Finding things not worth it, we left to go get the kids some ice cream cones.</p>\n<p>We did go back for the drone show, which was supposed to start at 9:45.</p>\n<p>Then it was supposed to start at 10:00. Then 10:30. 10:45. Then it was called at 11:00.</p>\n<p>At which time it started raining.</p>\n<p>Evidently, the vendor was having issues getting the show code loaded onto the 200 drones via their Verizon Wireless hotspot. They shoulda had T-Mobile. Ha.</p>\n<p>The weather had stunk all day, so they weren't able to do the pre-work earlier, either.</p>\n<p>Now, the city has a $30,000 credit for next year.</p>\n<p>We were really looking forward to seeing how it went, so I guess we'll check it out next year.</p>\n<p>This is post 14/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-07T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/fourth-of-july-post/",
      "url": "https://shanewrogers.lol/posts/fourth-of-july-post/",
      "title": "Fourth of July Post",
      "content_html": "<p>Happy Fourth of July, for those that celebrate.</p>\n<p>Yet another Holiday here in the States where we, basically, get to set our wallets on fire.</p>\n<p>Quite literally in some cases.</p>\n<p>I will admit that this is one of my favorite days of the year.</p>\n<p>It is currently just after 22:30 Central time, we just finished up with our small handful of fountains and sprinklers. The kids seemed to enjoy themselves, and yet another year with no need to send anybody to the emergency room is a win in my book.</p>\n<p>This was also one of the cheaper years that we've managed to get away with, with a bill only just shy of two hundred.</p>\n<p>Yeah, we totally didn't need to spend the money. But think of the kids! Especially the six year old who lives for the smoke bombs.</p>\n<p>Still more than I'd like to spend for an hours worth of entertainment.</p>\n<p>In other news, we will be back to a double income family soon. Super nice.</p>\n<p>Until next time!</p>\n<p>This is post 13/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-04T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/the-next-day/",
      "url": "https://shanewrogers.lol/posts/the-next-day/",
      "title": "The Next Day",
      "content_html": "<p>First day of vacation and I'm already sick and tired of it. <em>Note: it's now the second day, but my feelings haven't changed much here.</em></p>\n<p>Maybe one of these times I can actually plan to go somewhere or do something, get away from things.</p>\n<p>I just don't get it.</p>\n<p>These things should be enjoyable, right?</p>\n<p>Does it help that most of the people - it seems - in this home are depressed? I'm gonna go with a &quot;No sir, not one bit&quot; on that one my friends.</p>\n<p>We've got one adult who is dealing with a loss of something that never should have happened in the first place (something that never should have to to fruition to have <em>been lost</em>, that is). Another adult dealing with their own family issues, which are by their nature spilling over into the home life. Kids who we are trying to keep from becoming depressed.</p>\n<p>I'm walking on eggshells around here, and it's extremely tiring.</p>\n<p>This is post 12/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-07-02T14:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/time-aplenty/",
      "url": "https://shanewrogers.lol/posts/time-aplenty/",
      "title": "Time aplenty",
      "content_html": "<p>What a week!</p>\n<p>Last week was quite a ride. The weekend hasn't been much different.</p>\n<p>I look through a few job listings, not only for my spouse but - potentially - for myself as well.</p>\n<p>Again, not that I'm looking to replace my current job, but perhaps more to supplement what I do have.</p>\n<p>As far as the spouse goes, well, sometimes I feel like I'm kind of limited. She is great with children and youths, not so much with peers.</p>\n<p>It's her perfectionism and drive to do things by the book. Which, in and of itself is not so much a bad thing.</p>\n<p>However, when you are around a new group of coworkers who have been doing things the same way for <em>years</em>, well, then that can be a little dicey.</p>\n<p>It's not always good to be that squeaky wheel. It gets greased, or it gets replaced.</p>\n<p>Not to mention the fact that fitting I to a new clique can be extraordinarily difficult.</p>\n<p>Another thing that makes things challenging is that I'm not the most patient teacher, I think. Especially when it comes to how basic computer applications work. I do understand that I should do better here, do more teaching rather than taking over and doing.</p>\n<p>There are a lot of jobs out there these days that require basic skills - not to mention even getting an application submitted. I get frustrated far too easily, sometimes.</p>\n<p>No matter what she does, though, I completely will be here to support.</p>\n<p>All things said, even hobbies can make some extra money. There have been plenty of ideas in this home, plenty of supplies have been purchased, now there is also an abundance of time.</p>\n<p>This is post 11/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-30T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/change-and-stock-in-trade/",
      "url": "https://shanewrogers.lol/posts/change-and-stock-in-trade/",
      "title": "Change and stock in trade",
      "content_html": "<p>I had something written up earlier that I was going to post, but as is often the case in life things change.</p>\n<p>Is it always for the best?</p>\n<p>I find that I am, for the first time in a very long time, contemplating the need to do one of two things: either procure a second income, or find another income.</p>\n<p>Neither of which is something that I desire to any degree.</p>\n<p>I like what I do and I like where I am.</p>\n<p>However. Something something life.</p>\n<p>Whatever.</p>\n<p>I guess it's time to take stock of what my abilities are and what I'm capable of.</p>\n<p>What a week.</p>\n<p>This is post 10/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-28T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/tighten-that-silver-lining/",
      "url": "https://shanewrogers.lol/posts/tighten-that-silver-lining/",
      "title": "Tighten that silver lining",
      "content_html": "<p>Now is the time to tighten the proverbial belts.</p>\n<p>We will very soon be down to a single income in the home. More or less. I do suppose that the older kiddo does have a paycheck, but he has his own set of problems to take care of.</p>\n<p>One really has to hope that this situation does not last longer than it needs to, and, perhaps, it can be used to open some doors for another opportunity.</p>\n<p>Like now there should be plenty of people hours available to work on getting the home straight for that in-home childcare plan that was mentioned previously.</p>\n<p>Is there a silver lining?</p>\n<p>This is post 9/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-26T18:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/non-events/",
      "url": "https://shanewrogers.lol/posts/non-events/",
      "title": "Non Events",
      "content_html": "<p>It has been a couple of uneventful days, which if I'm being honest is not such a bad thing.</p>\n<p>Work has been moving along at a nice steady pace, with some progress being made on the good old Team Dynamix front.</p>\n<p>On that, I shall say that my enthusiasm has been ever so tempered at this point. There does not seem to be a path forward for our department to be able to have the type of control that we would like, nor some of the project management features that some would hope for.</p>\n<p>We shall, however, make due.</p>\n<p>Next week will be an off week for me. Yet another week of vacation.</p>\n<p>Most people would be super stoked and excited about that, I'm sure, but if you're a reader of my past posts you might know that I'm not a fan.</p>\n<p>However, my wife also has next week off - so maybe we can get out and hit a local park or something with the kids. Take advantage of those uber expensive passes we have.</p>\n<p>What we really should do, though, is work on getting our extra bedroom set back up for the eldest kiddo. Along with the rest of the home. We are considering getting licensed by the State for an in-home childcare center. To do that will require a little bit of setup but totally worth it.</p>\n<p>Of course, I know for a fact what we'll <em>actually</em> do next week. Absolutely nothing. Apart from doing stuff with the kids for the Fourth of July.</p>\n<p>Here's to a good rest of the week.</p>\n<p>This is post 8/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-25T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/single-party/",
      "url": "https://shanewrogers.lol/posts/single-party/",
      "title": "Single Party",
      "content_html": "<p>When I was in middle school, in what now seems like half a million years ago, a friend and I started writing stories.</p>\n<p>We each had a single subject notebook and filled them with what were - to us anyhow, at the time - fantastically interesting tales.</p>\n<p>I can't recall what stories my friend had written about (and, sadly, cancer has taken him) but mine was some kind of   space opera mash up with robots and power suits and who knows what all else.</p>\n<p>I'm sure that it was all horribly juvenile, but it felt really grandiose to me at the time.</p>\n<p>My Mom even read what I had one at one point and did say that it was pretty good. Of course, as a parent you are a little biased.</p>\n<p>She was - is? - well read, however, and did encourage me to read a large variety of works. I still have that love of reading.</p>\n<p>There are far too many conversations going on in this house, I can not recall where I was going with any of these thoughts.</p>\n<p>Oh, yes. Writing. Write anything. I've seen a lot of posts from people recently who struggled to start writing, who thought that people would not want to read what they had to say.</p>\n<p>Does any of that matter? No.</p>\n<p>When writing for yourself, it matters not what your getting down. It doesn't matter if you think it's &quot;juvenile&quot; or otherwise uninteresting - you are writing for yourself.</p>\n<p>It matters not if my readership is a party of one.</p>\n<h3 id=\"the-link-dump\">The Link Dump <a class=\"direct-link\" href=\"#the-link-dump\">#</a></h3>\n<p>Now for the Sunday link dump.</p>\n<ul>\n<li><a href=\"https://wand3r.net/adding-a-reply-on-mastodon-to-each-post/\">Add a Reply on Mastodon Link</a> Brandon has a pretty good idea using a new feature of omg.lol's version perma-urls and redirects that I might see about adopting here.</li>\n<li><a href=\"https://michal.sapka.me/blog/2024/leaving-firefix-behind/\">Michal is looking for a new browser</a> what with all the ad (and ai, and -nauseam) nonsense that's going around these days, is there any wonder that people are looking to move on from the behemoths? I've tried nyxt, it's interesting and different, but I'm thinking I might move to Librewolf.</li>\n</ul>\n<p>I guess I didn't have much linkage for this week. I've just not been spending much time going down the rabbit holes lately.</p>\n<p>Until next time.</p>\n<p>This is post 7/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-23T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/some-works-of-art/",
      "url": "https://shanewrogers.lol/posts/some-works-of-art/",
      "title": "Some works of art",
      "content_html": "<p>I figured that today would be a good time to post something a little more lighthearted.</p>\n<p>So I present some of the artwork of my youngest kiddo, which is basically overtaking all of the free space of the fridge.</p>\n<p>Not that there is a problem with that, of course.</p>\n<p><img src=\"https://cdn.some.pics/swrogers/66764667ab663.jpg\" alt=\"Photo of children's artwork taking over a refrigerator\"></p>\n<p>This is post 6/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-21T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/food-and-weight-again/",
      "url": "https://shanewrogers.lol/posts/food-and-weight-again/",
      "title": "Food and Weight Again",
      "content_html": "<p>I know that I have previously written on my struggle to work on maintaining my weight, as well as some of the body and confidence issues that go along with that.</p>\n<p>We shall count today's journal entry as yet another one of those.</p>\n<p>Within the next two months, August 8th I believe, will the the fifth year milestone of living a keto lifestyle.</p>\n<p>Before that, I remember sitting in my office chair and watching these amazing transformation videos of people. It always felt a little hypocritical of myself when I did this. There I sat, three hundred thirty plus pounds, knowing that I would never be able to be one of those with a success story of my own.</p>\n<p>Within weeks of starting keto, I knew that I wanted nothing more than to just be down a hundred pounds after one year.</p>\n<p>Well, I like to say that I basically turned that whole change into a game: how large of a calorie restriction could I maintain, how close to zero net carbs could I average?</p>\n<p>I blew way past that hundred pounds loss within that year and was already very close to my current weight already.</p>\n<p>My lowest weight was in the 168 pound ballpark. I'm a six foot two plus guy, and I know for a fact that that was too low. I did not look good.</p>\n<p>I have slowly worked back up to low 190s. Insofar as health goes, I know that's perfectly acceptable.</p>\n<p>But. Mentally, it is not good enough for me. I want 180s. For my mind, where I'm at is just too close to 200. I don't want to be there again.</p>\n<p>So, I know that I dropped the weight (I don't like to say I <em>lost</em> it, because I really don't want to <em>find</em> it again) really quickly. Probably not super healthily either. However, I have managed in many ways to change my relationship with food.</p>\n<p>I never really ate my feelings. It was more out of boredom than anything. Now, I really try to enjoy the feeling of looking better and use the extra time to read or work on some other self development process.</p>\n<p>If I have missed anything at all during this life change, it's that my hair is no longer thick and composed of ringlets (think Weird Al hair). That's about the only thing I miss. But, it could be age related as well.</p>\n<p>Today has been a good day, thus far, when it comes to food. Here's to keeping on.</p>\n<p>This is post 5/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-20T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/power-or-lack-thereof/",
      "url": "https://shanewrogers.lol/posts/power-or-lack-thereof/",
      "title": "Power Or Lack Thereof",
      "content_html": "<p>What to say about today?</p>\n<p>Today is Juneteenth. This would be the first year that my place of employment has (I think...) provided those of us who are able to have the Holiday off, off. There are those who are declared as essential, so I would assume that they could have their Holiday moved, or just make the extra pay. I don't honestly know how that will work for this case.</p>\n<p>Me, being a white, caucasian, cis dude who is near half a century old at this point in his life...I can not help but just feel really kind of weird having this day off as a Holiday. Now, I absolutely do believe that it should be a Holiday, no doubt about that.</p>\n<p>It just feels strange for me, personally, to have the day out.</p>\n<p>Okay, that's about as political as I ever want to get.</p>\n<p>In other moments of not so much excitement, the power was off for an hour or so here.</p>\n<p>No idea what happened, but it did provide a moment to ponder and read a part of my newest book:</p>\n<p><img src=\"https://cdn.some.pics/swrogers/6671c7a543862.jpg\" alt=\"Photo of book &quot;Jonathan Strange and Mr. Norrell&quot; by Susanna Clark. First Edition, First printing, US Edition, Black Cover.\"></p>\n<p>I remember watching the series of this when it aired a few years ago and thought that it might make a good read.</p>\n<p>I was grateful to have found a good hardback copy of the first printing/first US edition for a really good price.</p>\n<p>Here's to eventually getting it finished!</p>\n<p>This is post 4/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-19T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/not-from-the-peanut-gallery/",
      "url": "https://shanewrogers.lol/posts/not-from-the-peanut-gallery/",
      "title": "Not From the Peanut Gallery",
      "content_html": "<p>I am notoriously difficult to purchase any kind of gift for.</p>\n<p>Anything that I generally want, I have a tendency to go ahead and make the purchase at any and every time.</p>\n<p>Anything that I <em>don't</em> immediately buy, is most likely because the item just cost too much and I can not justify the purchase.</p>\n<p>I do have a few things that I enjoy though, and high on that list is anything and everything Peanuts.</p>\n<p>Of the <a href=\"https://en.m.wikipedia.org/wiki/Charles_M._Schulz\">Charles Schulz</a> variety, of course. Charlie Brown, Snoopy, Woodstock, all of them! I've been enamored of the crew since I was a child.</p>\n<p>Some of my earliest memories of reading, not just making things up and babbling and looking at pictures, is of laying on the living room floor, the Sunday Comics spread open in front of me, reading and laughing at Peanuts.</p>\n<p>I remember Dad asking me if I was actually reading, then him being surprised when I said yep!</p>\n<p>All of that to say that my wife is pretty awesome! She always knows what to get me.</p>\n<p><img src=\"https://cdn.some.pics/swrogers/6671b4a30cb0e.jpg\" alt=\"A Charlie Brown Squish Mellow. \"></p>\n<p>The best squishmellow of all time!</p>\n<p>This is post 3/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-18T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/the-banana-thing/",
      "url": "https://shanewrogers.lol/posts/the-banana-thing/",
      "title": "The banana thing",
      "content_html": "<p>Last night my head was killing me.</p>\n<p>This morning my head was still killing me. I have to say that I consider myself extremely fortunate to have a very flexible career that affords me the ability to take time when I need it. It is not something that need be done very often - not for myself anyhow - but I'm more than happy to take it.</p>\n<p>Currently, I'm sitting in the quiet of the dinning area, watching one of the kiddos make some kind of banana <em>slash</em> chocolate <em>slash</em> puff pastry dessert that he and Mom had seen online somewhere. It looks interesting, and I'm sure it'll be tasty for them.</p>\n<p>Did I mention that this kiddo is only just out of fifth grade? He's been baking and cooking for what seems like a couple of years now. The kiddo is very driven and fairly well rounded.</p>\n<p>Normally, anyhow. Sometimes these kids will surprise with some of those &quot;You asked what?!&quot; questions. They are all super intelligent, have gifted IEPs in school, but still - on occasion - they show their age and remind us that they are still children, and need guidance to make their way.</p>\n<p>And that is perfectly fine. It's what we are here for.</p>\n<p>This is post 2/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-17T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/happy-fathers-day/",
      "url": "https://shanewrogers.lol/posts/happy-fathers-day/",
      "title": "Happy Fathers Day",
      "content_html": "<p>As today prepares to come to an end, I'm sitting here at home waiting on the ibuprofen and acetaminophen cocktail to do its thing.</p>\n<p>We did make it to Worlds Of Fun, as a way to have a fun Father's Day. It was a pretty good day. There were a couple of us that managed to get in a few good coaster rides, facilitated by some decently short lines.</p>\n<p>I had never ridden the Prowler before today - definitely one of my new faves. It's an older wooden coaster, I think it's celebrating a birthday this year as well. I'm kind of surprised that I had never been on it previously, but sure glad that I did.</p>\n<p>Now I've just got to get over the heat and sun induced ache that I've put myself through.</p>\n<h3 id=\"the-sunday-linkdump\">The Sunday Linkdump <a class=\"direct-link\" href=\"#the-sunday-linkdump\">#</a></h3>\n<p>I don't really have a whole lot this week, as I've just not really had the time to go down too many rabbit holes this week.</p>\n<p><a href=\"https://www.tiltedwindmillpress.com/product/ryoms-preorder/\">Michael W Lucas' Run Your Own Mail server preorder</a> I've previously run my own mail server, sort of successfully, but not from scratch. This book is on my radar.</p>\n<p><a href=\"http://www.phrack.org/index.html\">Phrack Magazine</a> Somebody had brought up 2600 magazine awhile ago, and this is another (non printed) magazine that's dedicated to the scene. I've read 2600 for decades, and also enjoy reading this one when it's available.</p>\n<p>Like I say, not a lot this week.</p>\n<h3 id=\"end-stuff\">End stuff <a class=\"direct-link\" href=\"#end-stuff\">#</a></h3>\n<p>I'm going to consider this my first entry into the <a href=\"https://100daystooffload.com/\">#100DaysToOffload</a> challenge for the next 365 days. I don't have any special pages set up for these, besides using the hashtag.</p>\n<p>This is post 1/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-06-16T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/a-not-so-rainy-day/",
      "url": "https://shanewrogers.lol/posts/a-not-so-rainy-day/",
      "title": "A not so rainy day",
      "content_html": "<p>Happy Father's Day Eve!</p>\n<p>To all of those who are parent figures to somebody or other who needs the support or the assistance, here's to a day filled with the joy and happiness that goes along with that personal fulfillment!</p>\n<p>As a father figure to my kiddos, I have cherished every day I've been around them. Have they all been easy days? Oh, heck no. But even those difficult and challenging days are completely worth it.</p>\n<p>Anyhow, on to today's stuff!</p>\n<p>Not that I've got anything really special to impart today.</p>\n<p>It was supposed to rain today, so the first thing I did upon waking up was head out and get the lawn mowed. It takes about an hour, so long as I'm able to keep up on it every week.</p>\n<p>We've got an old Snapper battery operated mower, with a 4Ah and a 2Ah battery pair. I really love it when I can get things done within a single battery. This morning was no different.</p>\n<p>While the battery operated mower is nice and we don't have to put up with having a gasoline container in the garage, it does entail the need to mow more often. Otherwise you wind up with a field that the poor machine just can't deal with.</p>\n<p>Did it wind up raining? Of course not. It looked pretty gnarly though.</p>\n<p>I'm sure it'll rain tomorrow though. That would be perfect, especially since we plan on heading to World's Of Fun for the day.</p>\n<p>Lastly, I'm considering doing the whole <a href=\"https://100daystooffload.com/\">100 Days To Offload</a> challenge.</p>\n<p>I figure that since I'm trying to write more that it might be something worth doing. I like personal challenges of this sort.</p>\n<p>With that, until next time.</p>\n",
      "date_published": "2024-06-15T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/not-the-battery-you-say/",
      "url": "https://shanewrogers.lol/posts/not-the-battery-you-say/",
      "title": "Not the battery you say",
      "content_html": "<p>This morning, the vehicle was taken into the local big box retailer that also happens to have a tire and lube department. Supposedly they can also check batteries, but honestly I don't know how much I'd trust them to even unlock a vehicle if you handed them the keys and a YouTube video with instructions.</p>\n<p>This is coming from a person who used to be a salary manager at this store. So, yeah, when you've worked there and seen that the department has had to replace two engines because reasons - you lose what little faith there was.</p>\n<p>Where was I? Oh, yes, the vehicle was taken into this store to get the battery checked and maybe replaced. Evidently, they checked the battery and it was fine. I guess.</p>\n<p>I don't know, though. The car is over 36 months old, so in my opinion I think we should replace the thing. It's spendy, but I'd rather not get stranded. I suppose that I'll just keep the mobile jumper in it. Charged.</p>\n<p>The spouse drove it around to her appointments today as well and has said that it did not act up. I would like to follow through with some plans we had for this weekend and go to the local amusement park - but I've got trust issues.</p>\n<p>I have been known to basically be done with my car at the onset of issues. Seems bad, but, it is what it is.</p>\n<h3 id=\"other-stuff\">Other Stuff <a class=\"direct-link\" href=\"#other-stuff\">#</a></h3>\n<p>We've been watching <a href=\"https://m.imdb.com/title/tt12637874/\">Fallout</a> over the past week. Not too bad, certainly looking forward to seeing where it goes.</p>\n<p>I don't know what we'll watch next, but it's not for lack of content.</p>\n<p>Kingdom Hearts came out on Steam. I had not intended on buying the bundle...but I bought the bundle. Of course.</p>\n<p>While I really do think that I like my blogging set up and workflow here, the tinkerer in me just can't leave well enough alone. I've set up a small digitalocean droplet and installed <a href=\"https://withknown.com/\">Known</a> once again. I like it, but I'm just not sure that I <em>love</em> it. I'll probably stick with what I've got.</p>\n<p>It's hard to beat flat text files and markdown.</p>\n",
      "date_published": "2024-06-14T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/our-feline-friend/",
      "url": "https://shanewrogers.lol/posts/our-feline-friend/",
      "title": "Our feline friend",
      "content_html": "<p>Let me begin today by first stating that I love our cat.</p>\n<p>I'm a cat person, more than any other animal. Please note that I stated &quot;I'm a cat person&quot; and not &quot;I'm a pet person&quot;.</p>\n<p>Over the years I've come to the conclusion that I much prefer <em>other people's pets</em> to having my own.</p>\n<p>It's just so, so much easier. And cheaper. Don't want to forget cheaper.</p>\n<p>All right, now that that's out of the way. Again, I really love our cat. He's a big ol' gray and white beast that would rather just leave you alone so much as look at you. Which is totally cool with me.</p>\n<p>I don't have to worry about him getting around my work area or laying on my laptop. I don't, generally, have to worry about him being underfoot. With the general exception of him racing me downstairs in a vain attempt to trip me.</p>\n<p>Of course life isn't all gumdrops and lollypops with the cantankerous cat around. No sir.</p>\n<p>He's an indoor cat. If it's one thing that I like even less than pets it's fleas. Most likely because fleas <em>really</em> love me. So what's the one thing in all the world that this animal desires?</p>\n<p>Yep. Uh huh. He absolutely desires to go outside. Even just the garage. And good golly gee whiz is he <strong>uber, super</strong> vocal about it.</p>\n<p>I'd swear, listening to this bad boy <strong>meowrl</strong> just could drive me insane. Dude is loud. Like, if I didn't know better we'd swear he was a she and not neutered (he is).</p>\n<p>It's a near constant ordeal, some days.</p>\n<p>Have I told you I love my cat?</p>\n",
      "date_published": "2024-06-11T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/it-still-pains/",
      "url": "https://shanewrogers.lol/posts/it-still-pains/",
      "title": "It still pains",
      "content_html": "<p>Ah, the great and powerful Monday.</p>\n<p>I actually don't mind Mondays. Sure for some people it's the beginning of the work week (myself included), but it also means a great day of getting stuff done at work with little interruption.</p>\n<p>Naturally today we had about an hour long team meeting to discuss projects new/old/upcoming and other leadership tidbits. I don't mind, at least it wasn't a 3pm (4pm!) meeting on a Friday. Those stink.</p>\n<p>In household news, the granddaughter is starting to feel more and more comfortable. She does get a little upset and sad when her Dad leaves the room or goes to work, but it passes much quicker now than it used to. She's a whole lot happier and just seems to be in a better mood overall now. It's great to see.</p>\n<p>Today we also found out what the final cost of repairs are going to be on the vehicle. Shockingly not as bad as I was anticipating, but then I did have a worse case scenario in my head, just so I could be relieved if that was not the case. It still hurts and is money out the door and straight into the incinerator, but it could have been about a thousand dollars worse.</p>\n<p>Now all we need is for a major appliance to vomit all over itself and call it a day.</p>\n<p>I'm thinking it's about time to get some dinner prepped, so off to do that I go.</p>\n",
      "date_published": "2024-06-10T00:00:00+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/notes-of-yesterday/",
      "url": "https://shanewrogers.lol/posts/notes-of-yesterday/",
      "title": "Notes of yesterday",
      "content_html": "<p>I did not post anything yesterday.</p>\n<p>After over a month of managing to get something put up, I skipped a day.</p>\n<p>And you know what? That's okay.</p>\n<p>It's not a habit until it becomes something more normal. I hope that days like yesterday are more the exception than the rule.</p>\n<p>There was some productivity that was had yesterday, despite the overnight rain I was able to get the lawn mowed and some other weeds taken care of. We've got an older Snapper battery operated lawnmower, and I consider it a major accomplishment if I'm able to get the lawn mowed within a single 4Ah battery. If I can get it weekly, it's usually possible, and only takes about an hour.</p>\n<p>Still, I really need to run the weed eater though.</p>\n<p>The second vehicle is still at the dealership, hopefully it's finished by Monday afternoon. It really stinks not having my car. Not that I go anywhere, or that I could go anywhere at this time. But still.</p>\n<p>I've got a question into our insurance agent, wondering about a few things that are related about that vehicle issue, but I'm not overly optimistic about any responses there. Certainly nothing favorable, anyway.</p>\n<p>It's getting close to that time to begin thinking about birthday gifts for the spouse. Sometimes I'm just not really in a gift giving mood, and this seems to be one of those times. I do, however, think I know what I'm going to get, so that's positive.</p>\n<h3 id=\"last-week's-links\">Last Week's Links <a class=\"direct-link\" href=\"#last-week's-links\">#</a></h3>\n<p>I think I'm going to start something new here, too, this week. In something of an effort to reduce the number of open tabs that I have on my phone, I'm going to add to a listing of links that I've found of interest.</p>\n<ul>\n<li><a href=\"https://tiddlywiki.com/\">TiddlyWiki</a> an older single file wiki based, server less, personal knowledge base application. I haven't used this in forever, it's good to see it's still kicking though.</li>\n<li><a href=\"https://www.linode.com/docs/guides/how-to-install-and-configure-hubzilla/\">How to install and configure hubzilla</a> I like the idea of Hubzilla, and I also like the idea of running my own fediverse something or other. I already have plenty of them, though, and don't need to <em>collect them all</em> in this case.</li>\n<li><a href=\"https://news.itsfoss.com/ente-auth/\">Ente Auth</a> I really need to get away from Google Authenticator, since it kinda stinks. You'd think that Google would at least provide some kind of <em>search</em> for theirs, but.... That's asking quite a lot. Ente seems pretty cool, they've also got a photos replacement.</li>\n<li><a href=\"https://cara.app/home\">Cara</a> Something of an Instagram replacement that has had really good growth over the last few weeks from what I see. They have really strong safeguards and stances on AI.</li>\n</ul>\n",
      "date_published": "2024-06-09T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/half-a-quartet/",
      "url": "https://shanewrogers.lol/posts/half-a-quartet/",
      "title": "Half a quartet",
      "content_html": "<p>Today we had a short conference with one of the music/band/orchestra teachers in the school district. One of the really cool things that our district provides (well, free it isn't...but it's available) is for incoming junior high students the opportunity to try out a variety of band and orchestra instruments over the course of four days, to see what they like.</p>\n<p>All of our kids have participated at this point, the current kiddo just finished his stint up. He went into it grudgingly, steadfast in his thinking that he just wanted to play the violin and nothing else. We did find out, through the whole camp experience, that he is not able to play brass - kiddo was just not able to buzz his lips. That's perfectly acceptable.</p>\n<p>Two of the instrument styles, both I suppose would be woodwinds, he actually played very well. Clarinet and flute. Totally hilarious, especially when considering that he really, <strong>really</strong>, did not want to go those days because he would just not be able to do anything at all with them. Ha.</p>\n<p>Even when all was said and done, what was his top choice? Well, still the violin. Totally cool. That said, his second choice was actually the flute. The actually also recommended that he try to choose the bass, he checked all the &quot;hell yeahs!&quot; on that one. Both the teacher that he worked with on bass, and  the assistant, were former bass players and were very excited to see how well he performed. Fortunately, those skills do translate well to the violin.</p>\n<p>All in all, we should now have half of a string quartet in our home now.</p>\n",
      "date_published": "2024-06-07T15:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/still-wheely-tired/",
      "url": "https://shanewrogers.lol/posts/still-wheely-tired/",
      "title": "Still wheely tired",
      "content_html": "<p>Last evening I had the opportunity to update one of our Oracle applications. Something that I've gone through a handful of times now and have been able to fairly well document. It's kind of a flaky system, in that it requires some toggles and buttons being pressed in a very specific order. A rather unorthodox and strange order in our opinion. But, I've got it down to a science now.</p>\n<p>Today was uneventful. So excellent.</p>\n<p>On the home news side, hopefully tomorrow we will get our second vehicle back after an accident with one of the wheels and a curb. Though it's kind of bittersweet, since it'll be a large bill. Definitely not looking forward to this.</p>\n<p>Yeah, I'm still tired and this whole vehicle situation doesn't help.</p>\n",
      "date_published": "2024-06-06T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/i-am-so-ready/",
      "url": "https://shanewrogers.lol/posts/i-am-so-ready/",
      "title": "I am so ready",
      "content_html": "<p>I'm thinking this is just gonna be a short little snippet of an update.</p>\n<p>There is this part of me that wants to just take a couple of weeks and just &quot;go&quot;. No real destination, no real plans. Just get in the car and drive.</p>\n<p>Realistically, I'd rather get on the bike and ride, but that's kind of challenging when one no longer has a bike to get onto. To qualify, when I refer to a bike, I'm not talking about the peddle powered version.</p>\n<p>Just me. Just on my own.</p>\n<p>I'm so tired.</p>\n",
      "date_published": "2024-06-04T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/not-really-reflection/",
      "url": "https://shanewrogers.lol/posts/not-really-reflection/",
      "title": "Not really reflection",
      "content_html": "<p>I have just not really been feeling it over the last week.</p>\n<p>I do believe that I shall leave it to as an exercise for the reader to figure out why that might be.</p>\n<p>Friday was my &quot;off work&quot; Friday, so it's essentially a four day weekend for me, what with tomorrow being Veteran's Day. I guess I won't actually complain about that, since there really are worse things going on right now.</p>\n<p>Eventually, my complaints won't even be referable as <em>first world problems</em>, for, you know, reasons.</p>\n<p>I just don't understand some people's children.</p>\n<p>But, I sure do believe that we're gonna waltz right into the <em>find out</em> portion of the night's program.</p>\n<p>And I, absolutely, one hundred percent, hope those people find the.... Yeah.</p>\n<p>The rather unfortunate aspect of all of this being, that those of us who do understand some of these things will also get to go along with this ride.</p>\n<p>I don't know who to blame.</p>\n<p>I don't know, I didn't understand.</p>\n<p>What I do know, is that I am at least fortunate being what I <em>am</em>. A white, hetero male.</p>\n<p>I guess I'm lucky.</p>\n<p>I'm also glad that I've already got a mortgage and a roof over our heads.</p>\n<p>I just want my family and kiddos and friends to be able to live and work and play in a safe world.</p>\n<p>I'm not too sure that's going to be the case.</p>\n<h3 id=\"linkdump\">Linkdump <a class=\"direct-link\" href=\"#linkdump\">#</a></h3>\n<ul>\n<li>\n<p>Molly White's Blogroll<br>\n<a href=\"https://www.mollywhite.net/blogroll/\">https://www.mollywhite.net/blogroll/</a><br>\nIf you're on the lookout for some good sources to fill out your feeds, here is a great start!</p>\n</li>\n<li>\n<p>John Scalzi  <a href=\"https://whatever.scalzi.com/2024/11/09/making-money-in-the-next-four-years-and-why-you-need-to-plan-now-to-support-your-favorite-creators/\">https://whatever.scalzi.com/2024/11/09/making-money-in-the-next-four-years-and-why-you-need-to-plan-now-to-support-your-favorite-creators/</a><br>\nAnother great read from a pretty good writer.</p>\n</li>\n<li>\n<p>Scholar’s new rap album seeks to turn the tables on the ‘masters’ from the Old South<br>\n<a href=\"https://theconversation.com/scholars-new-rap-album-seeks-to-turn-the-tables-on-the-masters-from-the-old-south-241895\">https://theconversation.com/scholars-new-rap-album-seeks-to-turn-the-tables-on-the-masters-from-the-old-south-241895</a><br>\nJust seems extraordinarily interesting!</p>\n</li>\n</ul>\n<p>This is post 51/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-05-04T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/another-day-another-day/",
      "url": "https://shanewrogers.lol/posts/another-day-another-day/",
      "title": "Another day, another day",
      "content_html": "<h2 id=\"another-entry-in-the-daily-stuff\">Another entry in the daily stuff <a class=\"direct-link\" href=\"#another-entry-in-the-daily-stuff\">#</a></h2>\n<p>Let's see what we can do about getting something written on the daily, eh? I don't know if I'll be successful here, but it's important to have some kind of goal I guess. I'll file these under the <a href=\"/tags/journal\" title=\"journal tags\">journal</a> tag (note to self: come back and make that a proper link to the journal tag page) so I can do whatever with them in the future.</p>\n<p>Today it's Saturday. Really, most normal adults/kids/people/pigs/horses/spiders/lizards/whatever would probably love a good weekend day. For some reason, I'm not always a fan. I don't know why, I think it's because I miss working. Not that I'm a workaholic, but I find that I enjoy what I do in my normal life. There's just too much stuff that needs to be done during the weekend to maintain a house and home.</p>\n<p>Not that I don't like that stuff, either. It's nearly lawn mowing season - I absolutely love mowing the lawn! I don't think that 12 year old me would believe that statement, but it's true. It's a time to put the buds in and listen to some nerdcore! (note to self: I should make a section dedicated to what I'm listening to, perhaps pull in my lastfm stuff as a data collection via rss.) It's also about time to make another attempt at getting some fruit trees planted, which is always fun.</p>\n<p>Right now, I'm just sitting here, typing away, listening to the <em>Snoopy Show</em> on AppleTV. Outside, the weather is pretty nice, we've got the rather large bounce house set up outside for the youngest kiddo, it's kinda noisy too. It's funny, you know, the things that we purchase for our kids: the things that we would have killed to have when we were young. A swing set slash jungle gym. A bounce house. Various playground type equipment. Stuff that never gets used.</p>\n<p>Well, I guess that's not completely true. It does get used, some. Just not as much as one would have hoped. Meh.</p>\n<p>Sigh, well, I'm out of coffee. Of course, who needs coffee at three thirty in the afternoon? Stupid rhetorical question, that. I always need coffee.</p>\n<h2 id=\"setup-stuff%2C-emacs-wise\">Setup stuff, emacs wise <a class=\"direct-link\" href=\"#setup-stuff%2C-emacs-wise\">#</a></h2>\n<p>This particular emacs setup, what I'm writing in now, from an older laptop running current Pop_OS, isn't really to my liking. Even though it's running the same doom setup as my work machine, it's not perfect. My work machine, I guess I can't really say that I run emacs from that device since I ssh into a locally hosted kvm box via wsl....meh, there are differences. I wish I could grok <code>guix</code> or <code>nixos</code>, but alas, I'm stil stuck in the realm of linux.</p>\n<p>Where was I? Oh yes, I do have <code>org-capture</code> templates set up that work just fine. I need to get the popup capture buffer to take the whole frame, though. I don't like that it also visits the capture buffer in the originally opened frame as well. It's an annoyance.</p>\n<p>I'm sure there should be more. I think I'm going to wait until I've got more, eh, content, here before I get various rss feeds set up for feeding into some of my social sites. I feel that I should probably &quot;own my social&quot;, too, and I do have at least one I run - but it's certainly a chore. We shall see.</p>\n<p>With that, I'm out.</p>\n",
      "date_published": "2024-03-30T20:16:05+00:00"
    }
  ]
}
