{
  "version": "https://jsonfeed.org/version/1",
  "title": "My Corner of the Internet feed for linkdump",
  "home_page_url": "https://shanewrogers.lol/",
  "feed_url": "https://shanewrogers.lol/feed/feed.json",
  "description": "Just a place for me to share some stuff.",
  "author": {
    "name": "Shane Rogers",
    "url": ""
  },
  "items": [{
      "id": "https://shanewrogers.lol/posts/oceans-of-tiredness/",
      "url": "https://shanewrogers.lol/posts/oceans-of-tiredness/",
      "title": "Oceans of tiredness",
      "content_html": "<p>Just got back from taking the kiddos to the local water and amusement park locale...we are all incredibly tired and wore out.</p>\n<p>It was, supposedly, a heat warning kinda day - but honestly it didn't seem nearly as bad as it has in the past. At the park, I didn't even get in too bad a shape until towards the end, and to be realistic I was actually cold.</p>\n<p>It goes along with water and not having a large amount of body fat these days. Something of a side effect I suppose.</p>\n<p>After spending some time with the kiddos in the wave pool, we headed over to the adjoining amusement park and fed the family. The nearby diner has a decent selection of, well, cheeseburgers or chicken fingers, salad, fruit, fries and onion rings.</p>\n<p>Lots of stuff that the kids like.</p>\n<p>Since we have four &quot;dining meals&quot; to go along with the gold entry passes, it makes things more worth it to eat a couple of meals there.</p>\n<p>But, good grief am I shockingly sore.</p>\n<h3 id=\"link-dump\">Link dump <a class=\"direct-link\" href=\"#link-dump\">#</a></h3>\n<p>I don't know how much I'll have for the weekly link dumpage, but here we go!</p>\n<ul>\n<li>\n<p><a href=\"https://github.com/mayank99/11ty-jsx-deno\">mayank99 11ty jsx and tsx template</a><br>\nI'm not really a huge fan of jsx style templating, but I can certainly appreciate the work that others have put in.</p>\n</li>\n<li>\n<p><a href=\"https://www.evalapply.org/posts/clojure-web-app-from-scratch/index.html\">Aditya Athalye - Clojuring the web application stack: Meditation One</a><br>\nI haven't read all of this one, but I'm looking forward to going through it all. I love clojure, and I like trying to write apps and web apps with it</p>\n</li>\n<li>\n<p><a href=\"https://www.analog.cafe/r/a-functional-lego-camera-kit-lego-zh1-i9j8\">Zung Hoang - LEGO camera that works!</a><br>\nAs an <em>adult fan of LEGO</em>, I love this <strong>a lot</strong>.</p>\n</li>\n</ul>\n<p>All right, I'm gonna call that a night!</p>\n<p>Take care, till next time.</p>\n<p>This is post 32/100 of my #100DaysToOffload posts. You can read the other posts in this series <a href=\"/tags/100daystooffload\">here</a>.</p>\n",
      "date_published": "2024-08-25T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/notes-of-yesterday/",
      "url": "https://shanewrogers.lol/posts/notes-of-yesterday/",
      "title": "Notes of yesterday",
      "content_html": "<p>I did not post anything yesterday.</p>\n<p>After over a month of managing to get something put up, I skipped a day.</p>\n<p>And you know what? That's okay.</p>\n<p>It's not a habit until it becomes something more normal. I hope that days like yesterday are more the exception than the rule.</p>\n<p>There was some productivity that was had yesterday, despite the overnight rain I was able to get the lawn mowed and some other weeds taken care of. We've got an older Snapper battery operated lawnmower, and I consider it a major accomplishment if I'm able to get the lawn mowed within a single 4Ah battery. If I can get it weekly, it's usually possible, and only takes about an hour.</p>\n<p>Still, I really need to run the weed eater though.</p>\n<p>The second vehicle is still at the dealership, hopefully it's finished by Monday afternoon. It really stinks not having my car. Not that I go anywhere, or that I could go anywhere at this time. But still.</p>\n<p>I've got a question into our insurance agent, wondering about a few things that are related about that vehicle issue, but I'm not overly optimistic about any responses there. Certainly nothing favorable, anyway.</p>\n<p>It's getting close to that time to begin thinking about birthday gifts for the spouse. Sometimes I'm just not really in a gift giving mood, and this seems to be one of those times. I do, however, think I know what I'm going to get, so that's positive.</p>\n<h3 id=\"last-week's-links\">Last Week's Links <a class=\"direct-link\" href=\"#last-week's-links\">#</a></h3>\n<p>I think I'm going to start something new here, too, this week. In something of an effort to reduce the number of open tabs that I have on my phone, I'm going to add to a listing of links that I've found of interest.</p>\n<ul>\n<li><a href=\"https://tiddlywiki.com/\">TiddlyWiki</a> an older single file wiki based, server less, personal knowledge base application. I haven't used this in forever, it's good to see it's still kicking though.</li>\n<li><a href=\"https://www.linode.com/docs/guides/how-to-install-and-configure-hubzilla/\">How to install and configure hubzilla</a> I like the idea of Hubzilla, and I also like the idea of running my own fediverse something or other. I already have plenty of them, though, and don't need to <em>collect them all</em> in this case.</li>\n<li><a href=\"https://news.itsfoss.com/ente-auth/\">Ente Auth</a> I really need to get away from Google Authenticator, since it kinda stinks. You'd think that Google would at least provide some kind of <em>search</em> for theirs, but.... That's asking quite a lot. Ente seems pretty cool, they've also got a photos replacement.</li>\n<li><a href=\"https://cara.app/home\">Cara</a> Something of an Instagram replacement that has had really good growth over the last few weeks from what I see. They have really strong safeguards and stances on AI.</li>\n</ul>\n",
      "date_published": "2024-06-09T21:05:11+00:00"
    }
  ]
}
