{
  "version": "https://jsonfeed.org/version/1",
  "title": "My Corner of the Internet feed for simple-post",
  "home_page_url": "https://shanewrogers.lol/",
  "feed_url": "https://shanewrogers.lol/feed/feed.json",
  "description": "Just a place for me to share some stuff.",
  "author": {
    "name": "Shane Rogers",
    "url": ""
  },
  "items": [{
      "id": "https://shanewrogers.lol/posts/capture-template-done/",
      "url": "https://shanewrogers.lol/posts/capture-template-done/",
      "title": "Capture Template Done?",
      "content_html": "<h1 id=\"step-two%2C-maybe\">Step Two, Maybe <a class=\"direct-link\" href=\"#step-two%2C-maybe\">#</a></h1>\n<p>Capture template might be ready to go, now.</p>\n<p>Created a new markdown post in the proper directory, with a prompt for the file name, then prepends the year-mm-dd to the file name. Opens a nice empty file, ready for the yasnippet.</p>\n<p>I could probably put more into the capture template to do away with the snippet.</p>\n",
      "date_published": "2024-03-18T17:35:37+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/now-that-we-have-reloaded/",
      "url": "https://shanewrogers.lol/posts/now-that-we-have-reloaded/",
      "title": "Now that we have reloaded",
      "content_html": "<h1 id=\"capture-template---sorta-done\">Capture template - Sorta Done <a class=\"direct-link\" href=\"#capture-template---sorta-done\">#</a></h1>\n<p>Well, it's done enough that I think I'm gonna call it <em>good enough</em> at this point. I'm not particularly happy with the yasnippet yet, in that I can'ts eem to get the <code>tags</code> entry items to space over and have to do that manually. Whatever. It's fine. It's all good.</p>\n<p>I think I need to add a setting into the org capture portion to make sure that the capture window takes up the whole frame, or at least isn't mirrored in another portion of my frame. It's all good, though. That must be the Pete the Cat in me talking. Ha.</p>\n<p>I also had to suppress the emacs warning from yasnippet that complained about changing the buffer - so I may have to either live with what I'll consider a hack, or come up with a better way to insert the ISO creation time stamp for the date frontmatter.</p>\n<p>I'm sure there is more.</p>\n<p>Still plenty of stuff to work on: setting up some data store files to pull in my other feeds, checking into basic webmentions (because I'm super, uber popular....ha)....among other items.</p>\n<p>This slug is acting funny.</p>\n",
      "date_published": "2024-03-18T18:05:18+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/yes-this-is-a-possible-slug-tacular-title./",
      "url": "https://shanewrogers.lol/posts/yes-this-is-a-possible-slug-tacular-title./",
      "title": "Yes, this is a possible slug-tacular title.",
      "content_html": "<h1 id=\"slugs-and-stuff\">Slugs and stuff <a class=\"direct-link\" href=\"#slugs-and-stuff\">#</a></h1>\n<p>That last post had an issue with the permalink and slug. I thought it might have been related to my simple super uber basic slug code....but then, doesn't eleventy create its own slug with the <code>permalink</code> entry in the frontmatter?</p>\n",
      "date_published": "2024-03-18T21:21:42+00:00"
    }
  ]
}
