{
  "version": "https://jsonfeed.org/version/1",
  "title": "My Corner of the Internet feed for weblogpomo2024",
  "home_page_url": "https://shanewrogers.lol/",
  "feed_url": "https://shanewrogers.lol/feed/feed.json",
  "description": "Just a place for me to share some stuff.",
  "author": {
    "name": "Shane Rogers",
    "url": ""
  },
  "items": [{
      "id": "https://shanewrogers.lol/posts/here-we-go-day-three/",
      "url": "https://shanewrogers.lol/posts/here-we-go-day-three/",
      "title": "Here we go day three",
      "content_html": "<p>It's day three of Weblog Posting Month 2024!</p>\n<p>Whew!</p>\n<p>I'll be honest, I was beginning to wonder if I was going to make it today. Today has been challenging, to say the least, so I will be putting off today's reading of the &quot;Writing to Learn&quot; book.</p>\n<p>&quot;Why is that?&quot; - I hear absolutely noone asking. Well, I'll tell you anyhow. I do much of my blog posting through <code>emacs</code> using <code>org-mode</code> capture templates. My current <code>emacs</code> configuration is a semi modified <a href=\"https://github.com/doomemacs/doomemacs\">doom emacs</a> build which has worked very well for me in the past and continues to do so in the present. Generally. I don't know if I had some kind of hardware issue (which is possible, as my config is hosted on a local NAS with used drives) due to perhaps a recent storm, but my org capture templates were just not working at all. Even after a <code>doom doctor</code>, <code>doom purge</code>, <code>doom build</code> cycle...nothing worked.</p>\n<p>Which necessitated a <em>nuclear option</em> of a fresh git checkout of doom and starting over. It's not really a complete do over, though, since I still have my private/personal doom init files that live in a different directory.</p>\n<p>All in all, after about an hour and ten minutes of waiting for the build process to finish (ugh...) we are back to par. Yippee.</p>\n<h3 id=\"the-actual-challenge\">The actual challenge <a class=\"direct-link\" href=\"#the-actual-challenge\">#</a></h3>\n<p>Everything stated, I have actually read a bit of the next chapter, and all of the above was initiated because I wanted to take a handful of notes. One item in particular, about clear writing being evidence of clear thinking. Something of which I really need to strive to do - think clearly. With that, and just a little bit of focus, perhaps I can write clearly.</p>\n<p>Read my other <a href=\"/tags/weblogpomo2024\">#WeblogPoMo2024</a> posts.</p>\n",
      "date_published": "2024-05-03T19:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/another-day-another-chapter.-day-two./",
      "url": "https://shanewrogers.lol/posts/another-day-another-chapter.-day-two./",
      "title": "Another Day, Another Chapter. Day Two.",
      "content_html": "<p>The second day brings with it a second chapter of the <a href=\"https://www.harpercollins.com/products/writing-to-learn-william-zinsser?variant=42347013505058\">Writing To Learn</a> book. To be completely fair, I had read about half of this yesterday and have finished it up this morning. To be even more fair, it will be highly probable that I'll read chapter 3 and add more to this post today as well. Let us find out what has been digested this go round, shall we?</p>\n<h3 id=\"gustavus-adolphus-college\">Gustavus Adolphus College <a class=\"direct-link\" href=\"#gustavus-adolphus-college\">#</a></h3>\n<p>Right out of the gate I learned something. While even the author, Zinsser, did believe that everybody should be able to write - he did literally write the book on the subject - the idea of <em>Writing Across the Curriculum</em> came from the small Midwestern College of <a href=\"https://en.wikipedia.org/wiki/Gustavus_Adolphus_College\">Gustavus Adolphus</a>. Or, at least as well as I can tell according to the text. Even at that point in history (jeeze, only 1985) the professors had a need and a want to move the responsibility of teaching students to write away from the &quot;English&quot; Department. Which makes complete sense to me. We write - or should write - about more than just, well, previously written materials (books, plays, what have you). Noted within this chapter are numerous other great sources of written material - from beautiful mathematic proofs, to how the periodic table of the elements are arranged and why.</p>\n<h3 id=\"a-puzzle-of-the-humanities\">A puzzle of the humanities <a class=\"direct-link\" href=\"#a-puzzle-of-the-humanities\">#</a></h3>\n<p>An interesting point was brought up during my reading today. If one's mind likes to work though puzzles, finding solutions to whatever has been presented to you, then perhaps no matter what the subject matter is it could be possible to find an intriguing route to write about said solution. As an example, the author has noted multiple times that they did not care for chemistry in school. Maybe if some of the work had been phrased the way that <a href=\"https://en.wikipedia.org/wiki/Dmitri_Mendeleev\">D I Mendeleev</a> had worked out the <em>Periodic Law</em> and creating a version of the <em>Period Table of the Elements</em>, then that challenge would have had a more positive effect on him. If there is some way to find a human element to whatever subject matter is being studied or written about, that seems to help a great deal.</p>\n<h3 id=\"a-feeling-of-rambling\">A feeling of rambling <a class=\"direct-link\" href=\"#a-feeling-of-rambling\">#</a></h3>\n<p>I'm doing it again - I feel like I'm just kind of rambling on. I should tighten this stuff up. Meh.</p>\n<p>Let us finish up with a couple of quotes from the chapter that have kind of stuck with me:</p>\n<blockquote>\n<p>Students should be learning a strong and unpretentious prose that will carry their thoughts about the world they live in.</p>\n</blockquote>\n<p>and</p>\n<blockquote>\n<p>...every subject is interesting if an avenue into it can be found that has humanity and that an ordinary person can follow.</p>\n</blockquote>\n<p>These ring well with me. I'm no journalist, no professional writer for sure. But I have read a wide variety of subjects, books, magazines, articles...those that leave the best impression are of the style that don't belittle or &quot;talk down&quot; to the reader. I find it sad that today we are losing a large amount of written work that may never be. Amazing magazines that have stopped printing. Journals that are no longer around. Yes, I am aware of the irony that any readers of this material are doing so on a media that involves a screen. It's easier, but only in so many ways.</p>\n<p>The challenge is finding it.</p>\n<p>Read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts.</p>\n",
      "date_published": "2024-05-02T14:00:56+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/writing-to-learn-weblog-posting-month-2024/",
      "url": "https://shanewrogers.lol/posts/writing-to-learn-weblog-posting-month-2024/",
      "title": "Writing to learn - Weblog Posting Month 2024",
      "content_html": "<p>Well it's finally here: my first entry into Annie's <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">Weblog PoMo 2024</a>. As with most things that I do when it comes to writing, I haven't really planned this out. Does that mean that I'm most likely going to fail at it? That is a definite possibility. But I'm willing to at least give it a shot for myself.</p>\n<p>Of course, there is nothing like getting an <a href=\"https://echofeed.app/\">Echofeed</a> set up for it to help with some accountability - up to and including having the <a href=\"https://beep.town/@echofeedamplify\">Amplify Bot</a> boost your stuff.</p>\n<p>With that out of the way, let's get the ball rolling on <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a>!</p>\n<h3 id=\"writing-to-learn\">Writing to learn <a class=\"direct-link\" href=\"#writing-to-learn\">#</a></h3>\n<p>Or something like that. Writing to learn, writing to keep yourself accountable, whatever the reason it's a good skill to have. It's not necessarily something that one actually appreciates when they are younger. I graduated high school in 1995 and was fortunate enough to have had a couple of college level courses that we were able to take during our senior year - including an English course that included at least one paper. It was a great start on my college and university stint.</p>\n<p>When I did eventually enroll and find myself in college, part of our curriculum was a <a href=\"https://en.wikipedia.org/wiki/Writing_across_the_curriculum\">Writing to learn</a> selection of courses - I believe that we needed required to take two or three of these. The idea - at the time at least - was something that I can't say I was too overly fond of. I was going to be a Computer Science major and didn't feel that I needed to &quot;Write to Learn&quot;. Of course, I did though.</p>\n<p>It wouldn't be until much, <strong>much</strong> later that I would find the source of this sound reasoning: <a href=\"https://www.harpercollins.com/products/writing-to-learn-william-zinsser?variant=42347013505058\">William Zinsser's Book</a>. At least, I assume this to be the source. My plan, my goal, is to actually read this book. I don't think it to be too much to ask. I've already got one chapter down and I find that I really like the flow and the style. So, part of what I write about this month is going to include some of my thoughts on the book.</p>\n<p>This isn't going to be some great article series, no doubt about that. But I do hope that I'm able to improve a bit on my writing, maybe it can even become a habit to write more. I don't think I could hope to be able to write <em>better</em>, I find that I'm pretty well stuck in my ways on that account.</p>\n<p>I will end this entry with a bit of an anecdote. Not long after I moved to Lawrence, I found myself sitting at a local restaurant eating a meal. Behind me sat a couple of who I will assume to be professors from the university and they were having a conversation. The subject of students not knowing how to write papers came up, which was kind of a surprise to me. This was quite some time ago, but from what I can recall I do remember thinking to myself how sad and disturbing that was. How could students in this (that?) day and age make it through high school and into college or university and not know how to write?</p>\n<p>I can only imagine that now, it's a problem that has not gotten any better. Writing is becoming a lost art it seems.</p>\n",
      "date_published": "2024-05-01T16:19:52+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/weblog-posting-month-2024/",
      "url": "https://shanewrogers.lol/posts/weblog-posting-month-2024/",
      "title": "Weblog Posting Month 2024",
      "content_html": "<p>I think I'm going to try to do something that will be very difficult for me. I've decided to join the group in a <em>post every day during the month of May</em> challenge that has been dubbed <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">#WeblogPoMo2024</a>.</p>\n<p>I shall be using the same tag here, <a href=\"/tags/weblogpomo2024\">as well</a> for sake of categorization. I guess it's likely  that I'll even start using the echo feed account that I've been paying for.</p>\n<p>We'll see how this goes. I was able to do the &quot;post a photo every day for 30 days&quot; thing over on microblog to get that badge, which wasn't super easy for me either.</p>\n",
      "date_published": "2024-04-29T21:29:26+00:00"
    }
  ]
}
