{
  "version": "https://jsonfeed.org/version/1",
  "title": "My Corner of the Internet feed for weblogpomo2024",
  "home_page_url": "https://shanewrogers.lol/",
  "feed_url": "https://shanewrogers.lol/feed/feed.json",
  "description": "Just a place for me to share some stuff.",
  "author": {
    "name": "Shane Rogers",
    "url": ""
  },
  "items": [{
      "id": "https://shanewrogers.lol/posts/sponges-and-splashes/",
      "url": "https://shanewrogers.lol/posts/sponges-and-splashes/",
      "title": "Sponges and Splashes",
      "content_html": "<p>My original idea for this month, the challenge of posting a &quot;simple&quot; blog post each day, was to have myself read the &quot;Writing to Learn&quot; book and then give my thoughts on what I had read. This far, I have only succeeded at half of that challenge, having not really made much progress in the book.</p>\n<p>I do say that I'm not really all that surprised. I did take this week off of work, so did my spouse. Therefore I just don't really have much in the way of a desire to sit, read and contemplate. What o have been able to do, though, in stealing away a few bits of time here and there to write, has been of good use. It's been not quite cathartic, but very close, to get words out of my head and onto the screen.</p>\n<p>This morning was field day for the fifth grader. We signed up to assist the teachers with attempting to keep the students under some kind of control. Basically just ensuring that they didn't maim each other. I had myself stationed at what I'll refer to as the <em>sponge fighting</em> location. One of the handful of water areas that are set up. The idea here being that the kids pair up and toss a sopping wet sponge back and forth. If you can't catch the sponge, then you wring it out over your head. It's all good fun. It all more or less kind of devolves into &quot;let's just throw wet sponges at each other!&quot;</p>\n<p>We go back shortly to help out with the Montessori primary group - the kindergartners. It should be a lot of fun. Our six year old is very excited to have us there with him.</p>\n<p>Tonight is another performance, as well. The twins have the last major show for honor choir, which the class has been working towards for some time now. After that, then then of school. It's crazy, how quickly this year has gone by.</p>\n<p>It will soon be midsummer. Then it'll be turkey day. Then new years. Then...</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-10T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/another-day-another-waste/",
      "url": "https://shanewrogers.lol/posts/another-day-another-waste/",
      "title": "Another day another waste",
      "content_html": "<p>I think that I've come to where I would much rather be working. Work is enjoyable, vacations are nothing but just waiting to to back to work. It's not so much a dread for the end of the vacation, but just knowing that I never am able to accomplish what I would like to do during the time away from work.</p>\n<p>Not that I'm disparaging the vacation. I'm equal opportunity when it comes to not being a fan of not working, I'm not really big on weekends either. Granted I'd probably to absolutely insane if I did nothing but work. One has to have some time off.</p>\n<p>Where I work, we get plenty of paid leave to earn. Eight hours per every Eighty hour work period, up to a maximum of 304 hours. Of which I am routinely butted up against. Plus, a discretionary holiday. I really should take more time for myself, I'm told multiple times by multiple people that I should.</p>\n<p>But, alas.</p>\n<p>The current question then becomes, do I feel that anything has been accomplished during this break. There was some yardwork done. The car was washed, by hand, even! I may have gotten the yard mowed once. It just always feels like there is something that needs to be done.</p>\n<p>Meh.</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-09T17:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/the-eighth-day-is-an-early-day/",
      "url": "https://shanewrogers.lol/posts/the-eighth-day-is-an-early-day/",
      "title": "The Eighth Day is an Early Day",
      "content_html": "<p>It's the eighth day of the month. I got to drop the older two boys off for zero hour honor choir a little early this morning, 6:50AM instead of 7:00AM. One wouldn't think that 10 minutes would make much of a difference, but it certainly can. We did get there in time, so yay. Of course, for me just being some place <em>on time</em> actually means that <em>I'm late</em>. Now, if I could only get my spouse to adhere to that philosophy. 😂</p>\n<p>This morning, and tomorrow morning, will both be basically the same. The twins have a music performance on Friday that is the big finale for the year. Tonight we also have a band concert for one of them. Like I said the other day, it's gonna be a full week. It <em>has been</em> a full week.</p>\n<h3 id=\"mobile-editing\">Mobile editing <a class=\"direct-link\" href=\"#mobile-editing\">#</a></h3>\n<p>I think I may have finally found a decent markdown editor that can sync with my git blog repo: <a href=\"https://play.google.com/store/apps/details?id=org.eu.thedoc.zettelnotes\">Zettel Notes</a>. Well, sure, there have been others that can sync and work, but I think I really prefer this one for some reason. Probably because it can actually move files around when requested as opposed to copying them.</p>\n<p>I think the only thing that I would like to be able to do from mobile (apart from easier photo uploads, but someday maybe) would be running the eleventy test server. Other than that, I'm pretty content with what's available now.</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-08T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/and-on-the-seventh-day/",
      "url": "https://shanewrogers.lol/posts/and-on-the-seventh-day/",
      "title": "And on the seventh day",
      "content_html": "<p>Aye, and on the seventh day yet another post has appeared! We are coming up on the end of another school year for our kids, another year that continues to speed on past us. The next few weeks are going to be very full of events. Along with the full schedules, comes special types of stress.</p>\n<p>Stress. Along with most people, I would imagine, I am not a fan. Some people stress eat, thankfully I am not one of those. I eat out of boredom. At least this is something that I am aware of. I've been trying to eat better for a handful of years now, some would say successfully. My wife and myself opted to go the ketogenic journey and I have kept a out 145 pounds off my frame for some time now. Three thirty plus to one eighty five, give or take.</p>\n<p>Okay, so where am I going in all of this rambling? As I get older, as I watch my kids grow into greater ages, I made a decision that I wanted to see them get older. I knew that if I had continued on in the direction that I was going, that I'd be in a grave within very little time. I have no doubt that I have avoided diabetes and at least taken one foot off of the banana peel, so to speak. Not to mention feeling much better and, hopefully, modeling a healthier behavior for my children.</p>\n<p>No rest for myself on this day, though. The second day of my vacation and I've done little to nothing that I would like to get done. Ah, but then who really wants to do pre-spring cleaning on their vacations.</p>\n<p>Read the rest of my <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts.</p>\n",
      "date_published": "2024-05-07T18:00:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/a-day-of-waxing-philosophically/",
      "url": "https://shanewrogers.lol/posts/a-day-of-waxing-philosophically/",
      "title": "A day of waxing philosophically",
      "content_html": "<p>It's day the next around these parts. For whatever that means, right? I've not made nearly the progress on my book that I'd like to, so today's entry will be another one of those &quot;day in the life of&quot; ordeals. I might even be able to make this interesting, but I wouldn't let odds down.</p>\n<p>This year I turn 47. Not quite the same as when one turns 40, though let's be honest here, I don't think my 40th was anything all that spectacular. Nor is it quite the same as turning 50, I'm guessing. As I get older and watch my kids get older, I can't help but think that it really wasn't all that much long ago that I was their age, almost in their shoes, going through similar phases. I've tried to do my absolute best buy my kids. My Dad, who I love, has probably told me that he loves me only a handful of times. I know he does, but I've tried to reverse that trend with my boys.</p>\n<p>I think back to some of the points in my life, I try to correlate how old my kiddo's are, to how old I was, to how old my Dad was (or, would have been at that time). I always wonder what would have been going through his mind. It's just strange, trying to put myself into his place. There are differences between the two of us, there is no doubt there. As parents, we try to ensure that our children have access to things that we never had - or, in my case things that I never knew that I should have or would have wanted. Things as simple as high school yearbooks.</p>\n<p>I didn't go to a large high school, nor did I have an over abundance of friends, nor did I ever think that I would want to ever reminisce about those years of my life. Of course, growing up I think I must have thought that yearbooks just magically showed up at school on yearbook signing day. It never would have occurred to me that there was an (at times) significant cost involved. My kids may not realize it now, but they'll be thankful for those, at least, in the future.</p>\n<p>Yes, we love our kids and want the best for them. Though, what parent does not.</p>\n<p>Anyway, with that I think we shall close out this day.</p>\n<p>Read the rest of my <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts.</p>\n",
      "date_published": "2024-05-06T20:00:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/it&amp;#39;s-the-fifth-day/",
      "url": "https://shanewrogers.lol/posts/it&amp;#39;s-the-fifth-day/",
      "title": "It&#39;s the fifth day",
      "content_html": "<p>This is the fifth day of the challenge! Yesterday was an attempt to post something using the GitJournal app, which sort of worked, but didn't work quite as smoothly as one would have liked. It failed to save the new file in the appropriate folder, though I'm fairly certain I saved it where it needed. Then when trying to move it, it does a copy instead.</p>\n<p>Which plays havoc with the push to git and the workflow run. Sigh.</p>\n<p>So, in my attempt to both come up with a post today <em>and</em> perhaps a decent mobile way to post, today is just straight into the github web site and add a new post. Is it preferable? Absolutely not.</p>\n<p>In other news today, I was able to get the yard mowed before it rained. I've got this feeling that for the next month or so it's basically going to be &quot;mow whenever you flippin' can&quot;. Otherwise, my old battery operated Snapper just - literally - isn't going to cut it.</p>\n<p>Well, off to the store. Tonight is homemade tomato soup and grilled cheese with smoked gouda. Perhaps a tasty antipasto salad as well.</p>\n<p>Wanna read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts?</p>\n",
      "date_published": "2024-05-05T20:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/day-four-nothing-more/",
      "url": "https://shanewrogers.lol/posts/day-four-nothing-more/",
      "title": "Day Four, Nothing More",
      "content_html": "<p>Here we are at day for during this monthly challenge. The next couple of days are going to be the first two that present as very difficult for me - will I be able to get something posted during the weekend, while the home is filled with family and kids and I would rather <em>not</em> be dealing with a computer.</p>\n<p>So in that case, I am not using a computer or laptop for the post. Instead I'm seeing how well the <a href=\"https://gitjournal.io/\">GitJournal</a> app works on my phone. I don't really have any other content management system set up here, so this really needs to work.</p>\n<p>Maybe this would be a good excuse to set up a Ghost CMS for the front end. Probably not, though.</p>\n<p>I've done no reading today, so that's a negative. I did check out the Samurai Jack series from the local library, I'm looking forward to giving that a watch!</p>\n<p>With that....till next time.</p>\n<p>Check out the other <a href=\"/tags/weblogpomo2024\">#Weblogpomo2024</a> posts.</p>\n",
      "date_published": "2024-05-04T21:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/here-we-go-day-three/",
      "url": "https://shanewrogers.lol/posts/here-we-go-day-three/",
      "title": "Here we go day three",
      "content_html": "<p>It's day three of Weblog Posting Month 2024!</p>\n<p>Whew!</p>\n<p>I'll be honest, I was beginning to wonder if I was going to make it today. Today has been challenging, to say the least, so I will be putting off today's reading of the &quot;Writing to Learn&quot; book.</p>\n<p>&quot;Why is that?&quot; - I hear absolutely noone asking. Well, I'll tell you anyhow. I do much of my blog posting through <code>emacs</code> using <code>org-mode</code> capture templates. My current <code>emacs</code> configuration is a semi modified <a href=\"https://github.com/doomemacs/doomemacs\">doom emacs</a> build which has worked very well for me in the past and continues to do so in the present. Generally. I don't know if I had some kind of hardware issue (which is possible, as my config is hosted on a local NAS with used drives) due to perhaps a recent storm, but my org capture templates were just not working at all. Even after a <code>doom doctor</code>, <code>doom purge</code>, <code>doom build</code> cycle...nothing worked.</p>\n<p>Which necessitated a <em>nuclear option</em> of a fresh git checkout of doom and starting over. It's not really a complete do over, though, since I still have my private/personal doom init files that live in a different directory.</p>\n<p>All in all, after about an hour and ten minutes of waiting for the build process to finish (ugh...) we are back to par. Yippee.</p>\n<h3 id=\"the-actual-challenge\">The actual challenge <a class=\"direct-link\" href=\"#the-actual-challenge\">#</a></h3>\n<p>Everything stated, I have actually read a bit of the next chapter, and all of the above was initiated because I wanted to take a handful of notes. One item in particular, about clear writing being evidence of clear thinking. Something of which I really need to strive to do - think clearly. With that, and just a little bit of focus, perhaps I can write clearly.</p>\n<p>Read my other <a href=\"/tags/weblogpomo2024\">#WeblogPoMo2024</a> posts.</p>\n",
      "date_published": "2024-05-03T19:05:11+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/another-day-another-chapter.-day-two./",
      "url": "https://shanewrogers.lol/posts/another-day-another-chapter.-day-two./",
      "title": "Another Day, Another Chapter. Day Two.",
      "content_html": "<p>The second day brings with it a second chapter of the <a href=\"https://www.harpercollins.com/products/writing-to-learn-william-zinsser?variant=42347013505058\">Writing To Learn</a> book. To be completely fair, I had read about half of this yesterday and have finished it up this morning. To be even more fair, it will be highly probable that I'll read chapter 3 and add more to this post today as well. Let us find out what has been digested this go round, shall we?</p>\n<h3 id=\"gustavus-adolphus-college\">Gustavus Adolphus College <a class=\"direct-link\" href=\"#gustavus-adolphus-college\">#</a></h3>\n<p>Right out of the gate I learned something. While even the author, Zinsser, did believe that everybody should be able to write - he did literally write the book on the subject - the idea of <em>Writing Across the Curriculum</em> came from the small Midwestern College of <a href=\"https://en.wikipedia.org/wiki/Gustavus_Adolphus_College\">Gustavus Adolphus</a>. Or, at least as well as I can tell according to the text. Even at that point in history (jeeze, only 1985) the professors had a need and a want to move the responsibility of teaching students to write away from the &quot;English&quot; Department. Which makes complete sense to me. We write - or should write - about more than just, well, previously written materials (books, plays, what have you). Noted within this chapter are numerous other great sources of written material - from beautiful mathematic proofs, to how the periodic table of the elements are arranged and why.</p>\n<h3 id=\"a-puzzle-of-the-humanities\">A puzzle of the humanities <a class=\"direct-link\" href=\"#a-puzzle-of-the-humanities\">#</a></h3>\n<p>An interesting point was brought up during my reading today. If one's mind likes to work though puzzles, finding solutions to whatever has been presented to you, then perhaps no matter what the subject matter is it could be possible to find an intriguing route to write about said solution. As an example, the author has noted multiple times that they did not care for chemistry in school. Maybe if some of the work had been phrased the way that <a href=\"https://en.wikipedia.org/wiki/Dmitri_Mendeleev\">D I Mendeleev</a> had worked out the <em>Periodic Law</em> and creating a version of the <em>Period Table of the Elements</em>, then that challenge would have had a more positive effect on him. If there is some way to find a human element to whatever subject matter is being studied or written about, that seems to help a great deal.</p>\n<h3 id=\"a-feeling-of-rambling\">A feeling of rambling <a class=\"direct-link\" href=\"#a-feeling-of-rambling\">#</a></h3>\n<p>I'm doing it again - I feel like I'm just kind of rambling on. I should tighten this stuff up. Meh.</p>\n<p>Let us finish up with a couple of quotes from the chapter that have kind of stuck with me:</p>\n<blockquote>\n<p>Students should be learning a strong and unpretentious prose that will carry their thoughts about the world they live in.</p>\n</blockquote>\n<p>and</p>\n<blockquote>\n<p>...every subject is interesting if an avenue into it can be found that has humanity and that an ordinary person can follow.</p>\n</blockquote>\n<p>These ring well with me. I'm no journalist, no professional writer for sure. But I have read a wide variety of subjects, books, magazines, articles...those that leave the best impression are of the style that don't belittle or &quot;talk down&quot; to the reader. I find it sad that today we are losing a large amount of written work that may never be. Amazing magazines that have stopped printing. Journals that are no longer around. Yes, I am aware of the irony that any readers of this material are doing so on a media that involves a screen. It's easier, but only in so many ways.</p>\n<p>The challenge is finding it.</p>\n<p>Read my other <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a> posts.</p>\n",
      "date_published": "2024-05-02T14:00:56+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/writing-to-learn-weblog-posting-month-2024/",
      "url": "https://shanewrogers.lol/posts/writing-to-learn-weblog-posting-month-2024/",
      "title": "Writing to learn - Weblog Posting Month 2024",
      "content_html": "<p>Well it's finally here: my first entry into Annie's <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">Weblog PoMo 2024</a>. As with most things that I do when it comes to writing, I haven't really planned this out. Does that mean that I'm most likely going to fail at it? That is a definite possibility. But I'm willing to at least give it a shot for myself.</p>\n<p>Of course, there is nothing like getting an <a href=\"https://echofeed.app/\">Echofeed</a> set up for it to help with some accountability - up to and including having the <a href=\"https://beep.town/@echofeedamplify\">Amplify Bot</a> boost your stuff.</p>\n<p>With that out of the way, let's get the ball rolling on <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a>!</p>\n<h3 id=\"writing-to-learn\">Writing to learn <a class=\"direct-link\" href=\"#writing-to-learn\">#</a></h3>\n<p>Or something like that. Writing to learn, writing to keep yourself accountable, whatever the reason it's a good skill to have. It's not necessarily something that one actually appreciates when they are younger. I graduated high school in 1995 and was fortunate enough to have had a couple of college level courses that we were able to take during our senior year - including an English course that included at least one paper. It was a great start on my college and university stint.</p>\n<p>When I did eventually enroll and find myself in college, part of our curriculum was a <a href=\"https://en.wikipedia.org/wiki/Writing_across_the_curriculum\">Writing to learn</a> selection of courses - I believe that we needed required to take two or three of these. The idea - at the time at least - was something that I can't say I was too overly fond of. I was going to be a Computer Science major and didn't feel that I needed to &quot;Write to Learn&quot;. Of course, I did though.</p>\n<p>It wouldn't be until much, <strong>much</strong> later that I would find the source of this sound reasoning: <a href=\"https://www.harpercollins.com/products/writing-to-learn-william-zinsser?variant=42347013505058\">William Zinsser's Book</a>. At least, I assume this to be the source. My plan, my goal, is to actually read this book. I don't think it to be too much to ask. I've already got one chapter down and I find that I really like the flow and the style. So, part of what I write about this month is going to include some of my thoughts on the book.</p>\n<p>This isn't going to be some great article series, no doubt about that. But I do hope that I'm able to improve a bit on my writing, maybe it can even become a habit to write more. I don't think I could hope to be able to write <em>better</em>, I find that I'm pretty well stuck in my ways on that account.</p>\n<p>I will end this entry with a bit of an anecdote. Not long after I moved to Lawrence, I found myself sitting at a local restaurant eating a meal. Behind me sat a couple of who I will assume to be professors from the university and they were having a conversation. The subject of students not knowing how to write papers came up, which was kind of a surprise to me. This was quite some time ago, but from what I can recall I do remember thinking to myself how sad and disturbing that was. How could students in this (that?) day and age make it through high school and into college or university and not know how to write?</p>\n<p>I can only imagine that now, it's a problem that has not gotten any better. Writing is becoming a lost art it seems.</p>\n",
      "date_published": "2024-05-01T16:19:52+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/weblog-posting-month-2024/",
      "url": "https://shanewrogers.lol/posts/weblog-posting-month-2024/",
      "title": "Weblog Posting Month 2024",
      "content_html": "<p>I think I'm going to try to do something that will be very difficult for me. I've decided to join the group in a <em>post every day during the month of May</em> challenge that has been dubbed <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">#WeblogPoMo2024</a>.</p>\n<p>I shall be using the same tag here, <a href=\"/tags/weblogpomo2024\">as well</a> for sake of categorization. I guess it's likely  that I'll even start using the echo feed account that I've been paying for.</p>\n<p>We'll see how this goes. I was able to do the &quot;post a photo every day for 30 days&quot; thing over on microblog to get that badge, which wasn't super easy for me either.</p>\n",
      "date_published": "2024-04-29T21:29:26+00:00"
    }
  ]
}
