{
  "version": "https://jsonfeed.org/version/1",
  "title": "My Corner of the Internet feed for weblogpomo2024",
  "home_page_url": "https://shanewrogers.lol/",
  "feed_url": "https://shanewrogers.lol/feed/feed.json",
  "description": "Just a place for me to share some stuff.",
  "author": {
    "name": "Shane Rogers",
    "url": ""
  },
  "items": [{
      "id": "https://shanewrogers.lol/posts/writing-to-learn-weblog-posting-month-2024/",
      "url": "https://shanewrogers.lol/posts/writing-to-learn-weblog-posting-month-2024/",
      "title": "Writing to learn - Weblog Posting Month 2024",
      "content_html": "<p>Well it's finally here: my first entry into Annie's <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">Weblog PoMo 2024</a>. As with most things that I do when it comes to writing, I haven't really planned this out. Does that mean that I'm most likely going to fail at it? That is a definite possibility. But I'm willing to at least give it a shot for myself.</p>\n<p>Of course, there is nothing like getting an <a href=\"https://echofeed.app/\">Echofeed</a> set up for it to help with some accountability - up to and including having the <a href=\"https://beep.town/@echofeedamplify\">Amplify Bot</a> boost your stuff.</p>\n<p>With that out of the way, let's get the ball rolling on <a href=\"/tags/weblogpomo2024\">#weblogpomo2024</a>!</p>\n<h3 id=\"writing-to-learn\">Writing to learn <a class=\"direct-link\" href=\"#writing-to-learn\">#</a></h3>\n<p>Or something like that. Writing to learn, writing to keep yourself accountable, whatever the reason it's a good skill to have. It's not necessarily something that one actually appreciates when they are younger. I graduated high school in 1995 and was fortunate enough to have had a couple of college level courses that we were able to take during our senior year - including an English course that included at least one paper. It was a great start on my college and university stint.</p>\n<p>When I did eventually enroll and find myself in college, part of our curriculum was a <a href=\"https://en.wikipedia.org/wiki/Writing_across_the_curriculum\">Writing to learn</a> selection of courses - I believe that we needed required to take two or three of these. The idea - at the time at least - was something that I can't say I was too overly fond of. I was going to be a Computer Science major and didn't feel that I needed to &quot;Write to Learn&quot;. Of course, I did though.</p>\n<p>It wouldn't be until much, <strong>much</strong> later that I would find the source of this sound reasoning: <a href=\"https://www.harpercollins.com/products/writing-to-learn-william-zinsser?variant=42347013505058\">William Zinsser's Book</a>. At least, I assume this to be the source. My plan, my goal, is to actually read this book. I don't think it to be too much to ask. I've already got one chapter down and I find that I really like the flow and the style. So, part of what I write about this month is going to include some of my thoughts on the book.</p>\n<p>This isn't going to be some great article series, no doubt about that. But I do hope that I'm able to improve a bit on my writing, maybe it can even become a habit to write more. I don't think I could hope to be able to write <em>better</em>, I find that I'm pretty well stuck in my ways on that account.</p>\n<p>I will end this entry with a bit of an anecdote. Not long after I moved to Lawrence, I found myself sitting at a local restaurant eating a meal. Behind me sat a couple of who I will assume to be professors from the university and they were having a conversation. The subject of students not knowing how to write papers came up, which was kind of a surprise to me. This was quite some time ago, but from what I can recall I do remember thinking to myself how sad and disturbing that was. How could students in this (that?) day and age make it through high school and into college or university and not know how to write?</p>\n<p>I can only imagine that now, it's a problem that has not gotten any better. Writing is becoming a lost art it seems.</p>\n",
      "date_published": "2024-05-01T16:19:52+00:00"
    },{
      "id": "https://shanewrogers.lol/posts/weblog-posting-month-2024/",
      "url": "https://shanewrogers.lol/posts/weblog-posting-month-2024/",
      "title": "Weblog Posting Month 2024",
      "content_html": "<p>I think I'm going to try to do something that will be very difficult for me. I've decided to join the group in a <em>post every day during the month of May</em> challenge that has been dubbed <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">#WeblogPoMo2024</a>.</p>\n<p>I shall be using the same tag here, <a href=\"/tags/weblogpomo2024\">as well</a> for sake of categorization. I guess it's likely  that I'll even start using the echo feed account that I've been paying for.</p>\n<p>We'll see how this goes. I was able to do the &quot;post a photo every day for 30 days&quot; thing over on microblog to get that badge, which wasn't super easy for me either.</p>\n",
      "date_published": "2024-04-29T21:29:26+00:00"
    }
  ]
}
